package uz.ulugbek.mypresenttest;

import android.support.v7.app.AppCompatActivity;
import android.os.Bundle;
import android.widget.Button;
import android.widget.EditText;
import android.widget.TextView;

public class MainActivity extends AppCompatActivity {
    public TextView textView;



    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        textView=findViewById(R.id.textView);
        String s= "Мен ҳам намоз ўқийман\n" +
                "www.ziyouz.com кутубхонаси 1\n" +
                "МЕН ҲАМ НАМОЗ\n" +
                "ЎҚИЙМАН\n" +
                "Масъул муҳаррирлар:\n" +
                "Абдулазиз МАНСУР,\n" +
                "Анвар ТУРСУН\n" +
                "Таҳрир ҳайъати:\n" +
                "Нуруллоҳ МУҲАММАД РАУФХОН\n" +
                "Муҳаммад ШАРИФ ЖУМАН\n" +
                "Нуриимон АБУЛҲАСАН\n" +
                "Нашрга тайёрловчи:\n" +
                "Абдуллоҳ МУРОД ХОЛМУРОД ўғли\n" +
                "Тартибловчи:\n" +
                "Қудратуллоҳ ЖУМА ўғли\n" +
                "Мусаҳҳиҳа:\n" +
                "Райҳона ХОЛБЕК қизи\n" +
                "Оятлар таржимони ва изоҳлар муаллифи\n" +
                "Абдулазиз МАНСУР\n" +
                "Тошкент\n" +
                "«Янги аср авлоди»\n" +
                "2003\n" +
                "ИСЛОМ ВА ИМОН ШАРТЛАРИ\n" +
                "Ислом тинчликка, покликка, инсонийликка, меҳр-мурувватга, ватанпарварликка, илм олишга\n" +
                "чақирувчи диндир. У инсонни икки дунё саодатига етказади.\n" +
                "Қуйидагилар Ислом динининг рукнларидир:\n" +
                "1. Имон.\n" +
                "2. Ҳар куни беш маҳал намоз ўқиш.\n" +
                "3. Рамазон ойида ўттиз кун рўза тутиш.\n" +
                "4. Закот бериш. Закот Исломда молиявий ибодатдир. Яъни бойлиги нисобга (муаййан\n" +
                "миқдорга) етган мусулмоннинг йилда бир марта ҳақдорларга закот бериши фарз.\n" +
                "5. Ҳаж қилиш. Бу амал моддий жиҳатдан қурби етадиган мусулмонларгагина фарздир.\n" +
                "Қуйидагиларга ишонган киши имонлидир:\n" +
                "1) Аллоҳга;\n" +
                "2) Аллоҳнинг фаришталарига;\n" +
                "3) Аллоҳнинг китобларига;\n" +
                "4) Аллоҳнинг пайғамбарларига;\n" +
                "5) Охират кунига; \n" +
                "Мен ҳам намоз ўқийман\n" +
                "www.ziyouz.com кутубхонаси 2\n" +
                "6) Тақдирга, яъни яхшилик ҳам, ёмонлик ҳам Аллоҳдан эканига;\n" +
                "7) Ўлимдан кейин қайта тирилмоққа.\n" +
                "ИМОН КАЛИМАЛАРИ\n" +
                "«Л`а ил`аҳа иллалл`оҳ, Муҳаммадур расул`уллоҳ».\n" +
                "Маъноси: «Аллоҳдан бошқа илоҳ йўқ, Муҳаммад Аллоҳнинг пайғамбаридир».\n" +
                "«Ашҳаду алл`'\n" +
                "а ил`аҳа иллалл`оҳ ва ашҳаду анна Муҳаммадан ъабдуҳ`у ва\n" +
                "рас`улуҳ».\n" +
                "Маъноси: «Аллоҳдан ўзга сиғиниладиган (илоҳ) йўқлигига ва Муҳаммад алайҳиссалом\n" +
                "Аллоҳнинг қули ва элчиси эканига иқрорман».\n" +
                "ТАҲОРАТ\n" +
                "Ислом дини ҳам вужуд, ҳам қалб тозалигига катта аҳамият берган бир диндир. Севикли\n" +
                "пайғамбаримиз бизга шундай насиҳат қиладилар: «Кучингиз етгунча тозаликка риоя\n" +
                "этингиз, чунки Аллоҳ таоло Ислом динини тозалик устига бино қилди. Жаннатга\n" +
                "ҳам фақат тоза бўлганлар киради» («Жомиус-сағир», 1-жилд, 133-бет).\n" +
                "Аллоҳ таоло Қуръони каримнинг Моида сураси 6-оятида шундай марҳамат қилади (мазмуни):\n" +
                "«Эй имон келтирганлар! Намоз (ўқиш) га турар экансиз, албатта, юзларингизни,\n" +
                "қўлларингизни тирсакларигача ювингизлар, бошларингизга масҳ тортингизлар ва\n" +
                "оёқларингизни (ювингизлар)!».\n" +
                "Бинобарин, динимизнинг устуни ҳисобланган намозни адо этмоқ учун албатта таҳоратли\n" +
                "бўлиш шартдир.\n" +
                "ТАҲОРАТ ОЛИШ ТАРТИБИ\n" +
                "1. Аввало, таҳорат олишга ният қилиниб, «Аъузу биллаҳи минаш-шайтонир рожийм.\n" +
                "Бисмиллаҳир роҳманир роҳийм», дейилади.\n" +
                "2. Қўллар бандигача уч марта ювилади. Бармоқда узук бўлса, қимирлатиб, остига сув\n" +
                "югуртирилади.\n" +
                "3. Ўнг қўлда сув олиниб, оғиз уч марта ғарғара қилиб чайилади ва мисвок қилинади.\n" +
                "4. Бурунга ўнг қўл билан уч марта сув тортилиб, чап қўл билан қоқиб тозаланади.\n" +
                "5. Юз уч марта ювилади.\n" +
                "6. Аввал ўнг қўл тирсаклар билан қўшиб ишқалаб ювилади.\n" +
                "7. Сўнгра чап қўл тирсаклар билан қўшиб ишқалаб ювилади.\n" +
                "8. Ҳовучга сув олиб, тўкиб ташлаб, ҳўли билан бошнинг ҳамма қисмига масх тортилади.\n" +
                "9. Кўрсаткич бармоқ билан қулоқларнинг ичи, бош бармоқлар билан эса қулоқ орқаси масх\n" +
                "қилинади.\n" +
                "10. Иккала кафтнинг орқаси билан бўйин масх қилинади.\n" +
                "11. Чап қўл билан ўнг оёқни ошиқ (тўпиқ) билан қўшиб ва бармоқлар орасини (ишқалаб) уч\n" +
                "марта ювилади.\n" +
                "12. Чап оёқ ҳам шу тарзда уч марта ювилади.\n" +
                "Тирноқларга сурилган лак, теридаги ҳар хил бўёқлар кетказилмасдан олинган таҳорат саҳиҳ\n" +
                "(ҳақиқий) ҳисобланмайди.\n" +
                "Таҳорат олаётганда гапирмаслик, эҳтиёждан ортиқ сув ишлатмаслик, уст-бошга сув\n" +
                "сачратмаслик керак.\n" +
                "\n" +
                "'\n" +
                "Устига ушбу (`-) белги қўйилган ҳарфлар чўзиб ўқилади. \n" +
                "Мен ҳам намоз ўқийман\n" +
                "www.ziyouz.com кутубхонаси 3\n" +
                "ТАҲОРАТНИ БУЗАДИГАН ҲОЛЛАР\n" +
                "1. Баданнинг бирор жойидан қон ёхуд йиринг чиқиб оқиши.\n" +
                "2. Оғиз тўлиб қусиш.\n" +
                "3. Кичик ё катта ҳожат.\n" +
                "4. Ел чиқиши.\n" +
                "5. Милк қонаб, тупурганда тупук рангининг қизил бўлиши;\n" +
                "6. Ҳушдан кетиш;\n" +
                "7. Намоз ўқиётиб, ёнидаги одам эшитадиган даражада кулиш.\n" +
                "ҒУСЛ\n" +
                "Уйқуда эҳтилом бўлиб қолинганида, жинсий алоқадан кейин ҳамда аёллар ҳайз ва нифос\n" +
                "ҳолатидан чиқишгач, ғусл (бутун баданни сув билан ишқалаб ювиш) фарздир.\n" +
                "Бундан ташқари, ҳар жума ва ҳайит намозлари олдидан ғусл қилиш суннат – Пайғамбаримиз\n" +
                "соллаллоҳу алайҳи ва саллам бажарган амаллардандир.\n" +
                "Ғуслнинг фарзлари:\n" +
                "1. Оғизга сув олиб ғарғара қилиш.\n" +
                "2. Бурунга, ачиштиргунча сув тортиш.\n" +
                "3. Бутун баданни тозалаб ювиш.\n" +
                "Ғусл қуйидаги тартибда қилинади:\n" +
                "1. «Бисмиллаҳир роҳманир роҳийм» дейилади ва ғуслга ният қилинади:\n" +
                "«Навайту ан ағтасила ғуслан минал жан`абати рафъан лил ҳадаси ва\n" +
                "истиб`аҳатан лис-сол`ати тақоррубан миналл`оҳи таъ`ала».\n" +
                "Маъноси: Нопокликни кетказиш, намоз ўқишни жоиз этиш ҳамда Аллоҳга яқинлик истаб\n" +
                "ғуслни ният қилдим.\n" +
                "2. Қўллар ювилгач, бадан маний ёхуд бошқа нопок нарсалардан тозаланади.\n" +
                "3. Белгиланган тартибда таҳорат олинади. Аввал бошга, кейин ўнг ва чап елкага сув\n" +
                "қуйилиб, бутун бадан яхшилаб ювилади. Бу ювинишда баданда игнанинг учидай қуруқ жой\n" +
                "қолса ҳам, ғусл мукаммал олинмаган ҳисобланади.\n" +
                "Ғуслга эҳтиёжманд киши оғзи ва бурнини чайиб, сўнг чўмилса ҳам, ғусл олган ҳисобига\n" +
                "ўтади.\n" +
                "ТАЯММУМ\n" +
                "Аллоҳ таоло Нисо сурасининг 43-оятида шундай марҳамат қилади (мазмуни): «Бордию\n" +
                "бетоб ё сафарда бўлсангизлар ёки сизлардан бирортангиз ҳожатхонадан чиққан\n" +
                "бўлса ёхуд хотинларингиз билан яқинлик қилган бўлсангиз-у сув топа олмасангиз,\n" +
                "покиза ер (тупроқ, тош, қум, чанг кабилар) билан таяммум қилиб, юзларингиз ва\n" +
                "қўлларингизга суртинг. Албатта, Аллоҳ афв этувчи ва кечирувчидир».\n" +
                "Таяммум қилишда таҳоратга ёки ғуслга ҳам ният қилинади. Ҳар иккисини қўшиб ният қилиш\n" +
                "ҳам мумкин.\n" +
                "Таяммум олиш тартиби қуйидагичадир:\n" +
                "1. Енгларни тирсакларигача шимариб «Таҳорат (ёки ғусл) учун таяммум олишга ният\n" +
                "қилдим», деб кўнгилдан ўтказилади.\n" +
                "2. «Аъузу биллаҳи минаш-шайтонир рожийм. Бисмиллаҳир роҳманир роҳийм», дейилади ва\n" +
                "қўллар, бармоқлари очиқ ҳолда, тупроқ ёки тупроқ жинсидан бўлган бирор нарсага бир марта\n" +
                "урилади.\n" +
                "3. Қўлларнинг ичи (кафт) билан юзга масх тортилади. \n" +
                "Мен ҳам намоз ўқийман\n" +
                "www.ziyouz.com кутубхонаси 4\n" +
                "4. Қўлларни иккинчи бор тупроқ ёки тупроқ жинсидан бўлган нарсага уриб, чап қўлнинг\n" +
                "кафти билан ўнг қўлга тирсаги билан қўшиб, ўнг қўл кафти билан эса чап қўлга айни тарзда\n" +
                "масх этилади.\n" +
                "Таяммумни бузадиган ҳоллар:\n" +
                "1. Таҳоратга яроқли сув топиши.\n" +
                "2. Бадандаги яра ёки (бошқа) узр туфайли таяммум олган кишидан бу ҳолатларнинг кетиши.\n" +
                "3. Таҳоратни бузадиган ҳоллар таяммумни ҳам бузади.\n" +
                "АЁЛЛАРГА ХОС ҲОЛАТЛАР\n" +
                "Балоғат ёшига етган қизлар ва аёлларга хос уч ҳолат мавжуд:\n" +
                "I. Ҳайз ҳолати. Ҳайз энг ками уч кун, кўпи билан ўн кун бачадондан келадиган қондир. Бу\n" +
                "кунлар ичида қон давомли келмасдан, ора-сира тўхташи ҳам мумкин. Бироқ оралиқдаги бу\n" +
                "кунлар ҳам ҳайз кунлари ҳисобланади. Ҳайз кунлари аёлларга қуйидаги амаллар тақиқланади:\n" +
                "1) намоз ўқиш;\n" +
                "2) рўза тутиш;\n" +
                "3) Қуръон ўқиш. Бироқ ҳайз ҳолидаги Қуръон муаллимаси Қуръон ўқиш нияти билан эмас,\n" +
                "толибага ўргатиш мақсадида ҳарфма-ҳарф, сўзма-сўз Қуръон ўргатиши мумкин;\n" +
                "4) Қуръони каримга қўл теккизиш;\n" +
                "5) Каъбани тавоф этиш;\n" +
                "6) масжидга кириш;\n" +
                "7) эри билан жинсий алоқада бўлиш.\n" +
                "Аёллар ҳайз кўрган кунлари ўқиёлмаган намозларининг қазосини ўқимайдилар, бироқ\n" +
                "тутолмаган рўзаларини кейин тутадилар. Ҳомиладор аёллар ҳайз кўрмайдилар.\n" +
                "II. Нифос ҳолати. Аёлларда туққандан сўнг бачадондан қирқ кунгача келадиган қон нифос\n" +
                "қонидир. Бу қон қирқ кундан олдин ҳам тўхташи мумкин. Қон тўхтаган куни ғусл олиб\n" +
                "ибодатларда давом этилади. Қирқ кун ичида қон келиши яна бошланиб қолса, қон тўхтаган\n" +
                "олдинги кунлар ҳам нифос ҳолатидаги кунлар ҳисобланади.\n" +
                "Ҳайз кунларида тақиқланган (ҳаром саналган) амаллар нифос ҳолатида ҳам тақиқланади. Бу\n" +
                "кунларда ўқилмаган намозлар қазо қилиб ўқилмайди, тутилмаган рўзаларнинг қазоси\n" +
                "тутилади.\n" +
                "III. Истиҳоза. Хасталик туфайли аёлларда таносил узви йўли билан бачадондан эмас,\n" +
                "томирдан келадиган қон изтиҳоза қонидир. Ҳайз қонининг ўн кундан ошиғи ва уч кундан оз\n" +
                "давом этгани, кўзи ёригач нифоснинг қирқ кундан ортиқ давом этгани ва ҳомиладорлик\n" +
                "пайтида келадиган суюқликлар истиҳозадир. Бундай ҳолатлар аёллар учун узрли саналади.\n" +
                "НАМОЗ\n" +
                "Намоз Исломнинг асосий шартларидан бири ҳисобланади. Аллоҳ таоло бандаларига фарз\n" +
                "қилиб қўйган. Намоз Аллоҳ берган ҳадсиз-ҳисобсиз неъматларга бандасининг шукронаси\n" +
                "ҳамдир. Намоз ибодати туфайли кишининг Аллоҳ наздидаги даражаси юксалади. Намозхон\n" +
                "охират ҳаётига тайёргарлик кўриб боради. Турли баҳоналар билан намоз ўқимай юрган киши\n" +
                "Аллоҳнинг буйруғига қарши чиққан бўлади. Бу эса, катта мусибатдир.\n" +
                "Қуръони каримда намоз ўқиш амр этилган кўплаб оятлар бор (мазмунлари):\n" +
                "«Намозни мукаммал адо этингиз, закот берингиз ва руку қилувчилар билан бирга руку\n" +
                "қилингиз» (Бақара, 43).\n" +
                "«Намозни мукаммал адо этингиз ва закот берингиз!» (Бақара, 110).\n" +
                "Мен ҳам намоз ўқийман\n" +
                "www.ziyouz.com кутубхонаси 5\n" +
                "«Аллоҳ имонларингизни (Байтул-Мақдисга қараб ўқиган намозларингиз ажрини) зое\n" +
                "кеткизмас. Албатта, Аллоҳ одамларга меҳрибон ва раҳмлидир» (Бақара, 143).\n" +
                "«(Эй Муҳаммад), имон келтирган бандаларимга айтинг, намозни мукаммал адо этсинлар\n" +
                "ҳамда савдо-сотиқ ва ошна-оғайнигарчилик бўлмайдиган Кун (қиёмат) келмай туриб, Биз\n" +
                "уларга ризқ қилиб берган нарсалардан хуфёна ва ошкора эҳсон қилсинлар!» (Иброҳим, 31).\n" +
                "\"Қуёш оғишидан то тун қоронғусигача намозни мукаммал адо қилинг ва тонгги ўқишни\n" +
                "(бомдод намозини) ҳам (адо қилинг). Зеро, тонгги ўқиш (фаришталар) ҳозир бўладиган\n" +
                "(намоз)дир. Тунда (бир қисмида) уйғониб ўзингиз учун таҳажжуд (нафл) намозини ўқинг!\n" +
                "Шоядки, Раббингиз Сизни (Қиёмат кунида) мақтовли (шафоат қиладиган мақомда) тирилтирса»\n" +
                "(Ал-Исро, 78-79).\n" +
                "«Аҳлингизни намоз (ўқиш)га буюринг ва (ўзингиз ҳам) унга (намозга) бардошли бўлинг!»\n" +
                "(Тоҳа, 132).\n" +
                "«Дарҳақиқат, мўминлар нажот топдилар. Улар намозларга (қўрқув ва умид билан) бўйин\n" +
                "эгувчи кишилардирлар. Улар (барча) намозларни (вақтида адо этиб қазо бўлишдан) сақлагувчи\n" +
                "кишилардир» (Мўминлар, 1-2, 9).\n" +
                "«Албатта, намоз фаҳш ва ёмонликдан қайтарур! Албатта, Аллоҳнинг зикри (барча нарсадан)\n" +
                "улуғдир!» (Анкабут, 45).\n" +
                "«Бас (эй, Муҳаммад), улар (кофирлар) айтаётган сўзларга сабр қилинг ва Қуёш чиқишидан\n" +
                "ва ботишидан аввал Раббингизга ҳамд билан тасбеҳ айтинг (намоз ўқинг)! Яна кечанинг (бир\n" +
                "қисмида) ва саждалар (намозлар) ортидан тасбеҳ айтинг!» (Қоф, 39-40).\n" +
                "«(Эй Муҳаммад,) Сиз Раббингизнинг ҳукмига сабр қилинг! Зотан, Сиз Бизнинг кўз ўнгимизда\n" +
                "(ҳимоямизда)дирсиз! (Тонгдан уйқудан) турган пайтингизда, Раббингизга ҳамд билан тасбеҳ\n" +
                "айтинг! Шунингдек, кечадан (вақт ажратиб) ва юлдузлар юз ўгиргач (ботгач саҳарда) ҳам Унга\n" +
                "тасбеҳ айтинг» (Тур, 48-49).\n" +
                "«Дарҳақиқат, инсон бетоқат қилиб яратилгандир. Қачонки унга ёмонлик (камбағаллик ёки\n" +
                "мусибат) етса, у ўта бесабрлик қилувчидир. Қачонки унга яхшилик (бойлик, саломатлик) етса,\n" +
                "у ўта ман этувчи (бахил)дир. Фақат намозхонлар бундан мустаснодирлар» (Маориж, 19-23).\n" +
                "ҲАДИСЛАРДАН НАМУНАЛАР\n" +
                "* Пайғамбаримиз (с.а.в.) асҳобларидан сўрадилар: «Бирортангиз уйингизнинг олдидан оқиб\n" +
                "ўтадиган дарёда (ёки сойда) ҳар куни беш маҳал ювинсангиз, баданимда кир қолибди, деб\n" +
                "айтасизми?» Саҳобалар: «Сира ҳам кир қолмайди», дейишди. Расули Акрам: «Беш вақт намоз\n" +
                "ҳам шунга ўхшаш бўлиб, Аллоҳ таоло бу ўқилган намозлар туфайли гуноҳларни кечиради».\n" +
                "* «Аср намозини қазо қилиб қўйган одам бола-чақасию мол-дунёсидан ажраган киши\n" +
                "янглиғдир».\n" +
                "* «Қоронғу кечаларда масжидга борган кишиларга, Қиёмат куни бир нурга мазҳар\n" +
                "бўлишлари хушхабарини етказинг».\n" +
                "* «Сизлардан бирларингиз намоз ўқиган жойда таҳоратини бузмасдан ўтирган муддатгача,\n" +
                "фаришталар: «Илоҳо, бу кишининг гуноҳларини кечир ва унга раҳм айла», деб дуо этишади»\n" +
                "* «Аллоҳга қасамки, шундай нарса хаёлимдан ўтяпти: ўтин тўплашни буюрсам ва ўтинлар\n" +
                "тўпланса. Кейин намозга буюрсам, намоз учун азон айтилса, кейин бир кишини мўминларга\n" +
                "имомликка ўтишни буюрсам-да, намозга келмаганларнинг бориб уйларини ёқсам...»\n" +
                "* «Мўминлар хуфтон ва бомдод намозларидаги савобни билганларида эди, бу намозларни\n" +
                "жамоат билан ўқиш учун, эмаклаб бўлса ҳам, масжидга келишар эди».\n" +
                "* «Намоз инсон билан ширк ва куфр ўртасидаги бир пардадир. Намозни тарк этиш бу\n" +
                "пардани кўтариш бўлади».\n" +
                "* «Улар (кофирлар) билан бизнинг ўртамизни фарқлайдиган аломат намоздир. Бинобарин, \n" +
                "Мен ҳам намоз ўқийман\n" +
                "www.ziyouz.com кутубхонаси 6\n" +
                "намозни тарк қилган кимса кофирларга ўхшабди».\n" +
                "* «Банда Қиёмат кунида энг аввало намоздан ҳисоб-китоб қилинади. Агар намози дуруст\n" +
                "чиқса, қутулибди ва ютибди. Агар намози дуруст чиқмаса, ютқазибди. Фарз намозлари кам\n" +
                "чиқса, Аллоҳ азза ва жалла: «Қаранг-чи, қулимнинг нафл намозлари борми?» дейди.\n" +
                "Намозларининг ками нафл намозлар билан тўлдирилади. Қолган амаллари ҳам шу тарзда\n" +
                "ҳисоб-китоб қилинади».\n" +
                "* «Бир куни Пайғамбар, алайҳиссалом, ҳузурларида намоз ўқимай тонг отгунча ухлаган бир\n" +
                "кишининг номи тилга олинди. Расули Акрам: «Ундай бўлса, у одамнинг қулоқларига ё қулоғига\n" +
                "шайтон бавл этибди», дея марҳамат қилдилар».\n" +
                "* «Сизлардан биров ухлаб қолса, шайтон унинг орқа миясига уч тугун тугиб қўяди ва ҳар\n" +
                "тугунга: «Ҳали тунлар узун, (бемалол) ухла», дея афсун ўқийди. Агар у одам уй-ғониб Аллоҳни\n" +
                "зикр этса, тугунлардан биттаси, таҳорат олганида яна бири, намоз ўқиганида эса, қолгани ҳам\n" +
                "ечилади ва қалби қувонч ва хушнудликка тўлиб тонг оттиради. Акс ҳолда, шайтон тугиб қўйган\n" +
                "тугунларнинг таъсирида дангасалик билан тонг отгунча ухлаб қолади».\n" +
                "* Кечаси туриб ибодат қилган ва хотинини уйғотган, хотини туришни хоҳламаса, юзига сув\n" +
                "сепган одамга Аллоҳ раҳматини ёғдирсин. Кечаси туриб намоз ўқиган ва эрини уйғотган, эри\n" +
                "туришни хоҳламаса, юзига сув сепган хотинга Аллоҳ раҳматини ёғдирсин».\n" +
                "* «Намоз жаннатнинг калитидир».\n" +
                "* «Намоз диннинг устунидир».\n" +
                "* «Намоз мўминнинг меърожидир».\n" +
                "* «Эй Муҳаммад, бир кеча-кундузда умматларингга беш вақт намозни фарз қилдим. Ўзимча\n" +
                "аҳд қилдимки, ким шу беш вақт намозни ўз вақтида адо этиб юрса, у кишини жаннатга\n" +
                "киритаман. Ким ўз вақтида адо этиб юрмаса, у банда хусусида аҳдим йўқдир» (Ҳадиси қудсий).\n" +
                "АЗОН\n" +
                "Алл`оҳу акбар!\n" +
                "Алл`оҳу акбар!\n" +
                "Алл`оҳу акбар!\n" +
                "Алл`оҳу акбар!\n" +
                "Ашҳаду алл`а ил`аҳа иллалл`оҳ!\n" +
                "Ашҳаду алл`а ил`аҳа иллалл`оҳ!\n" +
                "Ашҳаду анна Муҳаммадар расул`улл`оҳ!\n" +
                "Ашҳаду анна Муҳаммадар расул`улл`оҳ!\n" +
                "Ҳаййа ъалас-сол`аҳ!\n" +
                "Ҳаййа ъалас-сол`аҳ!\n" +
                "Ҳаййа ъалал фал`аҳ!\n" +
                "Ҳаййа ъалал фал`аҳ!**\n" +
                "Алл`оҳу акбар!\n" +
                "Алл`оҳу акбар!\n" +
                "Ла ил`аҳа иллалл`оҳ.\n" +
                "\n" +
                "*\n" +
                " *Бомдод азонида бу сўзлардан кейин икки марта «Ас-сол`ату хойрум минан-на`вм! – «Намоз уйқудан афзалдир!»\n" +
                "деб қўшиб қўйилади. \n" +
                "Мен ҳам намоз ўқийман\n" +
                "www.ziyouz.com кутубхонаси 7\n" +
                "Таржимаси:\n" +
                "Аллоҳ буюкдир!\n" +
                "Аллоҳ буюкдир!\n" +
                "Аллоҳ буюкдир!\n" +
                "Аллоҳ буюкдир!\n" +
                "Аллоҳдан ўзга сиғиниладиган (илоҳ) йўқлигига иқрорман!\n" +
                "Аллоҳдан ўзга сиғиниладиган (илоҳ) йўқлигига иқрорман!\n" +
                "Муҳаммад Аллоҳнинг элчиси эканига иқрорман!\n" +
                "Муҳаммад Аллоҳнинг элчиси эканига иқрорман!\n" +
                "Намозга келинг, намозга келинг!\n" +
                "Нажотга келинг, нажотга келинг!\n" +
                "Аллоҳ буюкдир1\n" +
                "Аллоҳ буюкдир!\n" +
                "Аллоҳдан ўзга илоҳ йўқ!\n" +
                "АЗОН ДУОСИ\n" +
                "Алл`оҳумма робба ҳ`азиҳид-д`аъватит-т`аммаҳ. Вас-сол`атил қ`оимаҳ, `ати\n" +
                "Муҳаммаданил вас`ийлата вал фаз`ийлаҳ. Вабъасҳу мақ`омам маҳм`уданиллаз`ий\n" +
                "ваъадтаҳ. Варзуқна шаф`а-ъатаҳ`у йавмал қий`амаҳ. Иннака л`а тухлифул\n" +
                "м`иъ`ад!\n" +
                "Маъноси: Ушбу комил даъватнинг, ҳозир қоим бўлган намознинг Парвардигори, эй Аллоҳ!\n" +
                "Муҳаммадга (с.а.в.) васила, фазилат ва баланд олий даража ато этгин. Уни Ўзинг ваъда қилган\n" +
                "мақтовли мақомда тирилтиргин. Бизга Қиёмат кунида унинг шафоатини насиб эт. Албатта, Сен\n" +
                "ваъдага хилоф қилмассан.\n" +
                "НАМОЗ ЎҚИШ ТАРТИБИ\n" +
                "Бир кунда беш вақт (бомдод, пешин, аср, шом ва хуфтон) намоз ўқиш ҳар бир мусулмонга\n" +
                "фарздир.\n" +
                "БОМДОД НАМОЗИ\n" +
                "Бомдод намози икки ракат суннат, икки ракат фарз – жами тўрт ракатдан иборат.\n" +
                "Бомдод намозининг икки ракат суннати қуйидагича ўқилади:\n" +
                "1. «Аллоҳ ризолиги учун қибла томонга юзланиб, бугунги бомдод намозининг икки ракат\n" +
                "суннатини ўқишни ният қилдим», деб кўнгилдан ўтказилади (1–2-расмлар).\n" +
                "2. «Аллоҳу акбар», деб ифтитоҳ такбири айтилади. Бу такбирда эркаклар қўллар кафтини\n" +
                "қиблага қаратиб, бош бармоқларининг учини қулоқларининг юмшоқ жойига теккизишади (3-\n" +
                "расм). Аёллар қўлларини елка баробарида кўтарадилар (4-расм).\n" +
                "3. Қўллар боғланади. Эркаклар ўнг қўл кафтини чап қўл устига қўйишади. Ўнг қўлнинг бош\n" +
                "ва кичик бармоқлари билан чап қўл билагини ушлашади (5-расм). \n" +
                "Мен ҳам намоз ўқийман\n" +
                "www.ziyouz.com кутубхонаси 8\n" +
                "Аёллар ўнг қўлни чап қўл ус-тида тутиб, қўлларини кўкракка қўядилар (6-расм). Бу ҳол\n" +
                "«қиём» дейилади. Қиёмда (тик турган ҳолда) сажда қилинадиган жойга қараб, навбати билан,\n" +
                "қуйидагилар ўқилади.\n" +
                "САНО ДУОСИ\n" +
                "Субҳ`анакалл`оуҳумма ва биҳамдика ва таб`арокасмука ва та`аъла жаддука ва\n" +
                "л`а ил`аҳа ғойрук.\n" +
                "Маъноси: «Аллоҳим! Сенинг номинг муборакдир. Шон-шарафинг улуғдир. Сендан ўзга илоҳ\n" +
                "йўқдир».\n" +
                "ФОТИҲА СУРАСИ\n" +
                "Аъ`узу билл`аҳи минаш шайт`онир рож`ийм. Бисмилл`аҳир роҳм`анир роҳ`ийм.\n" +
                "Ал ҳамдулилл`аҳи роббил ъ`алам`ийн. Ар-роҳм`анир роҳ`ийм. М`алики\n" +
                "явмидд`ийн. Ийй`ака наъбуду ва ийй`ака настаъ`ийн. Иҳдинас сир`отол\n" +
                "мустақ`ийм. Сир`отоллаз`ийна анъамта ъалайҳим ғойрил мағз`уби ъалайҳим\n" +
                "валазз``олл`ийн.\n" +
                "Мазмуни: Аллоҳнинг даргоҳидан қувилган шайтон ёмонлигидан Аллоҳнинг паноҳига\n" +
                "қочаман. Меҳрибон ва раҳмли Аллоҳ номи билан (бошлайман). Ҳамд оламлар рабби\n" +
                "Аллоҳгаким, (У) меҳрибон, раҳмли ва ҳисоб-китоб куни (Қиёмат)нинг эгасидир. Сенгагина\n" +
                "ибодат қиламиз ва Сендангина ёрдам сўраймиз! Бизни шундай тўғри йўлга бошлагинки, (У) Сен\n" +
                "инъом (ҳидоят) этганларнинг (пайғамбарлар, сиддиқ ва шаҳидларнинг) йўлидир, ғазабга\n" +
                "учраган (Мусо қавмидан итоатсизларининг) ва адашган (Исо қавмининг «Аллоҳнинг фарзанди\n" +
                "бор» дейдиган)ларнинг эмас!\n" +
                "Фотиҳа сурасидан сўнг бир зам (қўшимча) сура ўқилади.\n" +
                "Янги ўрганувчилар қуйидаги кичик суралардан бирини зам қилишса бўлади:\n" +
                "КАВСАР СУРАСИ\n" +
                "Инн`а аътойн`акал-кавсар. Фа солли лироббика ванҳар. Инна ш`аниа’ка ҳувал\n" +
                "абтар.\n" +
                "Мазмуни: «(Эй Муҳаммад,) дарҳақиқат, Биз Сизга Кавсарни* бердик. Бас, Раббингиз учун\n" +
                "намоз ўқинг ва (туя) сўйиб қурбонлик қилинг! Албатта, ғанимингизнинг ўзи (барча\n" +
                "яхшиликлардан) маҳрумдир».\n" +
                "(Кавсар — жаннатдаги бир ажиб дарё ёки ҳовузнинг номи. Унинг суви асалдан тотли, қор\n" +
                "ва сувдан оқ. Ундан ичган киши абадий чанқоқлик кўрмайди.)\n" +
                "ИХЛОС СУРАСИ\n" +
                "Қул ҳувалл`оҳу аҳад. Алл`оҳус-сомад. Лам ял`ид. Ва лам `ювлад ва лам\n" +
                "якуллаҳ`у куфуван аҳад.\n" +
                "Мазмуни: (Эй Муҳаммад,) айтинг: «У — Аллоҳ ягонадир. Аллоҳ беҳожат, (лекин)\n" +
                "ҳожатбарордир. У туғмаган ва туғилмаган ҳам. Шунингдек, Унга тенг бирор зот йўқдир».\n" +
                "ФАЛАҚ СУРАСИ\n" +
                "Қул аъ`узу бироббил фалақ. Мин шарри м`а холақ. Ва мин шарри ғ`осиқин из`а\n" +
                "вақоб. Ва мин шаррин-нафф`ас`ати фил ъуқод. Ва мин шарри ҳ`асидин из`а ҳасад.\n" +
                "Мен ҳам намоз ўқийман\n" +
                "www.ziyouz.com кутубхонаси 9\n" +
                "Маъноси: «(Эй Муҳаммад,) айтинг: “Паноҳ тилаб илтижо қилурман тонг Парвардигорига\n" +
                "яратган нарсаси ёвузлигидан, тугунчага дам урувчи аёллар ёвузлигидан ҳамда ҳасадчининг\n" +
                "ҳасади ёвузлигидан”».\n" +
                "АН-НОС СУРАСИ\n" +
                "Қул аъ`узу бирробин-н`аси маликин-н`аси ил`аҳин-н`аси мин шаррил васв`асил\n" +
                "хонн`ас. Аллаз`ий йувасвису ф`ий суд`урин-н`аси минал жиннати ван-н`ас.\n" +
                "Маъноси: «(Эй Муҳаммад,) айтинг: “Паноҳ тилаб илтижо қилурман одамлар Парвардигорига,\n" +
                "одамлар Подшоҳига, одамлар Илоҳига яширин васвасачи (шайтон) ёвузлигиданки, (у)\n" +
                "одамларнинг дилларига васваса солур. (Ўзи) жинлар ва одамлардандир”».\n" +
                "4. Зам сура тугагач, «Аллоҳу акбар», деб руку қилинади. Эркаклар тирсаклари ва\n" +
                "тиззаларини букмасдан, бармоқларини очган ҳолда, тиззаларини маҳкам чангаллаб эгиладилар\n" +
                "(7-расм).\n" +
                "Аёллар эркакларга нисбатан озроқ эгиладилар. Тиззаларини бир оз букадилар.\n" +
                "Бармоқларини жамлаб тиззаларини тутадилар. (8-расм).\n" +
                "Рукуда уч марта «Субҳана роббийал азийм» (Эй буюк Роббим, Сен барча нуқсонлардан\n" +
                "поксан), дейилади.\n" +
                "5. Рукудан «Самиъаллоҳу лиман ҳамидаҳ» (Аллоҳ Уни ҳамд этганларни эшитгувчидир), деб\n" +
                "қад кўтарилади, бу ҳолат «қавма» дейилади.\n" +
                "Қавма ҳолида: «Роббана лакал ҳамд» (Эй Роббимиз, ҳар турли ҳамд-санолар ёлғиз\n" +
                "Сенгадир), дейилади (9–10-расмлар).\n" +
                "6. «Аллоҳу акбар» деб аввало тиззалар, кейин қўллар, сўнг пешона ва бурун ерга\n" +
                "теккизилиб, сажда қилинади. Сажда қилинаётганда оёқ панжалари қиблага қаратилади,\n" +
                "эркакларнинг тирсаклари ерга тегмайди (11-расм). Аёллар тирсакларини ерга қўядилар (12-\n" +
                "расм). Саждада уч марта: «Субҳана роббийал аъла» (Эй улуғ Роббим, Сен бутун нуқсонлардан\n" +
                "поксан), дейилади.\n" +
                "7. «Аллоҳу акбар» деб саждадан бош кўтарилади ва тиз чўккан ҳолда бир оз ўтирилади, бу\n" +
                "ҳолат «жалса» дейилади. Жалсада қўллар, бармоқлар ўз ҳолича тутилиб, сонга қўйилади.\n" +
                "Бармоқ учлари тизза билан тенг бўлиши лозим (13–14-расмлар).\n" +
                "8. Эркаклар чап оёқлари устига ўтирадилар. Ўнг оёқ панжалари қиблага қаратилади (15-\n" +
                "расм). Аёллар оёқларини ўнг тарафдан чиқариб ўтирадилар (16-расм). 8. «Аллоҳу акбар», деб\n" +
                "иккинчи марта сажда қилинади. Саждада уч марта: «Субҳана роббийал аъла», дейилади (17–\n" +
                "18-расмлар) Шу билан биринчи ракат тугайди.\n" +
                "9. «Аллоҳу акбар», деб қиёмга (тикка) турилади (19–20-расмлар).\n" +
                "10. Қиёмда «Бисмиллаҳир роҳманир роҳийм»дан бошлаб, Фотиҳа сураси, орқа-сидан бир зам\n" +
                "сура ўқилади.\n" +
                "11. «Аллоҳу акбар», деб руку қилинади. Рукуда уч марта «Субҳана роббийал азийм»,\n" +
                "дейилади (21–22-расмлар).\n" +
                "12. «Самиъаллоҳу лиман ҳамидаҳ», деб тик турилади, кетидан «Роббана лакал ҳамд»,\n" +
                "дейилади (23–24-расмлар).\n" +
                "13.«Аллоҳу акбар», деб саждага борилади. Саждада уч марта «Субҳана роббийал аъла»,\n" +
                "дейилади (25—26-расмлар).\n" +
                "14. «Аллоҳу акбар», деб саждадан бош кўтарилади ва бир оз ўтирилади (27–28-расмлар).\n" +
                "15. «Аллоҳу акбар», деб иккинчи бор сажда қилинади. Саждада уч марта: «Субҳана\n" +
                "роббийал аъла», де-йилади (29–30-расм-лар).\n" +
                "16. «Аллоҳу акбар», деб саждадан бош кўтарилиб (31–32-расмлар) қаъдада ўтирилади ва\n" +
                "қуйидагилар ўқилади: \n" +
                "Мен ҳам намоз ўқийман\n" +
                "www.ziyouz.com кутубхонаси 10\n" +
                "«АТТАҲИЙЙАТ» ДУОСИ\n" +
                "Аттаҳийй`ату лилл`аҳи вас-солав`ату ваттоййиб`ат. Ассал`аму ъалайка аййуҳаннабиййу\n" +
                "ва роҳматулл`оҳи ва барок`атуҳ. Ассал`аму ъалайн`а ва ъал`а\n" +
                "иб`адиллаҳис-с`олиҳ`ийн. Ашҳаду алл`а ил`аҳа иллалл`оҳу ва ашҳаду анна\n" +
                "Муҳаммадан ъабдуҳ`у ва рос`улуҳ.\n" +
                "Мазмуни: Мол, бадан, тил билан адо этиладиган бутун ибодатлар Аллоҳ учундир. Эй Набий!\n" +
                "Аллоҳнинг раҳмати ва баракоти Сизга бўлсин. Сизга ва солиҳ қулларга Аллоҳнинг саломи\n" +
                "бўлсин. Иқрорманки, Аллоҳдан ўзга илоҳ йўқ. Ва яна иқрорманки, Муҳаммад, алайҳиссалом,\n" +
                "Аллоҳнинг қули ва элчисидирлар.\n" +
                "САЛОВОТ\n" +
                "Алл`оҳумма солли ъал`а Муҳаммадив-ва ъал`а `али Муҳаммад. Кам`а соллайта\n" +
                "ъал`а Иброҳ`има ва ъал`а `али Иброҳ`им. Иннака ҳам`идум-маж`ид.\n" +
                "Алл`оҳумма б`арик ъал`а Муҳаммадив-ва ъал`а `али Муҳаммад. Кам`а б`арокта\n" +
                "ъал`а Иброҳ`има ва ъал`а `али Иброҳ`им. Иннака ҳам`идум-маж`ид.\n" +
                "Мазмуни: Аллоҳим, Иброҳим ва унинг оиласига раҳмат этганинг каби, Муҳаммад ва ул\n" +
                "зотнинг оиласига раҳмат айла, Сен ҳамду мақтовга лойиқ ва буюк Зотсан.\n" +
                "Аллоҳим, Иброҳим ва унинг оиласига баракотингни эҳсон этганинг каби Муҳаммад ва ул\n" +
                "зотнинг оиласи устига ҳам баракотингни эҳсон айла. Сен ҳамду мақтовга лойиқ ва буюк\n" +
                "Зотсан.\n" +
                "ДУО\n" +
                "Роббан`а `атин`а фид-дунй`а ҳасанатав-ва фил `ахироти ҳасанатав-ва қин`а\n" +
                "аз`абан-н`ар.\n" +
                "Мазмуни: «Эй Роббимиз, бизга бу дунёда ҳам, охиратда ҳам яхшиликни бергин ва бизни\n" +
                "дўзах олови азобидан сақлагин».\n" +
                "17. Аввал ўнг, кейин чап елкага қараб: «Ассаламу алайкум ва роҳматуллоҳ» деб салом\n" +
                "берилиб намоздан чиқилади (33—38-расмлар).\n" +
                "Шу билан бомдод намозининг икки ракат суннати тугайди.\n" +
                "Бомдод намозининг икки ракат фарзи ҳам худди шу тартибда ўқилади. Фарқи — аввало,\n" +
                "эркаклар ниятдан олдин (бошқа фарз намозлари олдидан ҳам) қуйидаги иқомат такбирини\n" +
                "айтишади:\n" +
                "Аллоҳу акбар, Аллоҳу акбар,\n" +
                "Аллоҳу акбар, Аллоҳу акбар.\n" +
                "Ашҳаду алла илаҳа иллаллоҳ,\n" +
                "Ашҳаду алла илаҳа иллаллоҳ.\n" +
                "Ашҳаду анна Муҳаммадар росулуллоҳ,\n" +
                "Ашҳаду анна Муҳаммадар росулуллоҳ.\n" +
                "Ҳаййа ъалас-солаҳ, ҳаййаъалас-солаҳ,\n" +
                "Ҳаййа ъалал-фалаҳ, ҳаййаъалал-фалаҳ.\n" +
                "Қод қоматис-солаҳ, қод қоматис-солаҳ\n" +
                "Аллоҳу акбар, Аллоҳу акбар,\n" +
                "Ла илаҳа иллаллоҳ.\n" +
                "Иқомат такбирининг лафзлари азонникига ўхшайди, фарқи — буниси тез айтилади. \n" +
                "Мен ҳам намоз ўқийман\n" +
                "www.ziyouz.com кутубхонаси 11\n" +
                "Бомдод намозининг фарзига қуйидагича ният қилинади: «Аллоҳ ризолиги учун бомдод\n" +
                "намозининг икки ракат фарзини ўз вақтида ўқишни ният қилдим».\n" +
                "Қолган қисми суннат билан бир хил давом этаверади.\n" +
                "ПЕШИН НАМОЗИ\n" +
                "Пешин намози тўрт ракат суннат, тўрт ракат фарз ва икки ракат суннатдан иборат.\n" +
                "Тўрт ракат суннат қуйидагича ўқилади:\n" +
                "1. Ният қилинади.\n" +
                "2. Ифтитоҳ такбири айтилади.\n" +
                "3. Сано дуоси ўқилади.\n" +
                "4. Фотиҳа сураси. Кейин бирорта зам сура.\n" +
                "5. Руку.\n" +
                "6. Сажда.\n" +
                "7. «Аллоҳу акбар» деб туриб, яна Фотиҳа сураси, зам сура.\n" +
                "8. Руку.\n" +
                "9. Сажда.\n" +
                "10. Ўтириб «Аттаҳиййат» ўқилади.\n" +
                "11. «Аллоҳу акбар» деб яна туриб, Фотиҳа сураси ва зам сура.\n" +
                "12. Руку.\n" +
                "13. Сажда.\n" +
                "14. «Аллоҳу акбар» деб тўртинчи ракатга турилади. Яна Фотиҳа сураси ва зам сура.\n" +
                "15. Руку.\n" +
                "16. Сажда.\n" +
                "17. Ўтириб, «Аттаҳиййат», «Саловот», «Роббана» дуолари ўқилади.\n" +
                "18. Салом бериб намоздан чиқилади.\n" +
                "Пешин намозининг фарзи ҳам айни шу тартибда ўқилади. Фақатгина ният қилинаётганда\n" +
                "«Аллоҳ розилиги учун пешин намозининг тўрт ракат фарзини ўқишга ният қилдим», дейилади.\n" +
                "Бундан ташқари, фарзда учинчи ва тўртинчи ракатларда «Фотиҳа»дан кейин зам сура\n" +
                "қўшилмайди.\n" +
                "Пешин намозининг икки ракат суннати бомдод намозининг суннати каби ўқилади.\n" +
                "АСР НАМОЗИ\n" +
                "Аср намози тўрт ракат фарздан иборат. Бу намоз билан пешин намози фарзининг ўқилиши\n" +
                "бир хил. Ниятда «Аср намозининг тўрт ракат фарзини...» дейилса бўлди.\n" +
                "ШОМ НАМОЗИ\n" +
                "Шом намози уч ракат фарз ва икки ракат суннатдан иборат. Уч ракатли фарзнинг ўқилиши:\n" +
                "1. Ният.\n" +
                "2. Ифтитоҳ такбири.\n" +
                "3. Сано.\n" +
                "4. Фотиҳа, зам сура.\n" +
                "5. Руку.\n" +
                "6. Сажда.\n" +
                "7. Туриб, Фотиҳа, зам сура.\n" +
                "8. Руку.\n" +
                "9. Сажда. \n" +
                "Мен ҳам намоз ўқийман\n" +
                "www.ziyouz.com кутубхонаси 12\n" +
                "10. Ўтириб, «Аттаҳиййат».\n" +
                "11. Туриб, фақат Фотиҳа.\n" +
                "12. Руку.\n" +
                "13. Сажда.\n" +
                "14. Ўтириб, «Аттаҳиййат», «Саловот», «Роббана» дуолари.\n" +
                "15. Салом.\n" +
                "Шом намозининг икки ракат суннати бомдод намозининг икки ракат суннати каби ўқилади.\n" +
                "ХУФТОН НАМОЗИ\n" +
                "Хуфтон намози тўрт ракат фарз, икки ракат суннатдан иборат.\n" +
                "Хуфтон намозининг тўрт ракат фарзи пешин намозининг фарзи каби ўқилиб, фақат ниятда\n" +
                "фарқ бўлади. Хуфтоннинг икки ракат суннати ҳам юқорида ўрганганимиз бомдод ва шом\n" +
                "намозларининг икки ракат суннатлари каби бир хил тартибда ўқилади.\n" +
                "ВИТР НАМОЗИ\n" +
                "Витр намози уч ракатли бўлиб, вожиб ибодат саналади. Фарздан қуйироқ, суннатдан улуғ\n" +
                "туради. Ўқилиши шарт. Бирор сабаб ила вақтида ўқилмай қолса, қазоси ўқилади. Витр намози\n" +
                "хуфтон намозидан кейин ўқилади.\n" +
                "Қуйидаги тартибда адо этилади:\n" +
                "1. Ният.\n" +
                "2. Ифтитоҳ такбири.\n" +
                "3. Сано.\n" +
                "4. Фотиҳа, зам сура.\n" +
                "5. Руку.\n" +
                "6. Сажда.\n" +
                "7. Иккинчи ракатга туриб, «Фотиҳа», зам сура.\n" +
                "8. Руку.\n" +
                "9. Сажда.\n" +
                "10. Ўтириб, «Аттаҳиййат» дуоси.\n" +
                "11. Учинчи ракатга туриб «Фотиҳа», зам сура.\n" +
                "12. Зам сурадан кейин ўша тик турган ҳолда «Аллоҳу акбар», деб қулоқ қоқилади.\n" +
                "13. Қўл қовуштирилиб, Қунут дуоси ўқилади.\n" +
                "ҚУНУТ ДУОСИ\n" +
                "Алл`оҳумма инн`а настаъ`инука ва настағфирук. Вануъмину бика ва натавакалу\n" +
                "ъалайка ва нусн`ий ъалайкал хойр. Куллаҳ`у нашкурука ва л`а накфурук. Ва\n" +
                "нахлаъу ва натруку май-йафжурук.\n" +
                "Алл`оҳумма ийй`ака наъбуду ва лака нусолл`ий ва насжуду ва илайка насъ`а ва\n" +
                "наҳфиду нарж`у роҳматак(а). Ва нахш`а ъаз`абака инна ъаз`абака бил куфф`ари\n" +
                "мулҳиқ.\n" +
                "Маъноси: Аллоҳим! Биз Сендан ёрдам истаймиз, гуноҳларимизни афу этишингни сўраймиз.\n" +
                "Аллоҳим! Сенга имон келтирамиз, ишларимизда Сенга суянамиз ва Сенга таваккал қиламиз. Ва\n" +
                "Сенга ҳамд айтамиз. Бутун яхшиликлар Сендандир. Бизларга берганинг шунча неъматлар\n" +
                "туфайли Сенга шукрона айтамиз ва нонкўрлик қилмаймиз. Сенга қарши нонкўрлик қилган\n" +
                "гуноҳкорлардан айриламиз, улар билан алоқани узамиз.\n" +
                "Аллоҳим! Биз ёлғиз Сенгагина қуллик қиламиз, намозни Сен учунгина ўқиймиз. Сенгагина\n" +
                "Мен ҳам намоз ўқийман\n" +
                "www.ziyouz.com кутубхонаси 13\n" +
                "сажда қиламиз. Сенгагина интиламиз. Ибодатни хушуъ-камтарлик билан адо этамиз. Раҳматинг\n" +
                "кўп бўлишини сўраймиз, азобинг-дан қўрқамиз. Ҳеч шубҳа йўқки, Сенинг азобинг\n" +
                "кофирларгадир.\n" +
                "14. Руку.\n" +
                "15 Сажда.\n" +
                "16. Ўтириб «Аттаҳиййат», «Саловот», «Роббана» дуолари.\n" +
                "18. Салом.\n" +
                "НАМОЗДАН КЕЙИНГИ ЗИКРЛАР\n" +
                "Намоз салом билан тугайди. Саломдан кейинги амаллар (тасбеҳоту дуолар) мажбурий эмас,\n" +
                "аммо ниҳоятда савоблидир.\n" +
                "Фарз намозларидан кейин қуйидаги дуони ўқиш суннатдир:\n" +
                "Алл`оҳумма антас-сал`ам ва минкас-сал`ам. Таб`арокта й`а залжал`али вал\n" +
                "икр`ом.\n" +
                "Мазмуни:\n" +
                "Эй Аллоҳим, Сен барча айб-нуқсонлардан поксан. Барча саломатлик ва раҳмат Сендандир.\n" +
                "Эй азамат ва қудрат эгаси бўлган Аллоҳим, Сенинг шонинг улуғдир.\n" +
                "Умуман, ҳар вақт намозни тугатгандан сўнг Оятал курси ўқилса, тасбеҳот қилинса, савоби\n" +
                "улуғ бўлади.\n" +
                "ОЯТАЛ КУРСИ\n" +
                "Аъ`узу билл`аҳи минаш-шайт`онир рож`ийм. Бисмилл`аҳир роҳм`анир роҳ`ийм.\n" +
                "Алл`оҳу л`а ил`аҳа илл`а ҳувал ҳаййул қойй`ум. Л`а та’хузуҳ`у синатув-ва л`а\n" +
                "на`вм. Лаҳу м`а фис-сам`ав`ати ва м`а фил арз. Манзаллаз`ий яшфаъу ъиндаҳ`у\n" +
                "илл`а би’изниҳ. Яъламу м`а байна айд`иҳим ва м`а холфаҳум ва л`а йух`ит`уна би\n" +
                "шай’им-мин ъилмиҳ`и илл`а бима ш`аъа. Васиъа курсиййуҳус-сам`ав`ати вал арз.\n" +
                "Ва л`а йаъ`удуҳ`у ҳифзуҳум`а ва ҳувал ъаллиййул ъаз`ийм.\n" +
                "Мазмуни:\n" +
                "Аллоҳ — Ундан ўзга илоҳ йўқдир. (У ҳамиша) тирик ва абадий турувчидир. Уни на\n" +
                "мудроқ тутар ва на уйқу. Осмонлар ва Ердаги (барча) нарсалар Уникидир. Унинг\n" +
                "ҳузурида ҳеч ким (ҳеч кимни) Унинг рухсатисиз шафоат қилмас. (У) улар\n" +
                "(одамлар)дан олдинги (бўлган) ва кейинги (бўладиган) нарсани билур. (Одамлар)\n" +
                "Унинг илмидан фақат (У) истаганча ўзлаштирурлар. Унинг Курсийси осмонлар ва\n" +
                "Ердан (ҳам) кенгдир. У иккисининг ҳифзи (тутиб туриши) Уни толиқтирмас. У олий\n" +
                "ва буюкдир.\n" +
                "ТАСБЕҲ\n" +
                "Субҳаналлоҳ\n" +
                "(33 марта)\n" +
                "Алҳамдулиллаҳ\n" +
                "(33 марта)\n" +
                "Аллоҳу акбар\n" +
                "(33 марта) \n" +
                "Мен ҳам намоз ўқийман\n" +
                "www.ziyouz.com кутубхонаси 14\n" +
                "КАЛИМАИ ТАВҲИД\n" +
                "Л`а ил`аҳа иллалл`оҳу ваҳдаҳ`у л`а шар`ика лаҳ, лаҳул мулку ва лаҳул ҳамд. Ва\n" +
                "ҳува ъал`а кулли шай’ин қод`ир.\n" +
                "Мазмуни:\n" +
                "Аллоҳдан ўзга илоҳ йўқ. У ягонадир, шериги йўқ, бутун мулк Уникидир. Ҳамд-мақтов Унга\n" +
                "хосдир. Ва У ҳар нарсага қодир зотдир.\n" +
                "ЖАНОЗА НАМОЗИ\n" +
                "Ният: «Аллоҳ ризолиги учун жаноза намозини ўқишни ният қилдим. Ушбу имомга иқтидо\n" +
                "қилдим».\n" +
                "Имом билан бирга такбир туширилгач, Сано дуоси ўқилади: «Субҳ`анакалл`оҳумма ва\n" +
                "биҳамдик. Ва таб`арокасмук ва та`аъла жаддук ва жалла сан`аук ва л`а ил`аҳа\n" +
                "ғойрук».\n" +
                "Сўнг имом овоз чиқариб, «Аллоҳу акбар» деб такбир айтади. Бу такбирда қўллар\n" +
                "кўтарилмайди. Қовуштирилган ҳолида «Саловот» дуоси ўқилади. Яна қўлни кўтармасдан\n" +
                "«Аллоҳу акбар» деб такбир айтилади ва жаноза дуоси ўқилади.\n" +
                "Дуодан сўнг яна қўллар қовуштирилган ҳолда «Аллоҳу акбар», дейилиб, ўнг ва чап\n" +
                "томонларга салом берилади.\n" +
                "ЖАНОЗА ДУОЛАРИ\n" +
                "Ҳар бир жанозада дастлаб қуйидаги дуо ўқилади:\n" +
                "Алл`оҳуммағфир лиҳаййин`а ва маййитин`а ва ш`аҳидин`а ва ғ`о’ибин`а ва\n" +
                "соғ`ийрин`а ва каб`ийрин`а ва закарин`а ва унс`ан`а. Алл`оҳумма ман аҳйайтаҳ`у\n" +
                "минн`а фааҳйиҳ`и ъалал Исл`ам. Ва ман таваффайту минн`а фатаваффаҳ`у ъалал\n" +
                "ийм`ан.\n" +
                "Маъноси:\n" +
                "«Эй Раббим! Тиригимизни ва ўлигимизни, бу ерда бўлганларни ва бўлмаганларни,\n" +
                "кичикларимизни ва катталаримизни, эркак ва аёлларимизни кечиргин. Аллоҳим, Биздан\n" +
                "туғилажак янги наслларни Ислом динида дунёга келтир. Ажали етиб ҳаётдан кўз\n" +
                "юмадиганларнинг жонларини имонли ҳолларида олгин».\n" +
                "Жанозаси ўқилаётган маййит балоғатга етмаган ўғил бола бўлса, мана бу дуо ўқилади:\n" +
                "Алл`оҳуммажъалҳ`у лан`а фаротав-важъал ҳ`у лан`а ажров-ва зухровважъалҳ`у\n" +
                "лан`а ш`афиъам-мушаффаъан.\n" +
                "Мазмуни:\n" +
                "«Аллоҳим! Бу болани жаннатда бизни қаршилаб олувчи ва охират армуғони қил... Аллоҳим!\n" +
                "Бу болани биз учун шафоатчи қил ва шафоатини мақбул айла».\n" +
                "Жаноза балоғатга етмаган қиз бола учун ўқилаётган бўлса, қуйидаги дуо ўқилади:\n" +
                "Алл`оҳуммажъалҳ`а лан`а фаротав-важ-ъалҳ`а лан`а ажров-ва зухровважъалҳ`а\n" +
                "лан`а ш`афиъатам-мушаффаъаҳ.\n" +
                "Маъноси: Аллоҳим! Шу қиз болани жаннатда бизни қаршилаб олувчи ва охират армуғони\n" +
                "қил... Аллоҳим! Бу қизни биз учун шафоатчи қил ва шафоатини мақбул айла.\n" +
                "Бу дуоларни билмаганлар «Алл`оҳуммағфир лий ва лаҳ`у ва лил-муъмин`ийна вал\n" +
                "муъмин`ат».\n" +
                "Яъни, Аллоҳим, мени ва уни, эркак ва аёл барча имон келтирганларни мағфират айла», дея\n" +
                "дуо қилсалар ёки «Роббана...» дуосини ўқисалар ҳам бўлади.\n" +
                "Жаноза намозининг бошланишига улгурмаган киши жамоатга тезда қўшилиб ифтитоҳ\n" +
                "Мен ҳам намоз ўқийман\n" +
                "www.ziyouz.com кутубхонаси 15\n" +
                "такбирини айтади ва имомга иқтидо қилади. Имом салом берганидан кейин, лекин ҳали тобут\n" +
                "кўтарилмасдан аввал қолган такбирларни ўзи айтади.\n" +
                "Тушган, ўлик туғилган болага жаноза ўқилмайди. Бир исм қўйилиб ювилади ва матога ўраб,\n" +
                "кўмилади. Тирик туғилиб ўлган бола ювилиб, жанозаси ўқилади.\n" +
                "ҲАЙИТ НАМОЗИ\n" +
                "1. «Аллоҳ ризолиги учун Рамазон (ёки Қурбон) ҳайити намозини ўқишни ният қилдим.\n" +
                "Юзимни қибла тарафга қаратдим. Ушбу имомга иқтидо қилдим», деб ният қилинади.\n" +
                "2. Имом «Аллоҳу акбар», дея такбир айтгач жамоат ҳам қўлларини кўтариб, ичида ифтитоҳ\n" +
                "такбирини айтади.\n" +
                "3. Ҳар ким ичида Сано дуосини ўқийди. Сўнгра имом кетма-кет қўлларини қулоқларига\n" +
                "кўтариб, уч марта такбир айтади. Жамоат ҳам унга эргашади. Биринчи ва иккинчи такбирда\n" +
                "қўллар ён томонга туширилади. Учинчи такбирдан сўнг қўллар боғланиб, қиём ҳолида\n" +
                "турилади.\n" +
                "4. Шундан кейин имом ичида «Аъузу»ни ва «Бисмиллаҳ»ни айтиб, овоз чиқариб Фотиҳа\n" +
                "сурасини ва зам сурани ўқийди.\n" +
                " 5. Руку ва саждадан сўнг иккинчи ракатга турилади. Имом Фотиҳа сураси билан бир кичик\n" +
                "сура ўқигач, рукуга бормай туриб, худди биринчи ракатдаги каби уч марта такбир айтади.\n" +
                "Тўртинчи такбирдан кейин қўллар боғланмасдан рукуга кетилади ва саждалар адо этилади.\n" +
                "Саждадан сўнгра «Аттаҳиййат» ва «Саловот» ўқиб, салом берилиб, намоз тугатилади.\n" +
                "ЖУМА НАМОЗИ\n" +
                "Жума намози икки ракат фарз бўлиб, ундан олдин ва кейин тўрт ракат суннат ўқилади. Илк\n" +
                "ва охирги суннатлар пешин намозининг суннатлари каби ўқилади. Имомга иқтидо қилиб\n" +
                "ўқиладиган икки ракат фарз эса, бомдод намозининг фарзи каби ўқилади.\n" +
                "Жума намозида икки ракат фарз ўқилмасдан олдин имом минбарда хутба қилади.\n" +
                "Жума намози ҳур, озод, муқим, саломатлиги жойида, оёқлари соғ кишига фарздир.\n" +
                "Жума намозининг шартлари:\n" +
                "1) пешин намози ўқиладиган вақтда ўқиш;\n" +
                "2) намоздан олдин хутба ўқиш;\n" +
                "3) жума ўқиладиган жой ҳаммага очиқ бўлиши;\n" +
                "4) имомдан ташқари камида уч кишидан иборат жамоат бўлиши;\n" +
                "5) имом жума намозини ўқиши учун расман рухсатли бўлиши;\n" +
                "6) жума ўқиладиган жой шаҳар ёхуд шаҳар ҳукмида бўлиши керак.\n" +
                "НАМОЗНИ БУЗАДИГАН ҲОЛЛАР\n" +
                "– намоз пайтида гаплашиш;\n" +
                "– бирор нарса ейиш ёки ичиш;\n" +
                "– ўзи эшитадиган даражада кулиш (ёнидаги эшитадиган қилиб кулса, таҳорат ҳам\n" +
                "бузилади);\n" +
                "– бировга салом бериш ёки саломга алик олиш;\n" +
                "– қибладан бошқа томонга бурилиш;\n" +
                "– дунёвий бирор ташвиш туфайли «уф» тортиш, «оҳ-воҳ» дейиш ва йиғлаш (гуноҳларига\n" +
                "тавба қилиб, Аллоҳдан кечиришликни сўраб йиғласа бўлади);\n" +
                "– атайлаб йўталиш;\n" +
                "— бир рукнда уч мартадан ортиқ бегона ҳаракат қилиш (масалан: кийимни тўғрилаш, \n" +
                "Мен ҳам намоз ўқийман\n" +
                "www.ziyouz.com кутубхонаси 16\n" +
                "қашиниш ва ҳоказо);\n" +
                "– намозда ўқиладиган оятларни маъноси бузиладиган даражада янглиш ўқиш;\n" +
                "– намоз ўқилаётган пайтда таҳоратнинг синиши.\n" +
                "— сажда ҳолида иккала оёқни ердан кўтариш.\n" +
                "НАМОЗНИНГ САВОБИНИ\n" +
                "КАМАЙТИРАДИГАН ҲАРАКАТЛАР\n" +
                "– Бармоқларни қисирлатиш, уст-бошни ўйнаш;\n" +
                "– кўзни юмиш, у ёқ-бу ёққа аланглаш;\n" +
                "– рукуда «Субҳана роббийал ъазийм»ни уч мартадан кам айтиш ёки умуман айтмаслик;\n" +
                "– саждада «Субҳана роббийал аъла»ни уч мартадан кам айтиш ёки ҳеч айтмаслик;\n" +
                "– қибла, ўнг томон ва саждагоҳда жонли нарсалар суратининг бўлиши;\n" +
                "– йўл устида эгаси рози бўлмаган бир жойда намоз ўқиш;\n" +
                "— сажда ҳолида бир оёғини ердан кўтариш.\n" +
                "НАМОЗНИНГ ВОЖИБЛАРИ\n" +
                "1. Қиёмда Фотиҳа сурасини ўқиш.\n" +
                "2. Фарз намозларининг аввалги икки ракати, витр ва нафл намозларининг ҳар ракатида\n" +
                "Фотиҳадан кейин зам сура ўқиш.\n" +
                "3. Уч ва тўрт ракатли намозларда иккинчи ракатдан ке-йин ўтириш.\n" +
                "4. Имомнинг бомдод, ҳайит, жума намозларида, шом, хуфтон намозларининг аввалги икки\n" +
                "ракатида Фотиҳа ва зам сурани овоз чиқариб ўқиши. Пешин ва аср намозларида эса, имомнинг\n" +
                "ҳам, якка ўзи ўқиётган намозхоннинг ҳам овоз чиқармай ўқиши.\n" +
                "5. Витр намозида Қунут дуосини ўқиш.\n" +
                "НАМОЗНИНГ СУННАТЛАРИ\n" +
                "1. «Аллоҳу акбар» деб намоз бошлагандан кейин Санони ўқиш.\n" +
                "2. Санодан кейин ичида «Аъузубиллаҳ» ва «Бисмиллаҳ»ни айтиш.\n" +
                "3. Фотиҳани ўқигандан кейин махфий тарзда «омин» дейиш.\n" +
                "4. Имом рукудан кейин «Самиъаллоҳу лиман ҳамидаҳ» деб турганида «Роббана лакал ҳамд»\n" +
                "дейиш. Намозни ёлғиз ўқиганлар учун эса, иккаласини ҳам айтиш.\n" +
                "5. Фарзларнинг биридан иккинчисига ўтаётганда «Аллоҳу акбар» дейиш.\n" +
                "6. Намозда бошни жуда эгиб ҳам, жуда тикка ҳам тутмаслик, ўртамиёна ушлаш.\n" +
                "7. Рукуда қўл бармоқлари орасини очиб икки тиззани маҳкам чангаллаш, камида уч марта\n" +
                "«Субҳана роббийал ъазийм» дейиш. Аёллар бармоқларини тизза устида, жипс ҳолда тутишади,\n" +
                "тиззаларини бир оз букишади.\n" +
                "8. Саждада пешонани қўллар орасига олиш, қўл бармоқларини жипс тутиш. Бунда бош\n" +
                "бармоқ қош тўғрисига қўйилади.\n" +
                "9. Саждада эркаклар оёқлари, қўллари, бурни ва пешонаси ерга тегиб туриши, боши икки\n" +
                "қўли орасида бўлиши, билакларини ерга ҳам, қобирғасига ҳам теккизмасдан тутиши ҳамда\n" +
                "оёқларининг бармоқларини қиблага қаратиб туриши. Аёллар эса, қўлларини ёнларига жипс\n" +
                "этган ҳолда ерга теккизиб, сажда қиладилар.\n" +
                "10. Эркаклар ўтирганда чап оёғи устига ўтириб, ўнг оёғи қадамини тик тутиб, бармоқларини\n" +
                "қиблага қаратиб ўтириши, аёлларнинг эса икки оёқларини ўнг томонга қаратиб, чап қуймичига\n" +
                "ўтириши. \n" +
                "Мен ҳам намоз ўқийман\n" +
                "www.ziyouz.com кутубхонаси 17\n" +
                "11. Тик турганда икки оёқ орасини тўрт бармоқ кенглигида очиқ ушлаш. Аёллар оёқларини\n" +
                "жипс тутишади.\n" +
                "12. «Ташаҳҳуд» (Аттаҳиёт), «Саловот», «Роббана» дуоларини ўқиш.\n" +
                "13. Аввал ўнг, кейин чап томонга салом бериш.\n" +
                "НАМОЗНИНГ МУСТАҲАБЛАРИ\n" +
                "1. Кўча-кўйда ёки далаларда, умуман очиқ жойларда намоз ўқимоқчи бўлса, олдидан бирор\n" +
                "ҳайвон ёки инсон ўтмаслиги учун бир тўсиқ — сутра қўйиш.\n" +
                "2. Намоз бошлаётганда «Аллоҳу акбар» деб бош бармоқларини қулоқ юмшоғига, кафтини\n" +
                "эса қиблага қаратиш. Аёллар эса, қўлларини кўкрак баробарида кўтариб, сийналари устига\n" +
                "қўядилар.\n" +
                "3. Муаззин такбирда «Ҳаййа ъалас-солаҳ» дейиши билан ўрнидан туриш, «Қод-қоматиссолаҳ»\n" +
                "деганида, «Аллоҳу акбар» деб намозни бошлаш.\n" +
                "4. Қиёмда сажда қиладиган ерга, рукуда оёқ устларига, саждада бурнининг юмшоғига,\n" +
                "қаъдада кўкраклари ўртасига, саломда эса елкасига қараш.\n" +
                "5. Саждага боришда аввал тиззаларини, кейин қўлларини ерга қўйиш.\n" +
                "6. Намозда эсноқ келса, оғизни очмаслик. Агар бунга кучи етмаса, чап қўлининг орқаси ёки\n" +
                "ўнг қўл кафти билан оғизни ёпиш.\n" +
                "МУСОФИР НАМОЗИ\n" +
                "Бизнинг динимиз қулайлик, инсонларга марҳамат динидир. Чунончи, у мусофирларга ҳам\n" +
                "анча енгилликларни муҳайё қилиб қўйган. Яшаб турган жойидан ўртача юришда камида 18\n" +
                "соатлик (90 чақирим) масофага ўн беш кундан оз муддатни ният қилиб йўлга чиққан киши\n" +
                "қишлоғи ёки шаҳрининг охирги уйлари кўринмай қолган дақиқадан бошлаб мусофир\n" +
                "ҳисобланади. Ўн беш кунга ё бундан кўпга ният қилиб чиқилса, йўлдагина мусофир саналади,\n" +
                "бораётган манзилининг дастлабки уйлари кўрингандан бошлаб эса, муқим ҳукмига ўтади ва\n" +
                "намозларини тўлиқ ўқийди.\n" +
                "Мусофир одам тўрт ракатлик фарз намозларини икки ракатга қисқартириб (бомдод\n" +
                "намозининг фарзи каби) ўқийди. Бироқ шом намозининг уч ракат фарзи ва уч ракатлик витр\n" +
                "намозларини тўлиқ адо этади. Агар мусофир киши муқим кишига эргашиб намоз ўқиса, тўрт\n" +
                "ракатлик фарзларни ҳам тўлиқ ўқийди. Муқим киши мусофир кишига иқтидо қилиб намоз\n" +
                "ўқиётган бўлса, унда имом икки ракатдан сўнг салом бергач, эргашувчи салом бермайди, ичида\n" +
                "«Аллоҳу акбар» деб қиёмга туради-да, қолган икки ракатни мустақил ўзи ўқиб тугатади.\n" +
                "ИМОМГА ЭРГАШИШ\n" +
                "Суюкли пайғамбаримиз Муҳаммад алайҳиссалом бир ҳадиси шарифларида жамоат билан\n" +
                "ўқилган намознинг савоби ёлғиз ўқилган намознинг савобидан йигирма етти марта ортиқ\n" +
                "эканини марҳамат қилганлар.\n" +
                "Беш вақт намознинг фақат фарзлари, жума намозининг икки ракат фарзи, ҳайит намозлари,\n" +
                "Рамазон ойида таровеҳ ва витр намозлари имомга иқтидо қилиб ўқилади. Имомга эргашиб\n" +
                "жамоат билан намоз ўқийдиган киши «муқтадий» дейилади.\n" +
                "Муқтадий қуйидагиларга амал қилиши керак:\n" +
                "1. Аввало, ҳам ўқилаётган намозга, ҳам имомга эргашишга ният қилмоғи лозим. Масалан,\n" +
                "«Аллоҳ розилиги учун бугунги бомдод намозининг икки ракат фарзини ушбу имомга эргашиб,\n" +
                "ўқишни ният қилдим.\n" +
                "2. Имом ифтитоҳ такбирини айтгач, муқтадий ҳам ундан кейин дарҳол такбир айтиб, \n" +
                "Мен ҳам намоз ўқийман\n" +
                "www.ziyouz.com кутубхонаси 18\n" +
                "қўлларини боғлайди ва ичида фақат Сано (Субҳанака) дуосини ўқийди. Имомга эргашиб намоз\n" +
                "ўқиётган киши тикка турганида (қиёмда) Фотиҳа ва зам сураларни ўқимайди. Овоз чиқариб\n" +
                "ўқиладиган бомдод, шом, хуфтон намозларининг фарзида, жума намозининг фарзида, ҳайит\n" +
                "намозларида, рамазон ойида таровеҳ ва витр намозларида имом Фотиҳа сурасини тугатгач,\n" +
                "муқтадий ичида «Амийн» дейди.\n" +
                "3. Рукуда уч марта «Субҳана роббийал ъазийм», дейди. Имом «Самиъаллоҳу лиман\n" +
                "ҳамидаҳ», деб тик тургач, «Роббана лакал ҳамд», дейди. Саждаларда ҳам муқтадий уч\n" +
                "мартадан «Субҳана роббийал аъла»ни айтади.\n" +
                "4. Ўтиришларда муқтадий ичида «Аттаҳиййат», «Саловот», «Роббана» дуоларини ўқийди ва\n" +
                "имом билан бирга салом беради.\n" +
                "Имомга иқтидо қилиб жамоат билан бирга намоз ўқиётган киши барча амалларда имомдан\n" +
                "кейин ҳаракат қилади, ундан олдинга ўтиб кетмайди.\n" +
                "Жамоатга кечикиб келиб қўшилган киши такбир айтиб, имомга эргашади. Охирги ўтиришда\n" +
                "«Аттаҳиййат»ни ўқиб, имомнинг салом беришини кутади. Имом икки томонга салом берарбермас,\n" +
                "салом бермай «Аллоҳу акбар» деб тикка туради ва кечиккан ракатларни ўзи ўқиб\n" +
                "намозни тугатади.\n" +
                "Бирор ракатнинг рукусига улгурган, яъни имом ҳануз рукудан бош кўтармасидан илгарироқ\n" +
                "ният қилиб, жамоатга қўшилган киши ўша ракатни ўқиган ҳисобланади.\n" +
                "ҚАЗО НАМОЗЛАРИ\n" +
                "Мўмин-мусулмонлар намозларини доимо вақтида ўқишга ҳаракат қилишлари лозим. Лекин\n" +
                "бирор сабаб билан ўқилмай қолса, у намознинг қазоси ўқилиши керак. Фарз намозлар ва витр\n" +
                "намози қолдирилса, қазо қилиб ўқилади.\n" +
                "Қазо намози ва умуман ҳар қандай намоз ўқиш макруҳ ҳисобланган уч вақт борки, булар кун\n" +
                "чиқиш, кун ботиш ва кун тиккага келган (қиём) пайтларидир.\n" +
                "Намозни ўтказиб юбориш катта гуноҳдир. Бинобарин, қазо намози ўқилгач, Аллоҳ таолодан\n" +
                "мағфират тилаш ва ҳар намозни ўз вақтида, қазо қилмай ўқишни насиб этишини сўраб дуо\n" +
                "қилиш керак.\n" +
                "САЖДАИ САҲВ\n" +
                "Намознинг фарз ё вожибларидан бири вақтидан кечиктириб бажарилса ёки вожиб амали\n" +
                "унутилиб, бажарилмаса, қаъдаи охирада (охирги ўтиришда) фақат «Аттаҳий- йат» ўқилиб, ўнг\n" +
                "томонга салом беради ва «Аллоҳу акбар», деб икки марта сажда қилади ва яна ўтирган ҳолда\n" +
                "«Аттаҳиййат», «Саловот», «Роббана» дуоларини ўқиб, ўнг ва чап томонга салом бериб\n" +
                "намозни тугаллайди. Бу икки сажда «саждаи саҳв» (хатони ўнглайдиган сажда) дейилади.\n" +
                "ДУО\n" +
                "Аллоҳ таоло Бақара сурасининг 186-оятида шундай марҳамат қилади: «Бандаларим\n" +
                "Сиздан (эй Муҳаммад) Мен ҳақимда сўрасалар, Мен уларга яқинман. Менга дуо\n" +
                "қилган пайтларида дуогўйларнинг дуосини ижобат қиламан. Бас, ҳақ йўлига\n" +
                "юришлари учун (улар ҳам) менинг (даъватимга) жавоб қилсинлар ва менга имон\n" +
                "келтирсинлар».\n" +
                "Пайғамбаримиз Муҳаммад алайҳиссалом дуо ҳам ибодат эканини марҳамат қиладилар.\n" +
                "Бинобарин, намоз сўнгида Пайғамбаримиз томонларидан тавсия қилинган ушбу дуоларни ўқиш\n" +
                "мақсадга мувофиқдир:\n" +
                "* Эй Роббимиз, бизга бу дунёда ҳам, охиратда ҳам яхшиликни бергин ва бизни дўзах олови\n" +
                "Мен ҳам намоз ўқийман\n" +
                "www.ziyouz.com кутубхонаси 19\n" +
                "азобидан сақлагин.\n" +
                "* Илоҳо, мен Сендан ҳидоят, тақво, иффат ва ғино (бировга муҳтож бўлмаслик ҳолатини)\n" +
                "сўрайман.\n" +
                "* Аллоҳим, мени афу эт, ёрлақа, тўғри йўлдан бошла, менга офият бер, ҳалолдан\n" +
                "ризқлантир.\n" +
                "* Қалбларимизни ризолигингга уйғун бўлган амал ва ибодатга томон йўналтир.\n" +
                "* Парвардигоро, дош бериб бўлмайдиган балодан, инсонни ўлимга қадар судраб борувчи\n" +
                "(мол, жон, оилага тааллуқли) мушкулотга дуч келишдан, (мол, жон, оилага тааллуқли) балоқазодан\n" +
                "ва душманларни қувонтирадиган бир мусибатга рўбарў бўлишдан Сенинг паноҳингга\n" +
                "сиғинаман.\n" +
                "* Илоҳо, ожиз қолишдан, дангасаликдан, қўрқоқликдан, алжиратиб қўйувчи қариликдан,\n" +
                "хасталикдан, қабр азобидан, ҳаёт ва мамот фитнасидан Сенинг паноҳингга сиғинаман.\n" +
                "* Ё Роббим! Мен ўз нафсимга кўп зулм қилдим. Сендан ўзга гуноҳларни кечиргувчи йўқ.\n" +
                "Мени ёрлақа ва афу эт. Ғофур, Роҳийм ёлғиз Сенсан.\n" +
                "* Илоҳо, фойдаси тегмайдиган илмдан, қўрқмайдиган қалбдан, тўймайдиган нафсдан, қабул\n" +
                "бўлмайдиган дуолардан паноҳ бер.\n" +
                "* Аллоҳим! Дўзах ўтида ёнишимга сабаб бўладиган фитнадан, дўзах оловидан, бойлик ва\n" +
                "фақирликнинг ёмонлигидан мени асрагин.\n" +
                "* Аллоҳим! Ёмон феъл-атвор ва амаллардан, нафсоний орзулардан асрагин.\n" +
                "* Аллоҳим! Қулоғимнинг, кўзимнинг, тилимнинг, қалбимнинг, фаржимнинг ёмонлигидан\n" +
                "асрагин.\n" +
                "ҚУРЪОНИ КАРИМДАН\n" +
                "БАЪЗИ ДУОЛАР\n" +
                "Одам алайҳиссалом ва момо Ҳавво жаннатдан чиқарилганларида ушбу дуони\n" +
                "ўқиганлар:\n" +
                "«Эй Раббимиз! Биз ўзимизга (ўзимиз) зулм қилдик. Агар бизни кечирмасанг, биз, албатта,\n" +
                "зиён кўрувчилардан бўлиб қолурмиз» (Аъроф, 23).\n" +
                "Нуҳ алайҳиссаломнинг дуолари:\n" +
                "«Раббим! Мен Сендан ўзим (яхши) билмаган нарсани сўрашимдан паноҳ тилайман. Агар\n" +
                "мени кечирмасанг ва раҳм қилмасанг, албатта, зиён кўрувчилардан бўлурман» (Ҳуд, 47).\n" +
                "Лут алайҳиссаломнинг дуолари:\n" +
                "«Эй Раббим, бу бузғунчилар қавми устидан Ўзинг мени ғолиб қил!» (Анкабут, 30).\n" +
                "Иброҳим алайҳиссаломнинг дуолари:\n" +
                "«Парвардигорим, мени ва зурриётларимни намозни тўкис адо этгувчи қилгил. Парвардигоро,\n" +
                "дуоимни қабул айла. Парвардигоро, ҳисоб-китоб (қиёмат) куни мени, ота-онамни ва барча\n" +
                "мўминларни мағфират қилгил» (Иброҳим, 40-41).\n" +
                "Юсуф алайҳиссаломнинг дуолари:\n" +
                "«Эй осмонлар ва ерни ижод этган Зот! Дунё-ю охиратда Ўзинг эгамдирсан. (Ажалим\n" +
                "етганида) мусулмон ҳолимда жонимни олгин ва мени солиҳлар (қатори)га қўшгин» (Юсуф,\n" +
                "101).\n" +
                "Шуайб алайҳиссаломнинг дуолари:\n" +
                "«Аллоҳгагина таваккул қилдик. Эй Раббимиз! Биз билан қавмимиз ўртасида ҳақиқий\n" +
                "Мен ҳам намоз ўқийман\n" +
                "www.ziyouz.com кутубхонаси 20\n" +
                "ажримлик ато эт! Сен ажрим қилувчиларнинг яхшисидирсан» (Аъроф, 89).\n" +
                "Мусо алайҳиссаломнинг дуолари:\n" +
                "«Эй Раббим, бағримни кенг қилгин, ишимни осон қилгин, тилим (дан дудуқлик)ни ечиб\n" +
                "юборгин, (токи) улар (қавмим) гапимни англасинлар» (Тоҳа, 25).\n" +
                "«Парвардигорим, Ўзинг мен учун нима яхшилик, (яъни, ризқ) туширсанг, ўшанга\n" +
                "муҳтождирман» (Қасос, 21).\n" +
                "Юнус алайҳиссаломнинг дуолари:\n" +
                "«Сендан ўзга илоҳ йўқдир. Сен (барча) нуқсонлардан покдирсан. Дарҳақиқат, мен (ўзимга)\n" +
                "зулм қилувчилардан бўлдим» (Анбиё, 87).\n" +
                "Закариё алайҳиссаломнинг дуолари:\n" +
                "«Эй Раббим, мени ёлғиз ташлаб қўйма (меросхўр фарзанд ато эт), Сен (Ўзинг) ворисларнинг\n" +
                "яхшироғидирсан» (Анбиё, 89).\n" +
                "«Раббим, менга ҳам ўз ҳузурингдан пок зурриёт ато эт! Дарҳақиқат, Сен дуони\n" +
                "эшитувчидирсан» (Ол-и Имрон, 38).\n" +
                "Аҳли илмнинг дуоси:\n" +
                "«Парвардигоро, бизни ҳидоят қилганингдан кейин, энди дилларимизни ҳақ йўлдан оғдирма\n" +
                "ва бизга Ўз ҳузурингдан раҳмат ато эт!» Омийн.\n" +
                "Қуръони каримда Муҳаммад алайҳиссаломга\n" +
                "ўргатилган баъзи дуолар:\n" +
                "«Эй Раббим, мени (қабрга) содиқлик билан (гуноҳларим кечирилган ҳолимда) киритгин ва\n" +
                "(тирилтирганингда ҳам) содиқлик (розилигинг) билан чиқаргин ҳамда мен учун ўз\n" +
                "даргоҳингдан бир мадад берувчи ҳужжат ато қилгин» (Ал-Исро, 80).\n" +
                "«Эй Раббим, менга (кофирларга) ваъда қилинаётган нарса (азоб)ни кўрсатсанг-чи?! Эй\n" +
                "Раббим! (Ўшанда) мени у золимлар қавми ичида қилмагин! Эй Раббим! Мен Сендан\n" +
                "шайтонларнинг васвасаларидан паноҳ беришингни сўрайман. Яна мен Сендан, эй Раббим, улар\n" +
                "менинг ҳузуримга келишларидан паноҳ сўрайман. Эй Раббим! (Гуноҳларимизни) мағфират эт ва\n" +
                "(ҳолимизга) раҳм айла! Сен (ўзинг) раҳм қилувчиларнинг яхшисидирсан!» (Мўминун, 93, 94,\n" +
                "97, 98, 118).\n" +
                "«Парвардигорим, илмимни янада зиёда қилгин» (Тоҳа, 114).\n" +
                "«Парвардигоро, бизлар Сенга имон келтирганмиз, бас, гуноҳларимизни мағфират айла ва\n" +
                "бизни жаҳаннам азобидан асра!» (Ол-и Имрон,16).\n" +
                "НАСИҲАТ\n" +
                "Ҳаққа даъват – қутлуғ даъват,\n" +
                "Ҳой-ҳавасни унут, болам.\n" +
                "Ўлим ҳақдир, дунё фоний,\n" +
                "Азонга қулоқ тут, болам.\n" +
                "Кунда беш бор чақиради,\n" +
                "Кирларингни аритади.\n" +
                "Расул Акрамга элтади,\n" +
                "Намозингни ўқи, болам. \n" +
                "Мен ҳам намоз ўқийман\n" +
                "www.ziyouz.com кутубхонаси 21\n" +
                "Бошқа чора бўлмас асло,\n" +
                "Келмаганлар тортгай алам.\n" +
                "Шайтон сени енгмай туриб\n" +
                "Сен шайтонни енггин, болам.\n" +
                "Дилим оғрир, оёғингни,\n" +
                "Тикан тилса бу дунёда.\n" +
                "Истамайман ёнмоғингни\n" +
                "Қиёматда, жоним, болам.\n" +
                "ОЛТИ ДИНИЙ КАЛИМА\n" +
                "1. Калимаи тоййиба\n" +
                "Л`а ил`аҳа иллалл`оҳу Муҳаммадур рос`улулл`оҳ.\n" +
                "Тўғри сўз: Аллоҳдан ўзга сиғиниладиган (илоҳ) йўқдир! Муҳаммад Аллоҳнинг расулидир!\n" +
                "2. Калимаи шаҳодат\n" +
                "Ашҳаду алл`а ил`аҳа иллалл`оҳу ва ашҳаду анна Муҳаммадан ъабдуҳ`у ва рос`улуҳ.\n" +
                "Иқрорлик сўзи: Аллоҳдан ўзга сиғиниладиган (илоҳ)нинг йўқлигига ва Муҳаммад\n" +
                "Аллоҳнинг бандаси ва расули эканига иқрорман.\n" +
                "3. Калимаи тавҳид\n" +
                "Ашҳаду алл`а ил`аҳа иллалл`оҳу ваҳдаҳ`у л`а шар`ика лаҳ, лаҳул мулку ва лаҳул ҳамд(у)\n" +
                "йуҳй`и ва йум`ит(у) ва ҳува ҳаййул л`а йам`ут(у), бийадиҳил хойр(у) ва ҳува ъал`а кулли\n" +
                "шай’ин қод`ир.\n" +
                "Танҳолигига иқрорлик сўзи: Танҳо Аллоҳдан ўзга сиғиниладиган (илоҳ) йўқлигига\n" +
                "иқрорман! Аллоҳнинг шериги йўқдир. Мулк Аллоҳникидир. Мақтов Аллоҳгадир. (Аллоҳ)\n" +
                "тирилтиради ва ўлдиради. Аммо Ўзи тирикдир, ўлмайди. Яхшилик Унинг ихтиёридадир ва У\n" +
                "ҳамма нарсага қодирдир!\n" +
                "4. Калимаи радди куфр\n" +
                "Алл`оҳумма инн`и аъ`узу бика мин ан ушрика бика шай’ан ва ан`а аълам. Ва астағфирука\n" +
                "лима л`а аълам. Иннака анта ъалл`амул ғуй`уб.\n" +
                "Куфрни қайтариш сўзи: Аллоҳим, Сендан ўзим билганим ҳолда Сенга бирор нарсани\n" +
                "шерик қилишимдан асрашингни сўрайман. Сендан ўзим билмаганим ҳолда ширк қилиб қўйган\n" +
                "бўлсам, кечишингни тилайман. Албатта, Сен ғайбларни билгувчи Зотсан.\n" +
                "5. Калимаи истиғфор\n" +
                "Астағфирулл`оҳ, астағфирулл`оҳ, астағфирулл`оҳа таъ`ал`а мин кулли замбин азнабтуҳ`у\n" +
                "ъамдан ав хотоан сиррон ва ъал`анийаҳ. Ва ат`убу илайҳи миназ замбиллаз`и аъламу ва\n" +
                "миназ-замбиллаз`и л`а аълам. Иннака анта ъалл`амул ғуй`уб.\n" +
                "Гуноҳларни кечишини сўраш сўзи: Аллоҳдан гуноҳларимни кечишини сўрайман.\n" +
                "Аллоҳдан гуноҳларимни кечишини сўрайман. Аллоҳ таолодан атайлаб ё адашиб, яширин ё\n" +
                "ошкора қилган ҳамма гуноҳларимни кечишини сўрайман. Ўзим билган ва билмаган гуноҳлардан\n" +
                "Аллоҳга қайтаман. Албатта, Сен ғайбларни билгучи Зотсан.\n" +
                "6. Калимаи тамжид\n" +
                "Мен ҳам намоз ўқийман\n" +
                "www.ziyouz.com кутубхонаси 22\n" +
                "Субҳ`аналл`оҳ вал ҳамду лилл`аҳ ва л`а ил`аҳа иллалл`оҳу валлоҳу акбар. Л`а ҳавла ва\n" +
                "л`а қуввата илл`а билл`аҳил ъалиййил ъаз`им. М`а ш``аалл`оҳу к`ана ва м`а лам йаша’лам\n" +
                "йакун.\n" +
                "Улуғлаш сўзи: Аллоҳнинг айбу нуқсони йўқдир. Ва мақтов Аллоҳгадир. Аллоҳдан ўзга\n" +
                "сиғиниладиган (илоҳ) йўқдир! Аллоҳ улуғдир. Мутлоқ куч ва қувват қудратли ва буюк Аллоҳдан\n" +
                "ўзгада йўқдир. Аллоҳ ниманики хоҳласа, бўлади, ниманики хоҳламаса, бўлмайди.\n" +
                "ИЙМОНИ МУЖМАЛ\n" +
                "`Аманту билл`аҳи кам`а ҳува би асм`аъиҳ`и ва сифатиҳ`и ва қобилту жамийъа аҳк`амиҳи\n" +
                "ва арк`аниҳи.\n" +
                "Аллоҳни исми ва сифатлари билан танидим ва барча буюрган ҳукмларини қабул қилдим.\n" +
                "ИЙМОНИ МУФАССАЛ\n" +
                "`Аманту билл`аҳи ва мал`аикатиҳ`и ва кутубиҳ`и ва русулиҳ`и вал йавмил `ахири вал\n" +
                "қодари хойриҳ`и ва шарриҳ`и миналл`оҳи таъ`ал`а вал баъси баъдал мавт.\n" +
                "Мўминликнинг батафсил ифодаси: Аллоҳга, Унинг фаришталарига, китобларига,\n" +
                "расулларига, охират кунига, яхшилик ва ёмонлик Аллоҳнинг хоҳиши билан бўлишига ва\n" +
                "ўлимдан кейин қайта тирилишга ишондим.\n" +
                "ҚИРҚ ФАРЗ\n" +
                "Ислом беш фарзни ўз ичига олади:\n" +
                "1. Имон.\n" +
                "2. Намоз.\n" +
                "3. Рўза.\n" +
                "4. Закот.\n" +
                "5. Ҳаж.\n" +
                "Имон еттита фарздан иборат:\n" +
                "1) Аллоҳга;\n" +
                "2) Аллоҳнинг фаришталарига;\n" +
                "3) Аллоҳнинг китобларига;\n" +
                "4) Аллоҳнинг пайғамбарларига;\n" +
                "5) Охират кунига;\n" +
                "6) Тақдирга, яъни яхшилик ҳам, ёмонлик ҳам Аллоҳдан эканига;\n" +
                "7) Ўлимдан кейин қайта тирилмоққа ишониш.\n" +
                "Таҳоратнинг фарзлари тўртта:\n" +
                "1. Юзни сочлардан холи жойларини ияк остигача ва икки қулоқ орасидаги қисмини ювиш.\n" +
                "2. Қўлларни тирсаклари билан бирга қўшиб ювиш.\n" +
                "3. Бошнинг тўртдан бирига масҳ тортиш.\n" +
                "4. Оёқларни тўпиқлари билан бирга ювиш.\n" +
                "Ғуслнинг фарзлари\n" +
                "1. Оғизни яхшилаб чайиш.\n" +
                "2. Бурунни ачишгунча яхшилаб чайиш.\n" +
                "3. Баданнинг ҳамма жойини қолдирмасдан ювиш.\n" +
                "Таяммумнинг фарзлари\n" +
                "1. Ният. \n" +
                "Мен ҳам намоз ўқийман\n" +
                "www.ziyouz.com кутубхонаси 23\n" +
                "2. Пок тупроқни қасд қилиш.\n" +
                "3. Икки қўлни пок тупроққа уриб юзга суриш.\n" +
                "4. Қўлларни яна тупроққа уриб, тирсак билан қўшиб қўлларга суриш.\n" +
                "Намознинг фарзлари ўн иккитадир.\n" +
                "Олтитаси намоз ташқарисида, олтитаси намоз ичида.\n" +
                "Намоз ташқарисидагилар «шарт», ичидагилар «рукн» дейилади.\n" +
                "Намознинг олти шарти\n" +
                "1. Таҳорати йўқнинг таҳорат олиши, жунуб бўлганнинг ғусл қилиши.\n" +
                "2. Бадан, кийим ва намоз ўқиладиган жой тоза бўлиши.\n" +
                "3. Аврат ёпиқ бўлиши.\n" +
                "4. Қиблага қараб туриш.\n" +
                "5. Ўз вақтида ўқиш.\n" +
                "6. Ўқийдиган намозига ният қилиш.\n" +
                "Намознинг олти рукни\n" +
                "1. Ифтитоҳ такбири.\n" +
                "2. Қиём.\n" +
                "3. Қироат.\n" +
                "4. Руку.\n" +
                "5. Сажда.\n" +
                "6. Қаъда (сўнгги ўтириш).\n" +
                "Қуйидагилар ҳам фарздир:\n" +
                "1. Илм олиш.\n" +
                "2. Амри маъруф, наҳйи мункар.\n" +
                "3. Ҳалол меҳнат қилиш.\n" +
                "4. Ризқни ҳалол йўл билан топиш.\n" +
                "5. Шариат ҳалол деб белгилаган нарсаларни ейиш.\n" +
                "АЛЛОҲ ТАОЛОНИНГ ЎН ТЎРТ СИФАТИ БОР\n" +
                "Олтитаси сифати зотийа.\n" +
                "Саккизтаси сифати субутийадир.\n" +
                "Сифати зотийалари\n" +
                "1. Вужуд (Борлиги).\n" +
                "2. Қадим (Бошланғичи йўқдир).\n" +
                "3. Бақо (Охири йўқ).\n" +
                "4. Ваҳдоният (Бирдир).\n" +
                "5. Мухолафатун лил-ҳаводис (махлуқотнинг ҳеч бирига ўхшамайди).\n" +
                "6. Қиём бинафсиҳи (макондан муназзаҳдир).\n" +
                "Сифати субутийалари\n" +
                "1. Ҳаёт (Тирик).\n" +
                "2. Илм (Билувчи).\n" +
                "3. Самеъ (Эшитувчи).\n" +
                "4. Басар (Кўрувчи).\n" +
                "5. Ирода (Хоҳлаганини қилади).\n" +
                "6. Қудрат (Кучи ҳамма нарсага етади).\n" +
                "7. Калом (Сўзлайди).\n" +
                "8. Таквин (Бутун махлуқотни яратувчидир).\n" +
                "Муҳим вазифалар\n" +
                "1. Аллоҳ таолони бир деб билиб, зикр этиш. \n" +
                "Мен ҳам намоз ўқийман\n" +
                "www.ziyouz.com кутубхонаси 24\n" +
                "2. Ҳалолдан еб-ичиш.\n" +
                "3. Таҳорат олиш, ғусл қилиш.\n" +
                "4. Беш вақт намоз ўқиш.\n" +
                "5. Ризқни Аллоҳдан деб билиш.\n" +
                "6. Ҳалолдан, тоза кийим кийиш.\n" +
                "7. Аллоҳга таваккул қилиш.\n" +
                "8. Қаноаткор бўлиш.\n" +
                "9. Неъматлари учун Аллоҳга шукр қилиш.\n" +
                "10. Аллоҳнинг қазо ва қадарига рози бўлиш.\n" +
                "11. Балоларга, мусибатларга сабр этиш.\n" +
                "12. Гуноҳларга тавба қилиш.\n" +
                "13. Ихлос билан ибодат этиш.\n" +
                "14. Шайтонни душман билиш.\n" +
                "15. Ҳар бир ишда Қуръони каримни ҳужжат, дастур деб билиш.\n" +
                "16. Ўлимни ҳақ билиб, унга ҳозир бўлиш.\n" +
                "17. Яхшиликка буюриш, ёмонликдан қайтариш.\n" +
                "18. Аллоҳ севганини севиш, севмаганидан қочиш. Ҳар бир ишни Аллоҳ учун қилиш.\n" +
                "19. Ота-онага яхши муносабатда бўлиш ва уларга итоат этиш.\n" +
                "20. Қариндошларни зиёрат қилиш.\n" +
                "21. Омонатга хиёнат этмаслик.\n" +
                "22. Аллоҳдан қўрқиш.\n" +
                "23. Аллоҳга, пайғамбарга итоат қилиш.\n" +
                "24. Гуноҳлардан қочиб, ибодат билан машғул бўлиш.\n" +
                "25. Ўйлаб, тадбир билан иш кўриш.\n" +
                "26. Коинотга ибрат назари билан боқиш.\n" +
                "27. Тилни ёмон сўзлардан сақлаш.\n" +
                "28. Қалбни поклаш, беҳуда сўзларни ва ишларни тарк этиш.\n" +
                "29. Ҳеч кимга ёмонлик қилмаслик, бекорчи, фойдасиз иш қилмаслик.\n" +
                "30. Ҳеч кимни масхара этмаслик, миннат қилмаслик.\n" +
                "31. Ҳаромга қарамаслик.\n" +
                "32. Сўзига содиқ бўлиш, тўғриликдан айрилмаслик.\n" +
                "33. Сеҳр-жоду қилмаслик.\n" +
                "34. Ёмон сўзларни эшитмаслик.\n" +
                "35. Илм таҳсил этиш.\n" +
                "36. Тўғри ўлчаш ва тўғри тортиш.\n" +
                "37. Аллоҳнинг азобидан қўрқиш.\n" +
                "38. Фақирга садақа бериш, муҳтожга ёрдам бериш.\n" +
                "39. Аллоҳнинг раҳматидан умид узмаслик.\n" +
                "40. Нафсга (ёмон орзуларга) тобе бўлмаслик.\n" +
                "41. Аллоҳ учун ейиш, едириш.\n" +
                "42. Кифоя қиладиган даражада ризқ талаб этиш.\n" +
                "43. Молининг закотини бериш.\n" +
                "44. Ҳайз ва нифос ҳолатида хотинига яқинлашмаслик.\n" +
                "45. Қалбини маъсият ва ёмонликлардан тозалаш.\n" +
                "46. Кибр қилмаслик.\n" +
                "47. Етимнинг молини сақлаш.\n" +
                "48. Беш вақт намозни вақтида ўқиш.\n" +
                "49. Зулм ва ҳақсизлик билан халқнинг молини емаслик.\n" +
                "50. Алллоҳга ширк келтирмаслик. \n" +
                "Мен ҳам намоз ўқийман\n" +
                "www.ziyouz.com кутубхонаси 25\n" +
                "51. Шароб ичмаслик, қимор ўйнамаслик, пора олмаслик, пора бермаслик.\n" +
                "52. Зинодан қочиш.\n" +
                "53. Бекорчи ишлар учун қасам ичмаслик. \n" +
                "Мен ҳам намоз ўқийман\n" +
                "www.ziyouz.com кутубхонаси 26\n" +
                "Ҳар хил дуолар\n" +
                "Роббиғфир варҳам ваҳдин`и илат-тор`иқил-ақвам ва та-ж`аваз ъамм`а таълам,\n" +
                "иннака антал-аз`изул акрам.\n" +
                "Алл`оҳумма инн`и ас’алукал-ъафва вал-ъ`афийата фид-дунй`а вал-`ахиро.\n" +
                "Парвардигорим, мени раҳмат ва мағфират эт. Тўғри йўлга бошла. Ўзинг билган\n" +
                "гуноҳларимни кечир. Ўзинг карамлисан. Илоҳо, Сендан афв ва офият тилайман икки дунёда.\n" +
                "Алл`оҳумма инн`и ас’алукал-ҳуд`а ват-туқ`о вал-ъаф`афа вал ғин`а.\n" +
                "Алл`оҳуммағфирл`и варҳамн`и ваҳдин`и ваъ`афин`и варзуқн`и.\n" +
                "Алл`оҳумма й`а мусоррифал-қул`уби сорриф қул`убана ъал`а т`оъатик.\n" +
                "Алл`оҳумма инн`и аъ`узу бика минал ъажзи вал-касали вал-жубни вал-ҳарами\n" +
                "вал-бухли ва аъ`узу бика мин фитнатил-маҳй`а вал-мам`ати ва долиъ ад-дайни ва\n" +
                "ғолабатир-риж`ал.\n" +
                "Илоҳо, мен Сендан ҳидоят, тақво, ўртача бойлик тилайман. Илоҳо, мени мағфират эт ва\n" +
                "раҳматингга сазовор қил. Илоҳо, қалбимизни ўз тоатингга мойил қил. Илоҳо, Сендан ожизлик,\n" +
                "дангасалик, қўрқоқлик, бахиллик каби иллатдан паноҳ беришингни сўрайман. Яна Сендан ҳаёт\n" +
                "ва мамот фитналаридан, ортиқча қарздор бўлишдан ва ғанимларга мағлуб бўлишдан паноҳ\n" +
                "тилайман.\n" +
                "Алл`оҳумма инн`и аъ`узу бика минал-ъажзи вал касали вал жубни вал бухли\n" +
                "вал ҳамми ва ъ`азабил-қобри.\n" +
                "Алл`оҳумма `ати нафси тақв`аҳ`а ва заккиҳ`а анта хойру ман закк`аҳ`а, анта\n" +
                "вал`ийуҳа ва мавл`аҳ`а.\n" +
                "Илоҳо, Сендан ожизлик, дангасалик, қўрқоқлик, бахиллик, ғам-ташвиш, қабр азоби каби\n" +
                "нарсалардан паноҳ сўрайман. Илоҳо, менга тақво насиб эт, нафсимни пок эт. Сен барча\n" +
                "инсонларнинг соҳиби – эгасисан.\n" +
                "Алл`оҳумма инн`и аъ`узу бика мин шарри самъи ва мин шарри басари ва мин\n" +
                "шарри лис`ани ва мин шарри қолби ва мин шарри ниййати.\n" +
                "Илоҳо, мен Сендан эшитиш, кўриш ва гапириш ва дилдан ўтказиш жараёнида учрайдиган\n" +
                "ёмонликлардан паноҳ беришингни сўрайман.\n" +
                "Алл`оҳумма инн`и аъ`узу бика минал бароси вал-жун`уни вал-жуз`ами ва\n" +
                "саййи’ил-асқом.\n" +
                "Алл`оҳумма инн`и аъ`узу бика миннат-тараддий ва аъ`узу бика минал-ғароқи\n" +
                "вал ҳарфи вал-ҳарами ва аъ`узу бика ан йатахаббатониш-шайт`ону ъиндал-мавт ва\n" +
                "аъ`узу бика ан ам`ута ф`и саб`илика мудбирон ва аъ`узу бика ан ам`ута лад`иғон.\n" +
                "Илоҳо, мен Сендан ёмон касалликлардан ва қаттиқ беморликлардан паноҳ сўрайман.\n" +
                "Илоҳо, турли офатлардан ва балолардан, оғир дамда шайтоннинг васвасасидан ва ёмон\n" +
                "фожиали ўлимлардан асрашингни сўрайман.\n" +
                "Алл`оҳумма инн`и ас’алука мин хойри м`а са’алака минҳу набиййука\n" +
                "Муҳаммадун соллалл`оҳу ъалайҳи ва саллам ва наъ`узу бика мин шарри м`а\n" +
                "истаъазака минҳу набиййука Муҳаммадун соллалл`оҳу алайҳи ва саллам ва анталмустаъану\n" +
                "ва ъалайкал-бал`ағу ва л`а ҳавла ва л`а қуввата илл`а билл`аҳ.\n" +
                "Илоҳо, пайғамбаринг Муҳаммад алайҳиссалом сўраган нарсалардан мен ҳам сўрайман,\n" +
                "пайғамбаринг паноҳ тилаган нарсалардан мен ҳам паноҳ тилайман. Ўзинг ёрдам берувчисан.\n" +
                "Сендан ўзгада куч-қувват йўқ.\n" +
                "Алл`оҳумма солли ва саллим ъал`а Муҳаммадин ва ъал`а `али Муҳаммад.\n" +
                "Илоҳо, пайғамбаринг Муҳаммад алайҳиссаломга саловот ва саломлар нозил эт.\n" +
                "Алл`оҳумма иннака қулта удъ`уни астажибу лакум ва иннака л`а тухлифулм`иъ`ад,\n" +
                "ва инн`и ас’алука кам`а ҳадайтан`и лил’исл`ами ан л`а танзаъаҳ`у\n" +
                "минн`и, ҳатта татаваффан`и ва ан`а муслим`ун.\n" +
                "Мен ҳам намоз ўқийман\n" +
                "www.ziyouz.com кутубхонаси 27\n" +
                "Эй бор Худоё, дуо қилинглар менга, ижобат қиламан, деб Ўзинг айтдинг, албатта Сен\n" +
                "ваъдангга хилоф қилмагайсан. Эй бор Худоё, ҳидоят неъматини бериб мени Исломга мушарраф\n" +
                "қилдинг, энди уни мендан жудо қилмагин ва то ўлгунимча Исломда бўлишимни насиб эт.\n" +
                "Илоҳо, Ўзинг бизларни бу динда собитқадам эт.\n" +
                "Алл`оҳумма инн`и ас’алука ийм`анан д`а’иман ва яқ`инан с`одиқон ва ъилман\n" +
                "н`афиъан ва қолбан х`ошиъан ва лис`анан з`акиран ва ас’алука ъафва валъ`афийата\n" +
                "вал-маъ`аф`атан д`а’имата фид-дунй`а вал-`ахиро.\n" +
                "Илоҳо, Сендан доимий имон, мустаҳкам эътиқод, фойдали илм, қўрқувчи қалб, зикр этувчи\n" +
                "тил, афву офият ва дунёю охиратда доимо хотиржамликни сўрайман.\n" +
                "Алл`оҳумма й`а муқоллибал-қул`уби саббит қолби ъал`а д`иник.\n" +
                "Алл`оҳумма аъинн`и ъал`а зикрика ва шукрика ва ҳусни ъиб`адатик.\n" +
                "Илоҳо, Сен дилларни ўзгартириб турувчисан, менинг дилимни Ўз динингга собит эт.\n" +
                "Илоҳо, Ўзинг Сени зикр этишимга, Сенга шукр этишимга ва чиройли ибодат қилишимга\n" +
                "ёрдам қил.\n" +
                "Субҳ`аналл`оҳи ъадада холқиҳ`и, субҳ`аналл`оҳи риз`оа нафсиҳ`и,\n" +
                "субҳ`аналл`оҳи з`ината ъаршиҳ`и, субҳ`аналл`оҳи мид`ада калим`атиҳ`и.\n" +
                "Аллоҳга барча махлуқларининг ададича тасбиҳ айтамиз ва Унга ўзининг ризолиги\n" +
                "баробарида ва аршининг оғирлиги баробарида ва сўзларининг сиёҳлари баробарида тасбиҳ\n" +
                "айтамиз.\n" +
                "Роббан`а л`а ту`ахизн`а ин нас`ин`а ав ахто’н`а.\n" +
                "Роббан`а ва л`а таҳмил ъалайн`а исрон кам`а ҳамалтаҳ`у ъалал-лаз`ина мин\n" +
                "қоблин`а.\n" +
                "Роббан`а ва л`а туҳаммилн`а м`а л`а т`оқоталан`а биҳ, ваъфу ъанн`а вағфир\n" +
                "лан`а варҳамн`а, анта Мавл`ан`а фансурн`а ъалал-қовмил-к`афир`ин.\n" +
                "Парвардигоро, агар эсимиздан чиқарсак, хатога йўл қўйсак, бизларни жавобгар қилма,\n" +
                "бизларнинг зиммамизга олдинги умматларга юклаганингдек оғир юкларни юклама, тоқатимиз,\n" +
                "имкониятимиз йўқ нарсаларни бизларга қарз қилма, бизларни кечир, афву мағфират эт,\n" +
                "раҳматингга ол, Сен бизларнинг ҳожамизсан, кофирлар устидан бизларга ёрдам бер.\n" +
                "Алл`оҳумма инн`и аъ`узу бика минал-қосвати вал ғофлати вал-ъайлати ваззиллати\n" +
                "вал масканати. Ва аъ`узу бика миналкуфри вал фақри вал-фус`уқи вашшиқ`оқи\n" +
                "ван-ниф`ақи, ва су’ил-ахл`ақи, ва зийқил-арз`оқи, вас-сумъати, варрий`аи,\n" +
                "ва аъ`узу бика минас-сомами вал-баками вал-ъам`а вал-жун`уни валжуз`ами\n" +
                "вал-бароси ва саййи’ил-асқом.\n" +
                "Илоҳо, Сендан тошбағирлик, ғафлат, қашшоқлик, хорлик, мискинлик каби иллатлардан\n" +
                "паноҳ сўрайман. Яна Сендан куфрдан, фақирликдан, фисқу фужурдан, низо ва ихтилофдан,\n" +
                "ёмон руҳлардан, ризқи тангликдан, риёкорликдан, кўру кар бўлишликдан, жиннилик ва ёмон\n" +
                "касалликлардан паноҳ сўрайман.\n" +
                "Зам-зам ичилганда ўқиладиган дуо\n" +
                "Алл`оҳумма инн`и ас’алука ъилман н`афиъан ва қолбан х`ошиъан ва н`уран\n" +
                "с`атиъан ва ризқон в`асиъан ва шиф`аан мин кулли д`аин. Алл`оҳумма инн`и\n" +
                "ашробуҳ`у литағфирол`и. Алл`оҳумма фағфирл`и. Алл`оҳумма инн`и ашробуҳ`у\n" +
                "мусташфийан биҳ`и. Алл`оҳумма фашфин`и.\n" +
                "Илоҳо, Сендан фойдали илм, тақволи қалб ва ёруғ нур ва кенг ризқ ва барча иллатлардан\n" +
                "шифо тилайман. Илоҳо, бу Зам-зам сувини Сендан мағфират сўраб ва дардларимга шифо\n" +
                "талабида ичмоқдаман, Ўзинг шифо бер. \n" +
                "Мен ҳам намоз ўқийман\n" +
                "www.ziyouz.com кутубхонаси 28\n" +
                "Равзаи муборакда ўқиладиган дуо\n" +
                "Ассал`аму ъалайка й`а рас`улалл`оҳи! Ассал`аму ъалайка й`а хийраталл`оҳи мин\n" +
                "холқиҳ`и! Ассал`аму ъалайка й`а ҳаб`ибалл`оҳи! Ассал`аму ъалайка й`а саййидалмурсал`ина\n" +
                "ва х`отаман-набийй`ина! Ассал`аму ъалайка ва ъал`а `алика ва\n" +
                "асҳ`абика ва аҳли байтика ва ъалан-набийй`ина ва с`аъирис-с`олиҳ`ина! Ашҳаду\n" +
                "аннака баллағтар-рис`алата ва аддайтал-ам`аната ва насоҳтал-уммата, фа\n" +
                "жаз`акалл`оҳу ъанна афзола м`а жаз`а рас`улан ъан умматиҳи.\n" +
                "Алл`оҳумма солли ъал`а Муҳаммадив-ва ъал`а `али Муҳаммад. Кам`а соллайта\n" +
                "ъал`а Иброҳ`има ва ъал`а `али Иброҳ`им. Иннака ҳам`идум-маж`ид.\n" +
                "Ва б`арик ъал`а Муҳаммадив-ва ъал`а `али Муҳаммад. Кам`а б`арокта ъал`а\n" +
                "Иброҳ`има ва ъал`а `али Иброҳ`им. Иннака ҳам`идум-маж`ид.\n" +
                "Алл`оҳумма иннака қулта: «Ва лав аннаҳум из золам`у анфусаҳум жа’ука фастағфарулл`оҳа\n" +
                "ва-стағфара лаҳумур-рос`улу л`а важадулл`оҳа тавв`абан\n" +
                "роҳ`има». Ва қод атайтука й`а рас`улалл`оҳи мустағфирон мин зун`уби,\n" +
                "мусташфиъан бика ил`а робб`и, фа ас’алука й`а робб`и ан туж`иба лийалмағфирота\n" +
                "кам`а авжабтаҳ`а лиман ат`аҳу фи ҳай`атиҳи. Алл`оҳумма-жъалҳу авва\n" +
                "лаш-ш`афиъ`ина й`а арҳамар-р`оҳим`ин.\n" +
                "Маъноси: Ў Расулуллоҳ сизга салом, эй халқларнинг энг афзали, сизга салом, эй Ҳабибуллоҳ,\n" +
                "сизга салом, эй пайғамбарларнинг саййиди, сизга салом, эй пайғамбарларнинг хотами, сизга\n" +
                "салом! Сизга ва аҳли аёлингизга ва саҳобаларингизга ва барча пайғамбарлар ва солиҳ\n" +
                "бандаларга саломлар бўлсин. Гувоҳлик бераманки, сиз пайғамбарлик вазифангизни тўғри адо\n" +
                "этдингиз. Аллоҳнинг омонатини топширдингиз, умматларингизга насиҳат қилдингиз, Сизга\n" +
                "Аллоҳ ажру азимлар ато қилсин. Илоҳо, Муҳаммад алайҳиссаломга, оли асҳобларига Ўзинг\n" +
                "салавотлар юборгин ва У кишига ва оли асҳобларига баракотлар нозил қилгин, чунончи\n" +
                "Иброҳим алайҳиссаломга нозил қилганинг каби. Илоҳо, Ўзинг Қуръони каримда марҳамат\n" +
                "қилдингким, «Агар улар ўзларига ўзлари зулм қилганларидан ке-йин пайғамбарим ҳузурига\n" +
                "келиб истиғфор этсалар ва пайғамбарим ҳам истиғфор этса, Аллоҳ таоло уларнинг\n" +
                "тавбаларини қабул этувчи, меҳрибон зотдир», дегансан. Мана, Расулуллоҳ ҳузурига истиғфор\n" +
                "айтиб, Аллоҳдан гуноҳимизни сўраб келдик, Уни шафоатчи қилдик, Парвардигор ҳузурига\n" +
                "тавба қилдик, Аллоҳ ўзи Расулуллоҳнинг шафоатлари билан бизларни мағфират қилишини\n" +
                "сўраймиз.\n" +
                "Саҳобалар ўқиган дуолар\n" +
                "Абдуллоҳ ибн Масъуднинг (р.а.) дуолари\n" +
                "Аллоҳим! Сендан ортга қайтмайдиган (бақувват) бир имон, туганмас неъмат ва ҳулд\n" +
                "жаннатининг энг юқори даражасида Пайғамбаринг ила бирга бўлишликни сўрайман.\n" +
                "Роббан`а аслиҳ байнан`а, ваҳдин`и суб`улал-Исл`ами, ва нажжина миназ-зулум`ати иланн`ур,\n" +
                "васриф аннал-фав`аҳиша м`а зоҳаро, вам`а батана, ва б`арик лан`а фий асм`аъин`а ва\n" +
                "абс`орин`а ва қул`убин`а ва азв`ажин`а ва зуррийй`атин`а ва туб ъалайн`а иннака антаттавв`абур-роҳ`ийму,\n" +
                "важъална ш`акирийна, ли неъматика, мусн`ийна биҳа, қо`илийна биҳ`а\n" +
                "ва атмимҳ`а ъалайн`а.\n" +
                "Эй Раббимиз! Ораларимизни ислоҳ эт, бизни исломият йўлига ҳидоят айла, бизни\n" +
                "зулматдан ёруғликка чиқар. Юзимизни ошкор ва яширин барча ёмонликлардан ўгир.\n" +
                "Кўзларимизни, қулоқларимизни, қалбларимизни, ишларимизни ва фарзандларимизни бизга\n" +
                "муборак қил, гуноҳларимизни кечир. Шубҳасиз, Сен ўта марҳаматли ва гуноҳларни\n" +
                "кечиргувчисан. Бизни неъматингга шукр этувчи, ҳамд айтувчи қил ва неъматингни биздан\n" +
                "аяма! \n" +
                "Мен ҳам намоз ўқийман\n" +
                "www.ziyouz.com кутубхонаси 29\n" +
                "(«Ал-Канз», «Ал-Мунтаҳаб»дан)\n" +
                "Абдураҳмон ибн Авфнинг (р.а.) дуоси\n" +
                "Абу Ҳаййож ал-Асадийдан (р.а.): «Бир куни Байтуллоҳни тавоф қиларкан, бир одамнинг\n" +
                "фақатгина тинимсиз: «Аллоҳим! Мени нафсимнинг очкўзлиги (таъмагирлиги) дан асра!» дея\n" +
                "дуо қилаётганини кўрдим. Унга яқинлашиб дедим:\n" +
                "– Аллоҳдан шундан бошқа сўрайдиган нарсанг йўқми? Фақат биргина дуони қайтаряпсан?\n" +
                "– Агар нафсимнинг очкўзлигидан (таъмагирлигидан) сақлансам, на ўғрилик, на зино ва на\n" +
                "бирор гуноҳ қиламан, – деди.\n" +
                "Қарасам, бу одам Абдураҳмон ибн Авф розийаллоҳу анҳу экан.\n" +
                "(Тафсири Ибни Касирдан)\n" +
                "Ҳазрати Алининг (р.а.) дуолари\n" +
                "Аъ`узу бика мин жаҳдил бал`аи ва даркиш-шиқ`а’и ва шаматат’ил аъд`а’и ва аъ`узу бика\n" +
                "минас-сижни вал-қойди вас-савти.\n" +
                "Аллоҳим! Бало ва мусибатлардан, омадсизликдан, душманлар билан тортишишдан, ҳибс\n" +
                "этилишдан, кишанланишдан ва калтакланишдан паноҳ тилайман.\n" +
                "Алл`оҳумма инн`а зун`убий л`а тазуррука ва инн`а раҳматака ийй`айа л`а танқусука.\n" +
                "Аллоҳим! Менинг гуноҳларим Сенга зарар бермайди, Сенинг менга марҳамат қилишинг\n" +
                "Сендан ҳеч нарсани камайтириб қўймайди.\n" +
                "Ҳазрати Абу Бакрнинг (р.а.) дуолари\n" +
                "Алл`оҳумма ҳаблий ийм`анан ва яқ`ийнан ва муъ`аф`атан ва ниййатан.\n" +
                "Аллоҳим! Менга имон, сидқидиллик, соғлиқ, офият ва соғлом бир ният бер.\n" +
                "Алл`оҳуммажъал хойро ъум`урий `ахироҳу ва хойро амали ва хав`атимаҳу ва хойро\n" +
                "айй`амий явма алқ`ока.\n" +
                "Аллоҳим! Умримнинг энг хайрлиси, умримнинг сўнги, амалимнинг энг хайрлиси, амалимнинг\n" +
                "сўнги ва кунларимнинг энг хайрлиси Сенинг ҳузурингга чиқадиган куним бўлсин».\n" +
                "Ҳазрати Умарнинг (р.а.) дуолари\n" +
                "Алл`оҳумма инн`ий аъ`узу бика ан таъхузан`ий ъал`а ғирратин ав тазаран`ий фий\n" +
                "ғафлатин, ав тажъалн`ий-ғ`офил`ийна.\n" +
                "Аллоҳим! Мени ногаҳон ўлимдан ёхуд ғафлатда қолдиришинг ёки ғофиллардан\n" +
                "қилишингдан паноҳ тилайман.\n" +
                "Алл`оҳумма таваффан`ий маъал абр`ори, ва л`а тажъалн`ий фил ашр`ари ва қ`иний\n" +
                "аз`абанн`ари ва алҳиқний бил-аҳй`ар.\n" +
                "Аллоҳим! Мени яхшилар орасида ўлдир, ёмонлардан қилма, оташ азобидан асра ва\n" +
                "яхшилар қаторига қўшгин.\n" +
                "Ҳазрати Билолнинг (р.а.) дуоси\n" +
                "Аллоҳим! Менинг ёмонликларим ва нуқсонларимни кечиргин.\n" +
                "Абу Дардонинг (р.а.) дуоси\n" +
                "Билол ибн Саъддан (р.а.):\n" +
                "Абу Дардо (р.а.) дер эди.:\n" +
                "– Аллоҳим! Хаёл тарқоқлигидан паноҳ сўрайман.\n" +
                "– Хаёл тарқоқлиги нима? – дея сўрашди.\n" +
                "– Кишининг ҳар бир дарада бир нарсасининг бўлишидир, – дея жавоб берди у.\n" +
                "– Аллоҳим! Олимларнинг қалбларининг менга лаънат ўқишидан паноҳ сўрайман, – дея дуо\n" +
                "Мен ҳам намоз ўқийман\n" +
                "www.ziyouz.com кутубхонаси 30\n" +
                "қилган Абу Дардодан сўрашди:\n" +
                "– Олимларнинг қалбларининг лаънат ўқишлари қандай бўлади?\n" +
                "– Ичларидан менга нисбатан нафрат этишларидир, – деди Абу Дардо.\n" +
                "Зайд ибн Собитнинг (р.а.) дуоси\n" +
                "Аллоҳим! Сендан бола-чақам ва қўл остимда менга қараб қолган қулларимни боқишга\n" +
                "етгулик бойлик сўрайман. Ва бирор қариндошимнинг қариндошлик ҳақини адо этолмаганим\n" +
                "учун мени баддуо қилишидан паноҳ тилайман.\n" +
                "Саъд ибн Убоданинг (р.а.) дуоси\n" +
                "Аллоҳим! Сенга ҳамд айтишни менга насиб эт ва шараф эҳсон айла.\n" +
                "Ибни Аббоснинг (р.а.) дуоси\n" +
                "Аллоҳим! Мени берган ризқингга қаноат этгувчилардан айла, менга берган ризқни\n" +
                "баракотли қил ва орқада қолдирган ҳар нарсамни Ўзинг асра.\n" +
                "Анаснинг (р.а.) дуоси\n" +
                "Аллоҳим, уни (мусулмон биродаримни), кечалари ибодат қилувчи ва кундузлари рўзадор\n" +
                "яхшилар дуосининг баракотидан маҳрум этма.\n" +
                "Ҳажда ва Умрада ўқиладиган дуолар\n" +
                "Аллоҳдан ўзга илоҳ йўқ, Унинг шериги ҳам йўқ. Аллоҳ улуғдир, Унга кўп ҳамдлар айтамиз.\n" +
                "Бутун оламнинг Парвардигори бўлмиш Аллоҳга тасбиҳ айтамиз, ҳеч қандай куч-қувват\n" +
                "Аллоҳдан ўзгада йўқдир. У Азизу Ҳакимдир. Илоҳо, мени мағфират эт ва раҳмат қил ва ҳидоят\n" +
                "йўлига бошла ва ризқимни зиёда қил. Илоҳо, Сендан розилигингни сўрайман ва хотиржам\n" +
                "тирикчилик қилиш ва вафотимдан кейин ҳам тинч бўлишни сўрайман ва Сенинг дийдорингга\n" +
                "назар қилишлик лаззатидан насиб этишингни сўрайман ва Сенга ҳеч қандай зарар кўрмаган\n" +
                "ҳолимда йўлиқишни сўрайман. Бировга зулм қилишдан ва бировлар ҳам менга зулм қилишидан\n" +
                "Ўзинг асра. Ҳалол касбларни насиб эт. Гуноҳларимни кечир. Илоҳо, мен Сендан мустаҳкам\n" +
                "иймон ва туганмас неъмат, доимий шодлик ва пайғамбаринг Муҳаммад алайҳиссаломга\n" +
                "рафиқликни сўрайман. Эй Худоё, барча пок нарсаларни ва хайрли ишларни ва гуноҳлардан\n" +
                "узоқлашишни, камбағал бечораларни дўст тутишни бизга насиб эт. Сендан муҳаббат ва Сени\n" +
                "суймоқни ва Сен севган бандаларни ҳам севмоқни сўрайман, муҳаббатингга сабаб бўладиган\n" +
                "амалларни билдиришингни сўрайман ва тавбаларимизни қабул этиб, мағфират этишингни\n" +
                "сўрайман ва фитналардан тинч қилишингни илтижо қиламан.\n" +
                "Илоҳо, Ўзингга тақво қиладиган, гуноҳларига ўкинадиган ва Сенга таваккул қиладиган\n" +
                "қалбларни бизга насиб эт. Илоҳо, Сендан улуғ ишларни адо этишни, мағфиратингни ва\n" +
                "раҳматингга сабаб бўладиган амалларни қилишни насиб этишингни сўраймиз. Гуноҳлардан\n" +
                "саломатлик ва яхши ишларни ғанимат билишликни бизларга ато эт, жаннатингга эришишлик ва\n" +
                "дўзахингдан омонда бўлишликни насиб айла.\n" +
                "Якка Аллоҳдан ўзга илоҳ йўқ. Барча мулку ашё Унга хосдир. Унга ҳамду сано айтамиз. У\n" +
                "барча нарсаларга қодир. Илоҳо, намозимиз ҳам ибодатларимиз, ҳаёту мамотларимиз барчаси\n" +
                "Сенинг учундир. Сенинг ҳузурингга борурмиз ва мулкларимиз Сенга мерос қолур. Илоҳо, мен\n" +
                "ўз нафсимга ўзим зулм қилдим, фақат ўзинг гуноҳларни кечиргувчисан. Ўзинг кечир ва раҳмат\n" +
                "эт, Сен кечиргувчи меҳрибон Зотсан. Бизларга ҳақиқий тавбани, қайтиб гуноҳ қилмайдиган\n" +
                "тавбаларни ато эт. Бизларни тўғри йўлга бошла, гуноҳ ишлардан узоқлаштир. Ҳалол ризқингни\n" +
                "бер. Ўзингдан бошқага муҳтож этма. Қалбимизни ва қабримизни мунаввар қил, барча\n" +
                "ёмонликлардан паноҳ бер, барча яхшиликларни ато эт. Илоҳо, ўзимга-ўзимни топшириб қўйма. \n" +
                "Мен ҳам намоз ўқийман\n" +
                "www.ziyouz.com кутубхонаси 31\n" +
                "Қийинчиликлардан сақла. Илоҳо, ҳақиқий, асосий ишим бўлмиш динимни ислоҳ эт, яшаб турар\n" +
                "жойим саналмиш дунёйимни ислоҳ эт, борадиган жойим бўлмиш охиратимни ислоҳ эт.\n" +
                "Ҳаётимни фақат яхшиликларни зиёда қилишликка сарф қилишимни ва ўлимни эса барча\n" +
                "ёмонликлардан роҳат бўлишини насиб қил. Илоҳо, бизни, ота-оналаримизни,\n" +
                "зурриётларимизни, биродар ва аҳлимизни ва ғойиб мусулмон-мўминларни Ўзинг мағфират эт.\n" +
                "Илоҳо, офият ва тинчлигимизни биздан жудо қилма, ғазабингдан Ўзинг асра. Илоҳо, бу дунё ва\n" +
                "охиратда ҳидоят қил ва мағфират эт. Тирикчилигимизни яхшила ва байтингни зиёрат қилиб,\n" +
                "ҳаж ибодатларини адо этадиган ҳожилардан қил. Илоҳо, Сен менинг сўзларимни эшитасан,\n" +
                "турган жойимни биласан, махфий ва ошкора ишларимдан хабардорсан, Сенга бирор нарса\n" +
                "махфий эмас. Мен эса бир бечора фақирман, Ўзингдан нажот сўрайман. Гуноҳимга иқрорман,\n" +
                "Сендан бир мискин каби сўрайман ва илтижо қиламан, дуоларимни ижобат эт. Илоҳо,\n" +
                "ижобатдан маҳрум этма. Илоҳо, Сен меҳмон-дўстликни яхши кўрасан, биз Сенинг\n" +
                "меҳмонларингмиз, бизни жаннатинг билан зиёфат қил. Меҳмонларга мукофот ва совға\n" +
                "берилади, Сен бизга ўз раҳматинг ва мағфиратинг ва жаннатингни совға эт. Биз Сенинг\n" +
                "байтингга ҳар томондан келдик, умид билан келган бандаларингнинг дуоларини ижобат қил.\n" +
                "Исми Аъзам дуоси\n" +
                "Анас ибн Моликдан, розийаллоҳу анҳу: «Ҳазрати Пай-ғамбаримиз ҳузурларида бир одам\n" +
                "намоз ўқир эди. Одам намоздан сўнг дуо қилиб, шундай деди: «Алл`оҳумма инн`ий\n" +
                "аc’алука би анна лакал-ҳамду л`а ил`аҳа илл`а Антал Манн`ану б`адиъуссам`ав`ати\n" +
                "вал-арзи, й`а зал-жал`али вал-икр`ом, й`а Ҳаййу й`а Қўйй`ум».\n" +
                "«Аллоҳим, Сендан ушбулар ҳурматига сўрайманки, ҳамд Сенга хосдир. Сендан Ўзга ҳеч бир\n" +
                "илоҳ йўқдир. Сен Маннонсан: мўл-кўл берувчисан, осмонлару ерни бемисл яратган Сенсан. Эй\n" +
                "жалол ва икром эгаси! Эй мавжудотга ҳаёт бергувчи, уларнинг ҳаётини давом эттиргувчи\n" +
                "Аллоҳим! Дуойимни қабул айла!»\n" +
                "Расули акрам, соллаллоҳу алайҳи ва саллам, бу дуони эшитиб, шундай марҳамат қилдилар:\n" +
                "«Аллоҳ таолога исми аъзами билан дуо қилди. Аллоҳ, у исмининг ҳаққи-ҳурмати, истаса,\n" +
                "дуони қабул қилади».\n" +
                "* * *\n" +
                "Саъд ибн Аби Ваққосдан (р.а) ривоят қилинишича, Пайғамбаримиз, соллаллоҳу алайҳи ва\n" +
                "саллам, шундай деганлар: «Зуннун (Юнус) алайҳиссалом балиқ қорнида бундай дуо қилган:\n" +
                "«Л`а ил`аҳа илл`а анта субҳ`анака инн`ий кунту миназ-з`олим`ийн».\n" +
                "«Сендан ўзга илоҳ йўқдир. Сен барча нуқсонлардан покдирсан. Дарҳақиқат, мен (ўзимга)\n" +
                "зулм қилувчилардан бўлдим» (Анбиё, 87).\n" +
                "Шуниси аниқки, бир мусулмон бирор нарса истаб, бу билан дуо қилса, Аллоҳ қисқа пайтда\n" +
                "унинг дуосини қабул қилади» (Термизий. «Даъват», 3505-ҳадис).\n" +
                "Ҳазрати Ойиша (р.а.): «Бир куни Аллоҳ Расулининг, соллаллоҳу алайҳи ва саллам, бундай\n" +
                "дуо қилаётганларини эшитдим: «Алл`оҳумма инн`ий ас’алука бисмикат-т`оҳирит-тоййибилмуб`арокил-аҳабби\n" +
                "илайкал-лаз`ий из`а дуъийта биҳ`и ажабта ва из`а су’илта биҳ`и аътойта\n" +
                "ва изас-турҳимта биҳ`и роҳимта ва изас-туфрижта биҳ`и фаррожта».\n" +
                "«Аллоҳим, Сенинг пок, чиройли, муборак ва Сен учун энг севимли ва гўзал бўлган исминг\n" +
                "ҳаққи-ҳурматига Сендан сўрайман. У исминг-ла дуо қилинса, қабул этасан. Унинг ҳурматидан\n" +
                "Сендан бир нарса сўралса, берасан. Унинг ҳурматидан марҳамат исталса, марҳамат этасан.\n" +
                "Унинг ҳурматидан Сендан қийинчиликлардан холос бўлиш сўралса, қутқарасан. Ғамандуҳларни\n" +
                "кетказасан» (Ибн Можа. «Дуо», 3859-ҳадис).\n" +
                "Мен ҳам намоз ўқийман\n" +
                "www.ziyouz.com кутубхонаси 32\n" +
                "Асмо бинти Язиддан (р.а.): «Жаноб Пайғамбаримиз шундай марҳамат қилганлар: Исми Аъзам\n" +
                "ушбу икки оятдадир: «Ва ил`аҳукум ил`аҳун в`аҳид, л`а ил`аҳа илл`а ҳувар-роҳм`анирроҳ`ийм».\n" +
                "\n" +
                "«Сизнинг илоҳингиз яккаю ягона Тангридир. У меҳрибон ва раҳмли бўлиб, Ундан бошқа илоҳ\n" +
                "йўқдир». (Абу Довуд. «Солат», 1496-ҳадис).\n" +
                "Иккинчиси «Ол-и Имрон» сурасининг илк оятларидир: «Ал`иф, л`ам, м`им. Алл`оҳу л`а\n" +
                "ил`аҳа илл`а ҳувал-ҳаййул-қой-й`ум».\n" +
                "«Алиф, лом, мим. Аллоҳ — Ундан ўзга илоҳ йўқдир. У тирик ва абадий турувчидир» (Абу\n" +
                "Довуд. «Солат», 1496-ҳадис).\n" +
                "Касалликдан шифо истаб ўқиладиган дуо\n" +
                "Бирор касалликка йўлиққан киши, бу касалликдан халос бўлиши учун ҳеч вақт ўтказмай,\n" +
                "мутахассис шифокорларга мурожаат қилиши, унинг тавсияларига амал қилиб, айни пайтда\n" +
                "дуодан ҳам фойдаланмоғи лозим. Бу дуоларни беморнинг ўзи ўқиши ёки биров унга ўқиши\n" +
                "мумкин.\n" +
                "Таҳоратли ҳолда аввало Фотиҳа сураси, сўнгра Қуръони каримдан шифо оятлари ўқилади.\n" +
                "Бисмилл`аҳир роҳм`анир роҳ`ийм. Ва йашфи суд`уро қовмин муъмин`ийна ва йузҳиб ғойзо\n" +
                "қул`убиҳим.\n" +
                "«Аллоҳ мўминлар қавми сийналарига шифо беради ва дилларидаги аламни кетказади»\n" +
                "(Тавба, 14-15).\n" +
                "Й`а аййуҳан-н`асу қод жааткум мавъизотун мин Роббикум ва шиф`аун лим`а фис-суд`ури\n" +
                "ва ҳудан ва роҳматан лил-муъмин`ийн.\n" +
                "«Эй одамлар! Сизларга Роббингиздан ваъз (насиҳат), диллардаги нарса (ширк иллати)га\n" +
                "шифо ва мўминларга ҳидоят ва раҳмат келди» (Юнус, 57).\n" +
                "Ва нуназзилу минал Қуръ`ани м`а ҳува шиф`а’ун ва роҳматун лил-му’мин`ийн.\n" +
                "«(Биз) Қуръонда(н) мўъминлар учун шифо ва раҳмат бўлган (оят)ларни нозил қилурмиз»\n" +
                "(Ал-Исро, 82).\n" +
                "Қул ҳува лил-лаз`ийна `аману ҳудан ва шиф`аун\n" +
                "«Айтинг: «(Ушбу Қуръон) имон келтирган зотлар учун ҳидоят ва шифодир».\n" +
                "Бу оятлар ўқилгач, бундай дуо этилади: «Алл`оҳумма Роббан-н`аси азҳибил-ба’са, ишфи\n" +
                "Анташ-ш`аф`ий л`а шиф`а’а илл`а шиф`а’ука, шиф`а’ан л`а йуғ`одиру сақ`оман».\n" +
                "«Аллоҳим, эй инсонларнинг Рабби, касалликни маҳв этувчи! Ортда касалликни\n" +
                "қолдирмайдиган шифо бер. Шифо бергувчи фақат Ўзингсан. Сендан ўзга шифо бергувчи\n" +
                "йўқдир» (Абу Довуд. «Жаноиз», 3107-ҳадис).\n" +
                "Алл`оҳумма ишфи ъабдака йанка’лака ъадувван ав йамши лака ил`а сол`атин.\n" +
                "«Аллоҳим, шу бандангга шифо бергинки, Сенинг бир душманингга зиён етказсин ёхуд\n" +
                "Сенинг ризолигингга эришмоқ учун намоз ўқишга юриб борсин».\n" +
                "Бисмилл`аҳи арқ`ика мин кулли шай’ин йу’зика мин шарри кулли нафсин ав ъайну\n" +
                "ҳ`асид`ийн. Алл`оҳумма йашф`ийка, бисмилл`аҳи арқ`ика.\n" +
                "«Сенга изтироб берувчи ҳамма нарсадан, ҳар ҳасадгўй нафсдан ёхуд кўздан Аллоҳнинг номи\n" +
                "ила сенга шифо сўрайман. Аллоҳ номи ила сенга шифо сўрайман» (Термизий. «Жаноиз», 972-\n" +
                "ҳадис).\n" +
                "Никоҳ кечасида ўқиладиган дуо\n" +
                "Икки ракат намоз ўқиб, Аллоҳдан масъуд бўлишларини сўраб, дуо қилгач, «Бисмиллаҳ...»\n" +
                "айтиб «Рoббaн`а ҳаблан`а мин азв`ажин`а ва зуррийй`атин`а қуррота аъй`унин ва’жъалн`а\n" +
                "лил-муттақ`ийна им`aма». \n" +
                "Мен ҳам намоз ўқийман\n" +
                "www.ziyouz.com кутубхонаси 33\n" +
                "«Парвардигоро, хотинларимиздан ва зурриётларимиздан бизларга кўз қувончини бахш эт ва\n" +
                "бизларни тақводорларга пешво қилгин» (Фурқон сураси, 74-оят) оятини ўқиб, завжаси билан\n" +
                "бирга бўлишдан олдин «Бисмилл`аҳир роҳ-м`анир роҳ`ийм. Алл`оҳумма жаннибнаш-шайт`она\n" +
                "ва жаннибиш-шайт`она м`а розақтан`а».\n" +
                "«Аллоҳим, шайтонни биздан ва бизга ато этганинг фарзанддан узоқлаштир» (Бухорий.\n" +
                "«Никоҳ», 66) дуосини ўқийди.\n" +
                "Ҳомиладор аёл ўқийдиган дуо\n" +
                "Ҳомиладор аёл тиббий муолажалардан ўтиш билан бирга диний вазифаларни адо этиши ва\n" +
                "фурсат топиши билан «Оятал курси» ва «Шарҳ» сурасини, сўнг ушбу дуони ўқиши мақбулдир:\n" +
                "«Алл`оҳумма аътин`а сиҳҳатан ва ъ`афийатан ва авл`адан с`олиҳан ва ризқон в`асиъан ва\n" +
                "дуъ`а’ан мақб`улан».\n" +
                "«Аллоҳим, бизга соғлиқ ва офият бер. Хайрли фарзандлар эҳсон эт. Мўл ризқ бер, дуоимни\n" +
                "қабул айла».\n" +
                "Кўз ёрарда ўқиладиган дуо\n" +
                "Бундай пайтда аёлнинг яқинлари унинг ёнида ёхуд қўшни хонада «Оятал курси»ни, сўнгра\n" +
                "Аъроф сурасининг 54-оятини ўқишади:\n" +
                "«Инн`а роббакумуллаз`ий холақос-сам`ав`ати вал-арзо ф`ий ситтати айй`амин суммастав`а\n" +
                "ъалал-ъарши, йуғшил-лайлан-наҳаро йатлубуҳ`у ҳас`исан ваш-шамса вал-қомаро ваннуж`ума\n" +
                "мусаххоротин би амриҳ, ал`а лаҳул-холқу вал-амру таб`арокалл`оҳу Роббулъ`алам`ийн».\n" +
                "\n" +
                "«Дарҳақиқат, Раббингиз осмонлару Ерни олти кунда яратган, сўнгра Аршга истиво қилган,\n" +
                "кундузга тунни қоплатадиган-уни (яъни, тун-кунни) шитоб қувийди – қуёш ой, юлдузларни Ўз\n" +
                "амрига мусаххар (муте) қилиб қўйган Аллоҳдир. Огоҳ бўлингизки, яратиш ва буюриш Унга\n" +
                "хосдир. Оламларнинг рабби Аллоҳ баракотлидир».\n" +
                "Бу оятдан кейин Ихлос, Фалақ, Нас суралари ва Фотиҳа ўқилади. Хайрли бир фарзанд\n" +
                "берилиши учун дуо қилинади.\n" +
                "Солиҳ фарзанднинг дуоси\n" +
                "Исломий тарбия кўрган инсон ота-онаси кексайганда, уларни хорламайди, дилларини\n" +
                "ранжитмайди. Уларнинг ҳақларига бундай дуо қилади:\n" +
                "Роббир-хамҳум`а кам`а роббай`аний соғ`ийро.\n" +
                "«Парвардигоро, ота-онамга марҳамат эт, улар мени марҳамат-ла вояга етказганлари каби»\n" +
                "(Таҳрим, 8).\n" +
                "Масжидга кираётганда...\n" +
                "Алл`оҳумма-афтаҳ л`и абв`аба роҳматик.\n" +
                "«Аллоҳим, менга раҳмат эшикларингни оч».\n" +
                "Масжиддан чиқаётганда...\n" +
                "Алл`оҳумма инн`и ас’алука мин-фазлик.\n" +
                "“Аллоҳим, Сенинг фазлинг ва карамингни сўрайман”. \n" +
                "Мен ҳам намоз ўқийман\n" +
                "www.ziyouz.com кутубхонаси 34\n" +
                "Қабр зиёратида ўқиладиган дуо\n" +
                "Ассал`аму ъалайкум й`а аҳлал-қуб`ур. Яғфирулл`оҳу лан`а ва лакум, антум салафун`а ва\n" +
                "наҳну бил-исри.\n" +
                "«Ассалому алайкум, эй қабр аҳли. Аллоҳ бизни ва сизларни мағфират этсин. Сизлар биздан\n" +
                "олдин келганлардансиз, биз ҳам сизларнинг орқаларингиздан келамиз».\n" +
                "Ҳожатхонага киришдан олдин...\n" +
                "Алл`оҳумма инн`ий аъ`узу бика минар-рижсил-хоб`исил-мухбиси минаш-шайт`ониррож`ийм.\n" +
                "\n" +
                "«Аллоҳим, ифлос ва ёмон нарсалар билан қувилган шайтоннинг ёмонлигидан Сенинг\n" +
                "паноҳингга қочаман».\n" +
                "Ҳожатхонадан чиққанда...\n" +
                "Алҳамдулилл`аҳиллаз`ий азҳаба анний м`а-йуъз`ин`и ва амса-ка ъалаййа м`а йанфаун`ий\n" +
                "субҳ`анака ғуфр`онака роббан`а ва илайкал-мас`ийр.\n" +
                "«Мендан азият берувчи нарсани кетказиб, фойдалисини қолдирган Аллоҳга ҳамд бўлсин.\n" +
                "Аллоҳим, Сени номингни поклаб ёд этаман ва мағфиратингни сўрайман. Эй Роббимиз,\n" +
                "қайтишимиз Сенгадир».\n" +
                "Уйдан чиқаётганда...\n" +
                "Бисмилл`аҳи тавакалту ъалалл`оҳи, ва л`а ҳавла ва л`а қуввата илл`а билл`аҳ.\n" +
                "«Аллоҳ номи ила, Аллоҳга таваккал қилган ҳолда... Куч ва қувват фақат Аллоҳдандир» (Абу\n" +
                "Довуд. «Адаб», 5094-ҳадис).\n" +
                "Уйга кираётганда...\n" +
                "Алл`оҳумма инн`ий ас’алука хойрол-мавлажи ва хойрол-махрожи бисмилл`аҳи ва лижн`а ва\n" +
                "бисмилл`аҳи хорожн`а ва ъалалл`оҳи Роббан`а таваккалн`а.\n" +
                "«Аллоҳим, Сендан кираётганим ва чиқаётганим жойларнинг яхшисини сўрайман. Аллоҳнинг\n" +
                "номи ила кирдик. Аллоҳнинг номи ила чиқдик. Роббимиз Аллоҳга таваккул этдик».\n" +
                "Уйқуда қўрққан кишининг дуоси\n" +
                "Аъ`узу би-калиматилл`аҳит-та`аммати мин-ғозабиҳ`и ва шарри ъиб`адиҳ`и ва мин\n" +
                "ҳамаз`атиш-шай`ат`ийни ва ан йахзур`ун.\n" +
                "«Аллоҳнинг ғазабидан, қулларининг ёмонлигидан, шайтонларнинг ҳар турли ёмонлигидан\n" +
                "Аллоҳнинг барча калималарига юкинаман» (Абу Довуд. «Тиб», 3893-ҳадис).\n" +
                "Дастурхон дуоси\n" +
                "Алҳамдулилл`аҳиллаз`ий атъаман`а ва сақ`она важаъалан`а минал-муслим`ийн.\n" +
                "«Бизни едириб-ичирган ва мусулмонлардан қилган Аллоҳга ҳамд бўлсин».\n" +
                "Фарзанд тилаш дуоси\n" +
                "Мен ҳам намоз ўқийман\n" +
                "www.ziyouz.com кутубхонаси 35\n" +
                "Робб`и л`а тазарни фардав ва анта хойрул в`арис`ийн.\n" +
                "«Парвардигорим! Мени (вориссиз) ёлғиз қолдирма. (Агар ворис бермасанг ҳам) Сенинг Ўзинг\n" +
                "ворисларнинг энг яхшисисан» (Анбиё, 89).\n" +
                "Ғазабланганда ўқиладиган дуо\n" +
                "Алл`оҳуммағфир л`ий занб`ий ва азҳаб ғойзо қолб`ий ва ажирн`ий минаш-шайт`ониррож`ийм.\n" +
                "\n" +
                "Аллоҳим, гуноҳларимни кечир, қалбимнинг ҳиддатини (ғазабини, алангасини) кетказ ва мени\n" +
                "шайтоннинг ёмонлигидан асра.\n" +
                "Шунда ҳам ғазаб кетмаса, имкон топилса, таҳорат олиб икки ракат намоз ўқиш, «Алам\n" +
                "нашроҳ лака...» сурасини тиловат қилиш ва юқоридаги дуони такрорлаш лозим.\n" +
                "Уй сотиб олиб, жойлашгач ўқиладиган дуо\n" +
                "Таҳорат олиб икки ракат намоз ўқилади ва: «Алҳамдулилл`аҳи роббил ъ`алам`ийн. Вассол`ату\n" +
                "вас-сал`аму ъал`а ра-с`улина Муҳаммадин ва ъал`а `алиҳ`и ва саҳбиҳ`и ажмаъ`ийн.\n" +
                "Аъ`узу билл`аҳи минаш-шайт`онир-рож`ийм. Бисмилл`аҳир роҳманир роҳ`ийм. Ла ин\n" +
                "шакартум ла аз`ийданнакум ва лаин кафартум инна аз`аб`ий лашад`ийд», дегач, қуйидагича\n" +
                "дуо қилинади:\n" +
                "Аллоҳим, менга оилам билан бирга яшаладиган бир маскан насиб этдинг, Сенга шукрлар\n" +
                "бўлсин. Мени ва оиламни бу уйда масъуд ва бахтиёр айла. Бизни ҳар турли бало-қазолардан,\n" +
                "фалокатлардан сақла. Аллоҳим, биз ожиз бандалармиз. Бу уй гуноҳлар эмас, балки фақат\n" +
                "хайрли ва гўзал ишлар ҳақида гапириладиган ва эзгу амаллар бажариладиган жой бўлсин.\n" +
                "Раббим, қўшниларимга азият етказишдан мени асра. Яхши қўшнилар насиб эт. Аллоҳим, Сенга\n" +
                "ҳамду сано, суюкли Пайғамбарингга салоту саломлар бўлсин.\n" +
                "Кўз тегишга қарши ўқиладиган дуо\n" +
                "Кўз тегишига қарши Фотиҳа сураси ва «Оятал курси»дан сўнг ушбу оятлар ўқилади:\n" +
                "Бисмилл`аҳир роҳм`анир роҳ`ийм. Ва ин йак`адуллаз`ийна кафар`у лайузлиқ`унака би\n" +
                "абс`ориҳим ламм`а самиъуззикро ва йақ`ул`уна иннаҳ`у ламажн`ун. Ва м`а ҳува илл`а\n" +
                "зикрул-лил-ъ`алам`ийн.\n" +
                "«Албатта, кофир кимсалар Зикрни (Қуръонни) эшитган вақтларида, Сизни кўзлари билан\n" +
                "йиқитаёзурлар ва «албатта, у мажнун», дерлар. Ҳолбуки, у (Қуръон барча) оламлар учун\n" +
                "эслатмадир» (Қалам,51–52).\n" +
                "Садақа бераётганда...\n" +
                "Роббан`а тақоббал минн`а иннака антас-сам`иъул ъал`ийм.\n" +
                "«Эй Роббимиз, биздан уни қабул айла, чунки Сен эшитгувчи ва билгувчисан».\n" +
                "Аксирган кишига айтиладиган дуо\n" +
                "Аксирган киши, ёнида бирор одам бўлса ҳам, бўлмаса ҳам, «Алҳамдулилл`аҳ» дейди.\n" +
                "Жаноби Пайғамбаримиз (с.а.в.) аксирган кишига ёнидагиларнинг «Ярҳамукалл`оҳ» (Аллоҳ\n" +
                "сенга раҳмат этсин) дейишини тавсия қилганлар. Акса урган киши эса «Ярҳамукалл`оҳу ва\n" +
                "ийй`акум ва йағфиру лан`а ва лакум» (Аллоҳ бизга ҳам, сизга ҳам раҳмат айласин, бизни ҳам, \n" +
                "Мен ҳам намоз ўқийман\n" +
                "www.ziyouz.com кутубхонаси 36\n" +
                "сизни ҳам афу этсин) ёхуд «Яҳд`ина ва йаҳд`ийкумулл`оҳ» (Аллоҳ бизни ҳам, сизни ҳам\n" +
                "ҳидоятга бошласин) дейди.\n" +
                "Ҳилол (янги ой) кўринганида...\n" +
                "Талҳа ибн Убайдуллоҳдан (р.а.) ривоят қилинишича, Жаноби Пайғамбаримиз (с.а.в.) янги\n" +
                "ойни кўрганларида бундай дуони ўқиганлар: Алл`оҳумма аҳиллаҳу ъалайн`а бил-йумни валийм`ани\n" +
                "вас-сал`амати вал-исл`ам, робб`ий ва роббукалл`оҳ.\n" +
                "Аллоҳим, бу ойни бизга қутлуғ ва баракотли бир ой айла. Имон, саломат ва Ислом-ла лиқ\n" +
                "тўлиб безанган кечаларда чиқсин. Эй ҳилол! Сенинг ҳам, менинг ҳам Раббимиз Аллоҳдир\n" +
                "(Термизий. «Даъват», 3677-ҳадис).\n" +
                "Уловга минилаётганда ўқиладиган дуо\n" +
                "«Оятал курси» ўқилгач, «Субҳ`аналлаз`ий саххоро лан`а ҳ`аз`а ва м`а кунн`а лаҳ`у\n" +
                "муқрин`ийн. Ва инн`а ил`а роббин`а ламун-қолиб`ун. Бисмилл`аҳи мажр`оҳа ва мурс`оҳа.\n" +
                "Инна роббий ла Ғоф`урур-Роҳ`ийм» дейилади.\n" +
                "Давомида қуйидагича дуо айтилса ҳам бўлади: Аллоҳим, Сенинг номинг билан йўлга\n" +
                "чиқмоқдаман. Менга соғлиқ ва ҳалол касб насиб этганинг учун Сенга шукрлар айтаман. Йўл\n" +
                "давомида мени ва уловимга минган йўловчиларни бало-қазолардан, ҳар турлик хавфу\n" +
                "хатарлардан Ўзинг асра, ёрдамингни дариғ тутма биздан, ё Раббий. Биз қанчалар гуноҳкор\n" +
                "бўлмайлик, Сен бизни мағфират эт. Манзилимизга эсон-омон етиб боришни насиб айла.\n" +
                "Фарзандларимизни етим қолдирма, Парвардигоро. Қайтишимизда оиламизни ғам-андуҳсиз\n" +
                "кўрмоқни лутф айла. Сен ҳамма нарсага қодир Зотсан, Аллоҳим.\n" +
                "Фаришталарнинг мўминларга дуоси\n" +
                "Аршни кўтариб турган ва унинг атрофидаги фаришталар мўминлар ҳақига бундай дуо\n" +
                "қилишади: Роббан`а васиъта кулла шайъин роҳматан ва ъилман фағфир лиллаз`ийна т`аб`у\n" +
                "ваттабаъ`у саб`ийлака вақ`иҳим аз`абал-жаҳ`ийм. Роббан`а ва адхил-ҳум жанн`ати\n" +
                "ъадниниллат`ий ва адтаҳум ва ман солаҳа мин `аб`аиҳим ва азв`ажиҳим ва зуррий`атиҳим\n" +
                "иннака антал аз`изул ҳак`ийм. Вақ`иҳимус-саййи`ати, ва ман тақис-саййи`ати, йавмаизин\n" +
                "фақод роҳимтаҳ ва з`алика ҳувал фавзул ъаз`ийм.\n" +
                "«Парвардигоро, Ўзинг раҳмат ва илм жиҳатдан барча нарсада кенгдирсан. Бас, тавба қилган\n" +
                "ва йўлингга эргашган кишиларни мағфират эт ва уларни дўзах азобидан сақла. Парвардигоро,\n" +
                "уларни ҳам, уларнинг ота-боболари, жуфти ҳалоллари ва зурриётлари орасидаги солиҳ бўлган\n" +
                "кишиларни ҳам Ўзинг уларга ваъда қилган мангу жаннатларга дохил қилгин. Албатта, Сен\n" +
                "қудрат ва ҳикмат соҳибидирсан» (Мўмин сураси,7-9).\n" +
                "Дўкон ёхуд ишхонани очаётганда...\n" +
                "Алл`оҳумма й`а муфаттиҳал-абв`аб, ифтаҳ лан`а хойрил-б`аб. Алл`оҳуммарзуқн`а ризқан\n" +
                "ҳал`алан тоййибан, ва ризқон в`асиан бироҳматика й`а Арҳамар –Р`оҳим`ийн, ва Анта\n" +
                "хойрур-Р`озиқ`ийн.\n" +
                "Эй эшикларни очувчи Аллоҳим! Бизга хайрли эшикларни оч. Аллоҳим! Бизга ҳалол ва тоза\n" +
                "ризқлар эҳсон айла, ризқимизни кенгайтир, эй марҳаматлиларнинг марҳаматлиси! Ризқ\n" +
                "бергувчиларнинг энг хайрлиси Сенсан! \n" +
                "Мен ҳам намоз ўқийман\n" +
                "www.ziyouz.com кутубхонаси 37\n" +
                "Камбағалликдан қутулиш дуоси\n" +
                "Бисмилл`аҳи ъал`а нафс`и ва м`ал`и ва д`ин`и. Алл`оҳумма роззини би қоз`оика ва\n" +
                "б`арик л`и ф`им`а қуддиро л`и ҳатт`а л`а уҳибба таъж`ил`а м`а аххарта ва л`а таъх`ира\n" +
                "м`а ажжалта.\n" +
                "Ўзим, молим ва диним хусусида Аллоҳ номи билан (сўрайман). Аллоҳим, қазо ва ҳукмингга\n" +
                "мени рози қил, менга тақдир этганинг нарсаларни баракатли эт. Шундай бўлсинки, кейинга\n" +
                "қолдирганингни ҳозир, ҳозир берадиганингни кейин сўраб юрмайин («Ал-азкор», 116-бет).\n" +
                "Дарс тайёрлашда ёки имтиҳонга киришда ўқиладиган дуо\n" +
                "(Таҳоратли ҳолда дарс тайёрлаган яхши. Дуолар «`Бисмиллоҳ...»дан сўнг ўқилади.)\n" +
                "Робби зидн`и ъилман ва фаҳман вал-ҳиқн`и бис-с`олиҳ`ин. Роббишроҳ л`и содри ва йассир\n" +
                "л`и амр`и ваҳлул ъуқдатан мин лис`ани йафқоҳ`у қовли й`а Ҳ`афиз, й`а Роқ`иб, й`а Н`асир,\n" +
                "й`а Алл`оҳ. Робби йассир ва л`а туъассир. Робби таммим бил-хойри.\n" +
                "Раббим! Илмимни ва зеҳнимни орттир ва мени солиҳ бандаларинг қаторига қўш.\n" +
                "Раббим! Кўксимни оч, ишимни осон айла ва тилимнинг тугунини ечгин, сўзимни\n" +
                "тушунсинлар. Ў Ҳофиз, ё Роқиб, ё Носир, ё Аллоҳ.\n" +
                "Раббим! Осон қилгин, қийин қилма. Раббим, (ишимни) яхшилик билан тугатгин.\n" +
                "(Имтиҳонга киришдан олдин уч, беш ёки етти марта `Оятал курси” ўқилади.)\n" +
                "Сафар дуоси\n" +
                "Алл`оҳумма илайка таважжаҳту ва бика иътасомту. Алл`оҳумма акфин`и м`а аҳамман`и ва\n" +
                "м`а л`а аҳтамту лаҳ`у.\n" +
                "Алл`оҳумма заввиднит-тақв`а, вағфирл`и занб`и ва важжиҳн`и лил-хойри айна м`а\n" +
                "таважжаҳту.\n" +
                "Аллоҳим, Сен томон интилдим. Сенга юкиндим. Аллоҳим, мени андишалантирган ёхуд\n" +
                "андишалантирмаган хусусларда Сен менга кифоя қил. Тақвони менга озуқа қил, Аллоҳим!\n" +
                "Гуноҳимни кечир ва қаерга бормайин, мени доимо яхшиликка бошла, ё Раббий.\n" +
                "(Пайғамбаримиз, соллаллоҳу алайҳи ва саллам, ҳар гал йўлга чиққанда ушбу дуони ўқир\n" +
                "эдилар.) («Ал-азкор», 195-бет).\n" +
                "Бисмилл`аҳир роҳм`анир роҳ`ийм. Субҳ`аналлаз`ий саххора лан`а ҳ`аз`а ва м`а кунна\n" +
                "лаҳ`у муқрин`ийн. Ва инн`а ил`а Роббин`а ла мунқолиб`ун.\n" +
                "«Бу уловларни бизнинг хизматимизга берган Аллоҳ буюкдир. У барча айбу нуқсонлардан\n" +
                "муназзаҳдир. Йўқса, бизнинг буларга кучимиз етмас эди» ояти ўқилади ва уч марта\n" +
                "«Алҳамдулиллаҳ» ва уч марта «Аллоҳу акбар» дегач:\n" +
                "Субҳ`анака инн`и золамту нафс`и фағфирл`и, иннаҳ`у л`а йағфируз-зун`уба илл`а Анта.\n" +
                "Аллоҳни айбу нуқсонлардан поклаб ёд этаман, мен ўз нафсимга зулм қилдим. Аллоҳим!\n" +
                "Мени кечир. Чунки Сендан бошқа кечиргувчи йўқ («Аз-азкор», 145-бет).\n" +
                "Ўлим хабарини эшитганда ўқиладиган дуо\n" +
                "Инн`а лилл`аҳи ва инн`а илайҳи р`ожиъ`ун. Алл`оҳуммактубҳ`у фил-муҳсин`ийна важъал\n" +
                "кит`абаҳ`у ф`ий иллийй`ин. Вахлуфҳу ъал`а ъақобиҳ`и фил-ғ`обир`ин. Алл`оҳумма л`а\n" +
                "туҳарримн`а ажроҳ`у вал`а тафтинн`а баъдаҳ`у вағфир лан`а ва лаҳ.\n" +
                "Бизни Аллоҳ келтирди, яна Унга қайтамиз ва албатта Раббимизга қовушамиз. Аллоҳим!\n" +
                "Уни(маййитни) даргоҳингдаги яхши кишилар қаторига ёз, китобини фазилатлиларникидан\n" +
                "айла. Ортда қолганларига кафил бўл. \n" +
                "Мен ҳам намоз ўқийман\n" +
                "www.ziyouz.com кутубхонаси 38\n" +
                "Аллоҳим! Бизни унинг ажридан маҳрум этма. Ундан ке-йин бизни фитнага йўлиқтирма, бизни\n" +
                "ва уни афв эт.\n" +
                "САЛОВОТЛАР\n" +
                "Салоти мунжийа\n" +
                "Алл`оҳумма солли ъал`а саййидин`а Муҳаммадин ва ъал`а `али саййидин`а Муҳаммад,\n" +
                "сал`атан тунж`ин`а биҳ`а мин-жамиъил аҳв`али вал `аф`ат. Ва тақз`и лан`а биҳ`а жамиъал\n" +
                "ҳ`аж`ат ва тутоҳҳирун`а биҳ`а мин-жамиъис-саййи`ат. Ва тарфа-ъун`а биҳ`а ъалад-дарож`ат\n" +
                "ва тубаллиғун`а биҳ`а ақсол-ғ`ой`оти, мин-жамиъил хойр`оти фил-ҳай`ати ва баъдал мам`ат.\n" +
                "Аллоҳим! Жаноби Пайғамбаримиз Муҳаммад Мустафога беадад салот ва салом бўлсин. Бу\n" +
                "салотлар, саломлар ва дуолар бизни ҳар турли бало ва мусибатлардан халос этсин, барча\n" +
                "эҳтиёжларимизни кеткизиб, бизни гуноҳлардан покласин. Бизни юксак даража ва мартабаларга\n" +
                "кўтарсин. Аллоҳим! Бу салот ва саломлар туфайли ўлгандан ке-йин хайр (яхшилик)ларга ноил\n" +
                "бўлайлик.\n" +
                "Салоти фатҳиййа\n" +
                "Алл`оҳумма солли ва саллим ва б`арик ъал`а саййидин`а Муҳаммадинил-ф`атиҳи лим`а\n" +
                "уғлиқо вал-х`отими лим`а сабақо, Н`асирил-ҳаққи билҳаққи, вал ҳ`ад`и ил`а сир`отикалмустақ`им\n" +
                "ва ъал`а `алиҳ`и ҳаққо қадриҳ`и ва миқд`ариҳил-ъаз`ийм.\n" +
                "Аллоҳим! Суюкли Пайғамбаримиз Муҳаммад Мустафога салот ва саломлар бўлсин. Бизга\n" +
                "Сенинг яширин хазиналарингни очиб берган Удир. Пайғамбарлар ҳалқасининг охири Удир,\n" +
                "Ҳақнинг энг катта ёрдамчиси Удир, инсонларга тўғри йўлни кўрсатган Удир! Унга ва\n" +
                "яқинларига сўнгсиз салот ва саломлар бўлсин.\n" +
                "Бошқа бир саловот\n" +
                "Алл`оҳумма солли ъал`а саййидин`а Муҳаммадинин-набиййил-уммиййи ва ъал`а `алиҳи ва\n" +
                "саҳбиҳ`и ва саллим.\n" +
                "Саййидул истиғфор\n" +
                "(Ривоят қилинишича, истиғфорларнинг энг афзали ушбудир):\n" +
                "Алл`оҳумма анта Робб`и ва ан`а ъабдука, холақтан`и ва ан`а ъал`а ъаҳдика ва ваъдика\n" +
                "мастатоъту, аъ`узу мин шарри м`а сонаъту аб`уъу лака биниъматика ъаллаййа ва аб`уъу\n" +
                "ъал`а нафс`и би занб`и, фақод золамту нафс`и ваътарофту би занб`и, фағфирл`и зун`уб`и,\n" +
                "м`а қоддамту минҳ`а ва м`а аххорту, фа иннаҳ`у л`а йағфируз-зун`уба илл`а ант.\n" +
                "Аллоҳим! Сен менинг Раббимсан! Мен эса Сенинг қулингман. Мени Сен яратдинг. Мен кучим\n" +
                "етгунча Сенга берган аҳд ва ваъдамда собитман. Биламан, берган неъматларингга муқобил\n" +
                "(шукр қилишда) нуқсонга йўл қўйдим, нафсимга зулм қилдим. Гуноҳларимни тан оламан,\n" +
                "ўтмиш ва келгуси гуноҳларимни кечиришингни Ўзингдан сўрайман. Мени кечиргин, Аллоҳим!\n" +
                "Сендан ўзга кечиргувчи йўқдир (Термизий. «Даъват», 3393-ҳадис).\n" +
                "Яна бир истиғфор дуоси\n" +
                "Астағфирулл`оҳ, астағфирулл`оҳ, астағфирулл`оҳ ал-ъаз`ийм, ал-Кар`ийм, аллаз`ий л`а\n" +
                "ил`аҳа илл`а ҳ`у, ал-Ҳаййул-Қойй`ум ва нат`убу илайҳ ва насъалуҳут-тавбата вал-мағфирота\n" +
                "Мен ҳам намоз ўқийман\n" +
                "www.ziyouz.com кутубхонаси 39\n" +
                "вал-ҳид`айата лан`а иннаҳ`у ҳуват-тавв`абур-роҳ`ийм. Тавбата ъабдин з`олимин линафсиҳ`и\n" +
                "л`а йамлику линафсиҳ`и мавтан вал`а ҳай`атан вал`а нуш`уро.\n" +
                "Улуғ Аллоҳдан мағфират сўрайман!\n" +
                "Азим ва Карим бўлган, Ўзидан бошқа ҳеч бир илоҳ бўлмаган, Ҳайй ва Қаййум бўлган\n" +
                "Аллоҳдан мағфират сўрайман. Унга қайтамиз. Тавбамизни қабул этиб, мағфират ва ҳидоят\n" +
                "насиб қилишини тилаймиз, чунки У тавбаларни қабул қилгувчи, раҳмли, меҳрибондир. Нафсига\n" +
                "зулм (ҳақсизлик) қилган, ўлдириш ёки қайта тирилтиришга ва (Қиёмат куни) тўплашга ожиз\n" +
                "бўлган банданинг тавбаси каби тавба қиламиз.\n" +
                "Намоздан сўнг ўқиладиган бошқа дуолар\n" +
                "Л`а ил`аҳа иллалл`оҳу ваҳдаҳ`у л`а шар`ийка лаҳ, лаҳул-мулку ва лаҳул ҳамд ва ҳува\n" +
                "ъал`а кулли шайъ`ин қод`ийр. Алл`оҳумма л`а маниаъ лим`а аътойта ва л`а муътийа лим`а\n" +
                "манаъта ва л`а йанфаъу зал-жадди минкал-жадд.\n" +
                "Аллоҳдан бошқа илоҳ йўқ. Унинг тенги ва шериги йўқ. Мулк Уникидир. Ҳамд Унгадир. У ҳар\n" +
                "нарсага қодирдир. Аллоҳим! Сенинг берганингга монелик қилувчи ҳеч нарса йўқ.\n" +
                "Бермаганингни берадиган ҳеч кимса йўқдир. Мол-дунё эгасининг мол-дунёси Сенинг эҳсонинг\n" +
                "ўрнига ўтиб, унга фойда бермайди (Муслим. «Масажид», 137).\n" +
                "* * *\n" +
                "Алҳамдулилл`аҳи роббил `аълам`ийн. Вал-`ақибату лил-муттақ`ийн, ва л`а удв`ана илл`а\n" +
                "ъалаз-з`олим`ийн. Вассол`ату вас-сал`аму ъал`а рас`улина Муҳаммадин ва ъал`а `алиҳ`и ва\n" +
                "асҳ`абиҳ`и ажма`ийн.\n" +
                "Алл`оҳумма роббан`а, й`а роббан`а тақоббал минн`а сол`атан`а ва қий`аман`а ва\n" +
                "рукуъан`а ва таҳл`илан`а ва тазарруъан`а ва таммим тақс`иран`а ва л`а тазриб биҳ`а\n" +
                "вуж`уҳан`а й`а Мавл`ан`а.\n" +
                "Алл`оҳумма `атин`а сиҳҳатан ва ъ`афийатан ва саъ`адатан ва рифқон ва авл`адан\n" +
                "с`олиҳан ва ъилман н`афи-ъан ва ризқон в`аси-ъан ва ъамалан мақб`улан, й`а арҳамарр`оҳим`ийн.\n" +
                "Роббанағфирл`и валив`алидайй`а валил-муъмин`ийна явма яқ`умул-ҳис`аб.\n" +
                "Ҳамду сано оламларнинг Рабби Аллоҳга хосдир (Унга ҳамд бўлсин). Тақво эгалари учун\n" +
                "гўзал бир оқибат, золимлар учун эса душманлик ва қўрқувдан бошқа нарса йўқ. Жаноби\n" +
                "Пайғамбаримиз Муҳаммад Мустафога, ул зотнинг яқинлари ва саҳобаларига салот ва салом\n" +
                "бўлсин.\n" +
                "Аллоҳим! Эй Раббимиз! Намозимизни, қиёмимизни, рукуларимизни, саждаларимизни,\n" +
                "ўтиришларимизни, тазарру ва ниёзларимизни қабул айла. Нуқсон-камчиликларимизни Сен\n" +
                "мукаммал қилгин. Эй Мавломиз! Камчиликларимизни юзимизга урма.\n" +
                "Аллоҳим! Бизга соғлиқ ва офият, бахт ва ширин ҳаёт ва гўзаллик бер, хайрли фарзандлар\n" +
                "насиб эт. Ў Раббим! Бизга фойдали илм, мўл ризқ ва мақбул амаллар насиб айла. Эй\n" +
                "марҳаматлиларнинг энг марҳаматлиси бўлган Аллоҳим.\n" +
                "Эй Роббим! Мени, ота-онамни ва барча мўминларни кечир, бизни жаҳаннам азобидан асра. \n" +
                "Мен ҳам намоз ўқийман\n" +
                "www.ziyouz.com кутубхонаси 40\n" +
                "ҚУРЪОНИ КАРИМДАН ОЯТЛАР\n" +
                "Бақара сурасидан\n" +
                "Бисмиллаҳир роҳманир роҳийм.\n" +
                "`Аманар-рос`улу бим`а унзила илайҳи мирроббиҳ`и вал-муъмин`ун. Куллун `амана\n" +
                "билл`аҳи ва мал`а’икатиҳ`и ва кутубиҳ`и ва русулиҳ. Л`а нуфарриқу байна аҳадим-миррусулиҳ.\n" +
                "Ва қ`ол`у самеън`а ва атоън`а, ғуфр`онака, роббан`а ва илайкал мас`ийр.\n" +
                "Л`а йукаллифулл`оҳу нафсан илл`а вусъ`аҳа. Лаҳ`а м`а касабат ва ъалайҳ`а мак-тасабат.\n" +
                "Роббан`а л`а ту`ахизн`а ин-нас`ийн`а ав ахтоън`а, Роббан`а вал`а таҳмил ъалайн`а исрон\n" +
                "кам`а ҳамалтаҳ`у ъалал-лаз`ийна мин қоблин`а, Роббан`а вал`а туҳаммилн`а м`а л`а\n" +
                "т`оқота лан`а биҳ. Ваъфу ъанн`а, вағфир лан`а, варҳамн`а. А`нта Мавл`ан`а фансурн`а\n" +
                "ъалал қовмил к`афир`ийн.\n" +
                "Ҳашр сурасидан\n" +
                "Бисмилл`аҳир роҳм`анир роҳ`ийм.\n" +
                "Лав анзалн`а ҳ`азал Қуръ`ана ъал`а жабалин лароайтаҳ`у х`оши-ъан мутасоддиъан мин\n" +
                "хошйатилл`аҳ ва тилкал амс`алу назрибуҳ`а лин-н`аси ла-ъаллаҳум йатафаккар`ун.\n" +
                "Ҳувалл`оҳуллаз`и л`а ил`аҳа илл`а ҳ`у, ъ`алимул-ғойби ваш-шаҳ`адаҳ, ҳувар-роҳм`анурроҳ`ийм.\n" +
                "Ҳувалл`оҳуллаз`ий л`а ил`аҳа илл`а ҳ`у, ал-маликул-қудд`усус-сал`амул-муъминулмуҳайминул-ъаз`изул-жабб`арул-мутакаббир.\n" +
                "Субҳ`аналл`оҳи ъамм`а йушрик`ун.\n" +
                "Ҳувалл`оҳул-х`олиқул б`ари-ъул-мусоввиру лаҳул асм`а-ъул ҳусн`а, йусаббиҳ`у лаҳ`у м`а\n" +
                "фис-сам`ав`ати вал-арз, ва ҳувал ъаз`изул-ҳак`ийм.\n" +
                "«Бақара» ва «Ҳашр» сураларининг бу сўнгги оятларини намоздан сўнг тиловат қилинса,\n" +
                "савоби улуғ бўлиши ҳадиси шарифларда марҳамат қилинган. \n" +
                "Мен ҳам намоз ўқийман\n" +
                "www.ziyouz.com кутубхонаси 41\n" +
                "ҚУРЪОН ОЯТЛАРИГА\n" +
                " ШЕЪРИЙ ТАФСИР\n" +
                "Ҳамд бўлсин Аллоҳга, ҳамд бўлсин ҳар он,\n" +
                "Унинг ҳукмидадир само ва замин.\n" +
                "Мақтовга лойиқ зот Удир ҳар замон:\n" +
                "Алҳамдулилл`аҳи Роббил `аълам`ийн.\n" +
                "Аллоҳ айтганидай ажралар ҳиссанг,\n" +
                "Шубҳасиз, бу қулга буюк мукофот.\n" +
                "Намоз қил, закот бер мусулмон бўлсанг:\n" +
                "Ва ақимус-сол`ата ва `атуз-зак`ат...\n" +
                "Кофир бир азобга бўлади асир,\n" +
                "Эй мусулмон қуллар, буни-да билинг.\n" +
                "Аллоҳнинг лаънати кофирларгадир:\n" +
                "Фалаънатулл`оҳи ъалал к`афир`ийн...\n" +
                "Инсонлар ўйлашда, ҳаракатда ҳур,\n" +
                "Ҳаракатингизда тамкинли бўлинг.\n" +
                "Аллоҳ сиз бажарган ҳар ишни кўрур:\n" +
                "Валл`оҳу бас`ийрун бим`а йаъмал`ун...\n" +
                "Унинг қудратидан тупроқ ва само,\n" +
                "Ирода Ундадир, У бергай амр.\n" +
                "У ҳар ишга қодир, амир доимо:\n" +
                "Валл`оҳу ъал`а кулли шайъин қод`ийр...\n" +
                "Ҳар он тилда ва дилда,\n" +
                "Мусулмон шиори шу:\n" +
                "Илоҳ йўқ Ундан бошқа —\n" +
                "Л`а ил`аҳа илл`а ҳ`у...\n" +
                "Иймон нури сизга йўлни кўрсатур,\n" +
                "Ҳақиқат йўлини танла-да, боргин.\n" +
                "Тўғри йўлдан кетган қулларни билур:\n" +
                "Ва ҳува аъламу бил муҳтад`ийн...\n" +
                "Роббинг неъматини совурма, инсон,\n" +
                "Сени исроф чоҳига тортмасин кайфинг.\n" +
                "У исрофгарларни ёқтирмас мудом:\n" +
                "Иннаҳ`у л`а йуҳиббул мусриф`ийн...\n" +
                "Тилагинг бўлса гар, Аллоҳдан тила,\n" +
                "Йўқса ишинг сўнги албатта ваҳим.\n" +
                "Ҳар ишни бошлагин Аллоҳ номи-ла:\n" +
                "Бисмилл`аҳир роҳм`анир роҳ`ийм...\n" +
                "Ҳақнинг ҳузурида ким у қувватли, \n" +
                "Мен ҳам намоз ўқийман\n" +
                "www.ziyouz.com кутубхонаси 42\n" +
                "Жами инсонларга ҳисоб бор, ҳисоб.\n" +
                "Аллоҳнинг азоби, бил, кўп шиддатли:\n" +
                "Ва инналл\n" +
                "`оҳа шад\n" +
                "`идул аз\n" +
                "`аб...\n" +
                "Мусулмон бекорга урмас ва сўкмас,\n" +
                "Кимсани эзмоққа қидирмас айбин.\n" +
                "Шубҳа йўқки, Аллоҳ золимни суймас:\n" +
                "Валл\n" +
                "`оҳу\n" +
                "л\n" +
                "`\n" +
                "а йуҳиббуз\n" +
                "-\n" +
                "з\n" +
                "`олим\n" +
                "`ийн...\n" +
                "Сабр этган доимо муродга етар,\n" +
                "Эй мўминлар, сиз ҳам муродга етинг.\n" +
                "Аллоҳ ҳам сабрли қулларни севар:\n" +
                "Валл\n" +
                "`оҳу йуҳиббус\n" +
                "-\n" +
                "с\n" +
                "`обир\n" +
                "`ийн...\n" +
                "Тўғри яшамоқлик, ҳа, қийин бир иш,\n" +
                "Лек шундай яшамоқ сенга вазифа.\n" +
                "Инсон шундай ожиз яратилмиш:\n" +
                "Ва хулиқол инс\n" +
                "`ану\n" +
                "з\n" +
                "`оифа...\n" +
                "Жаҳаннам кофир\n" +
                "-ла буткул тўлади,\n" +
                "У муфлис, кофирлар,\n" +
                "ў, қандай ёнар!\n" +
                "Уларнинг ётоғи олов бўлади:\n" +
                "Ул\n" +
                "`\n" +
                "а\n" +
                "’ика маъва ҳумун\n" +
                "-\n" +
                "н\n" +
                "`ар...\n" +
                "У кундир мўминлар ишонган бир кун, У – қиёмат куни, теппангда Курси. У – бутун инсонлар тўпланажак кун:\n" +
                "Йавмун мажм\n" +
                "`уун лаҳун\n" +
                "н\n" +
                "`асу...\n" +
                "Энг тўғри ҳукмни Cен берасан, Cен,\n" +
                "Эй буюк Аллоҳим, эй буюк Роббим.\n" +
                "Ҳар нени эшитиб, ҳам кўрасан Cен:\n" +
                "Иннака антас\n" +
                "-сам\n" +
                "`иъул ъал\n" +
                "`ийм...\n" +
                "Ҳақ ҳудудидан ошма,\n" +
                "Йиқилур сўнгра бино.\n" +
                "Зинога яқинлашма:\n" +
                "Вал\n" +
                "`\n" +
                "а тақрибуз\n" +
                "-зин\n" +
                "`\n" +
                "а...\n" +
                "Бир кун албат битгай бу ҳирс, бу ҳавас,\n" +
                "Ҳаққа, ҳақиқатга айлагил хизмат.\n" +
                "Ўлимни тотгайдир албат ҳар бир нафс:\n" +
                "Куллу нафсин\n" +
                "з\n" +
                "`оиқотул\n" +
                "-мавт...\n" +
                "Унинг ҳукмидадир само ва замин,\n" +
                "Кўнглинг\n" +
                "у Холиққа шукрон\n" +
                "-ла тўлсин.\n" +
                "Оламларнинг Робби, Роббга ҳамд бўлсин:\n" +
                "Вал\n" +
                "-ҳамдулилл\n" +
                "`аҳи роббил\n" +
                "ъ\n" +
                "`алам\n" +
                "`ийн...Мен ҳам намоз ўқийман\n" +
                "www.ziyouz.com кутубхонаси 1\n" +
                "МЕН ҲАМ НАМОЗ\n" +
                "ЎҚИЙМАН\n" +
                "Масъул муҳаррирлар:\n" +
                "Абдулазиз МАНСУР,\n" +
                "Анвар ТУРСУН\n" +
                "Таҳрир ҳайъати:\n" +
                "Нуруллоҳ МУҲАММАД РАУФХОН\n" +
                "Муҳаммад ШАРИФ ЖУМАН\n" +
                "Нуриимон АБУЛҲАСАН\n" +
                "Нашрга тайёрловчи:\n" +
                "Абдуллоҳ МУРОД ХОЛМУРОД ўғли\n" +
                "Тартибловчи:\n" +
                "Қудратуллоҳ ЖУМА ўғли\n" +
                "Мусаҳҳиҳа:\n" +
                "Райҳона ХОЛБЕК қизи\n" +
                "Оятлар таржимони ва изоҳлар муаллифи\n" +
                "Абдулазиз МАНСУР\n" +
                "Тошкент\n" +
                "«Янги аср авлоди»\n" +
                "2003\n" +
                "ИСЛОМ ВА ИМОН ШАРТЛАРИ\n" +
                "Ислом тинчликка, покликка, инсонийликка, меҳр-мурувватга, ватанпарварликка, илм олишга\n" +
                "чақирувчи диндир. У инсонни икки дунё саодатига етказади.\n" +
                "Қуйидагилар Ислом динининг рукнларидир:\n" +
                "1. Имон.\n" +
                "2. Ҳар куни беш маҳал намоз ўқиш.\n" +
                "3. Рамазон ойида ўттиз кун рўза тутиш.\n" +
                "4. Закот бериш. Закот Исломда молиявий ибодатдир. Яъни бойлиги нисобга (муаййан\n" +
                "миқдорга) етган мусулмоннинг йилда бир марта ҳақдорларга закот бериши фарз.\n" +
                "5. Ҳаж қилиш. Бу амал моддий жиҳатдан қурби етадиган мусулмонларгагина фарздир.\n" +
                "Қуйидагиларга ишонган киши имонлидир:\n" +
                "1) Аллоҳга;\n" +
                "2) Аллоҳнинг фаришталарига;\n" +
                "3) Аллоҳнинг китобларига;\n" +
                "4) Аллоҳнинг пайғамбарларига;\n" +
                "5) Охират кунига; \n" +
                "Мен ҳам намоз ўқийман\n" +
                "www.ziyouz.com кутубхонаси 2\n" +
                "6) Тақдирга, яъни яхшилик ҳам, ёмонлик ҳам Аллоҳдан эканига;\n" +
                "7) Ўлимдан кейин қайта тирилмоққа.\n" +
                "ИМОН КАЛИМАЛАРИ\n" +
                "«Л`а ил`аҳа иллалл`оҳ, Муҳаммадур расул`уллоҳ».\n" +
                "Маъноси: «Аллоҳдан бошқа илоҳ йўқ, Муҳаммад Аллоҳнинг пайғамбаридир».\n" +
                "«Ашҳаду алл`'\n" +
                "а ил`аҳа иллалл`оҳ ва ашҳаду анна Муҳаммадан ъабдуҳ`у ва\n" +
                "рас`улуҳ».\n" +
                "Маъноси: «Аллоҳдан ўзга сиғиниладиган (илоҳ) йўқлигига ва Муҳаммад алайҳиссалом\n" +
                "Аллоҳнинг қули ва элчиси эканига иқрорман».\n" +
                "ТАҲОРАТ\n" +
                "Ислом дини ҳам вужуд, ҳам қалб тозалигига катта аҳамият берган бир диндир. Севикли\n" +
                "пайғамбаримиз бизга шундай насиҳат қиладилар: «Кучингиз етгунча тозаликка риоя\n" +
                "этингиз, чунки Аллоҳ таоло Ислом динини тозалик устига бино қилди. Жаннатга\n" +
                "ҳам фақат тоза бўлганлар киради» («Жомиус-сағир», 1-жилд, 133-бет).\n" +
                "Аллоҳ таоло Қуръони каримнинг Моида сураси 6-оятида шундай марҳамат қилади (мазмуни):\n" +
                "«Эй имон келтирганлар! Намоз (ўқиш) га турар экансиз, албатта, юзларингизни,\n" +
                "қўлларингизни тирсакларигача ювингизлар, бошларингизга масҳ тортингизлар ва\n" +
                "оёқларингизни (ювингизлар)!».\n" +
                "Бинобарин, динимизнинг устуни ҳисобланган намозни адо этмоқ учун албатта таҳоратли\n" +
                "бўлиш шартдир.\n" +
                "ТАҲОРАТ ОЛИШ ТАРТИБИ\n" +
                "1. Аввало, таҳорат олишга ният қилиниб, «Аъузу биллаҳи минаш-шайтонир рожийм.\n" +
                "Бисмиллаҳир роҳманир роҳийм», дейилади.\n" +
                "2. Қўллар бандигача уч марта ювилади. Бармоқда узук бўлса, қимирлатиб, остига сув\n" +
                "югуртирилади.\n" +
                "3. Ўнг қўлда сув олиниб, оғиз уч марта ғарғара қилиб чайилади ва мисвок қилинади.\n" +
                "4. Бурунга ўнг қўл билан уч марта сув тортилиб, чап қўл билан қоқиб тозаланади.\n" +
                "5. Юз уч марта ювилади.\n" +
                "6. Аввал ўнг қўл тирсаклар билан қўшиб ишқалаб ювилади.\n" +
                "7. Сўнгра чап қўл тирсаклар билан қўшиб ишқалаб ювилади.\n" +
                "8. Ҳовучга сув олиб, тўкиб ташлаб, ҳўли билан бошнинг ҳамма қисмига масх тортилади.\n" +
                "9. Кўрсаткич бармоқ билан қулоқларнинг ичи, бош бармоқлар билан эса қулоқ орқаси масх\n" +
                "қилинади.\n" +
                "10. Иккала кафтнинг орқаси билан бўйин масх қилинади.\n" +
                "11. Чап қўл билан ўнг оёқни ошиқ (тўпиқ) билан қўшиб ва бармоқлар орасини (ишқалаб) уч\n" +
                "марта ювилади.\n" +
                "12. Чап оёқ ҳам шу тарзда уч марта ювилади.\n" +
                "Тирноқларга сурилган лак, теридаги ҳар хил бўёқлар кетказилмасдан олинган таҳорат саҳиҳ\n" +
                "(ҳақиқий) ҳисобланмайди.\n" +
                "Таҳорат олаётганда гапирмаслик, эҳтиёждан ортиқ сув ишлатмаслик, уст-бошга сув\n" +
                "сачратмаслик керак.\n" +
                "\n" +
                "'\n" +
                "Устига ушбу (`-) белги қўйилган ҳарфлар чўзиб ўқилади. \n" +
                "Мен ҳам намоз ўқийман\n" +
                "www.ziyouz.com кутубхонаси 3\n" +
                "ТАҲОРАТНИ БУЗАДИГАН ҲОЛЛАР\n" +
                "1. Баданнинг бирор жойидан қон ёхуд йиринг чиқиб оқиши.\n" +
                "2. Оғиз тўлиб қусиш.\n" +
                "3. Кичик ё катта ҳожат.\n" +
                "4. Ел чиқиши.\n" +
                "5. Милк қонаб, тупурганда тупук рангининг қизил бўлиши;\n" +
                "6. Ҳушдан кетиш;\n" +
                "7. Намоз ўқиётиб, ёнидаги одам эшитадиган даражада кулиш.\n" +
                "ҒУСЛ\n" +
                "Уйқуда эҳтилом бўлиб қолинганида, жинсий алоқадан кейин ҳамда аёллар ҳайз ва нифос\n" +
                "ҳолатидан чиқишгач, ғусл (бутун баданни сув билан ишқалаб ювиш) фарздир.\n" +
                "Бундан ташқари, ҳар жума ва ҳайит намозлари олдидан ғусл қилиш суннат – Пайғамбаримиз\n" +
                "соллаллоҳу алайҳи ва саллам бажарган амаллардандир.\n" +
                "Ғуслнинг фарзлари:\n" +
                "1. Оғизга сув олиб ғарғара қилиш.\n" +
                "2. Бурунга, ачиштиргунча сув тортиш.\n" +
                "3. Бутун баданни тозалаб ювиш.\n" +
                "Ғусл қуйидаги тартибда қилинади:\n" +
                "1. «Бисмиллаҳир роҳманир роҳийм» дейилади ва ғуслга ният қилинади:\n" +
                "«Навайту ан ағтасила ғуслан минал жан`абати рафъан лил ҳадаси ва\n" +
                "истиб`аҳатан лис-сол`ати тақоррубан миналл`оҳи таъ`ала».\n" +
                "Маъноси: Нопокликни кетказиш, намоз ўқишни жоиз этиш ҳамда Аллоҳга яқинлик истаб\n" +
                "ғуслни ният қилдим.\n" +
                "2. Қўллар ювилгач, бадан маний ёхуд бошқа нопок нарсалардан тозаланади.\n" +
                "3. Белгиланган тартибда таҳорат олинади. Аввал бошга, кейин ўнг ва чап елкага сув\n" +
                "қуйилиб, бутун бадан яхшилаб ювилади. Бу ювинишда баданда игнанинг учидай қуруқ жой\n" +
                "қолса ҳам, ғусл мукаммал олинмаган ҳисобланади.\n" +
                "Ғуслга эҳтиёжманд киши оғзи ва бурнини чайиб, сўнг чўмилса ҳам, ғусл олган ҳисобига\n" +
                "ўтади.\n" +
                "ТАЯММУМ\n" +
                "Аллоҳ таоло Нисо сурасининг 43-оятида шундай марҳамат қилади (мазмуни): «Бордию\n" +
                "бетоб ё сафарда бўлсангизлар ёки сизлардан бирортангиз ҳожатхонадан чиққан\n" +
                "бўлса ёхуд хотинларингиз билан яқинлик қилган бўлсангиз-у сув топа олмасангиз,\n" +
                "покиза ер (тупроқ, тош, қум, чанг кабилар) билан таяммум қилиб, юзларингиз ва\n" +
                "қўлларингизга суртинг. Албатта, Аллоҳ афв этувчи ва кечирувчидир».\n" +
                "Таяммум қилишда таҳоратга ёки ғуслга ҳам ният қилинади. Ҳар иккисини қўшиб ният қилиш\n" +
                "ҳам мумкин.\n" +
                "Таяммум олиш тартиби қуйидагичадир:\n" +
                "1. Енгларни тирсакларигача шимариб «Таҳорат (ёки ғусл) учун таяммум олишга ният\n" +
                "қилдим», деб кўнгилдан ўтказилади.\n" +
                "2. «Аъузу биллаҳи минаш-шайтонир рожийм. Бисмиллаҳир роҳманир роҳийм», дейилади ва\n" +
                "қўллар, бармоқлари очиқ ҳолда, тупроқ ёки тупроқ жинсидан бўлган бирор нарсага бир марта\n" +
                "урилади.\n" +
                "3. Қўлларнинг ичи (кафт) билан юзга масх тортилади. \n" +
                "Мен ҳам намоз ўқийман\n" +
                "www.ziyouz.com кутубхонаси 4\n" +
                "4. Қўлларни иккинчи бор тупроқ ёки тупроқ жинсидан бўлган нарсага уриб, чап қўлнинг\n" +
                "кафти билан ўнг қўлга тирсаги билан қўшиб, ўнг қўл кафти билан эса чап қўлга айни тарзда\n" +
                "масх этилади.\n" +
                "Таяммумни бузадиган ҳоллар:\n" +
                "1. Таҳоратга яроқли сув топиши.\n" +
                "2. Бадандаги яра ёки (бошқа) узр туфайли таяммум олган кишидан бу ҳолатларнинг кетиши.\n" +
                "3. Таҳоратни бузадиган ҳоллар таяммумни ҳам бузади.\n" +
                "АЁЛЛАРГА ХОС ҲОЛАТЛАР\n" +
                "Балоғат ёшига етган қизлар ва аёлларга хос уч ҳолат мавжуд:\n" +
                "I. Ҳайз ҳолати. Ҳайз энг ками уч кун, кўпи билан ўн кун бачадондан келадиган қондир. Бу\n" +
                "кунлар ичида қон давомли келмасдан, ора-сира тўхташи ҳам мумкин. Бироқ оралиқдаги бу\n" +
                "кунлар ҳам ҳайз кунлари ҳисобланади. Ҳайз кунлари аёлларга қуйидаги амаллар тақиқланади:\n" +
                "1) намоз ўқиш;\n" +
                "2) рўза тутиш;\n" +
                "3) Қуръон ўқиш. Бироқ ҳайз ҳолидаги Қуръон муаллимаси Қуръон ўқиш нияти билан эмас,\n" +
                "толибага ўргатиш мақсадида ҳарфма-ҳарф, сўзма-сўз Қуръон ўргатиши мумкин;\n" +
                "4) Қуръони каримга қўл теккизиш;\n" +
                "5) Каъбани тавоф этиш;\n" +
                "6) масжидга кириш;\n" +
                "7) эри билан жинсий алоқада бўлиш.\n" +
                "Аёллар ҳайз кўрган кунлари ўқиёлмаган намозларининг қазосини ўқимайдилар, бироқ\n" +
                "тутолмаган рўзаларини кейин тутадилар. Ҳомиладор аёллар ҳайз кўрмайдилар.\n" +
                "II. Нифос ҳолати. Аёлларда туққандан сўнг бачадондан қирқ кунгача келадиган қон нифос\n" +
                "қонидир. Бу қон қирқ кундан олдин ҳам тўхташи мумкин. Қон тўхтаган куни ғусл олиб\n" +
                "ибодатларда давом этилади. Қирқ кун ичида қон келиши яна бошланиб қолса, қон тўхтаган\n" +
                "олдинги кунлар ҳам нифос ҳолатидаги кунлар ҳисобланади.\n" +
                "Ҳайз кунларида тақиқланган (ҳаром саналган) амаллар нифос ҳолатида ҳам тақиқланади. Бу\n" +
                "кунларда ўқилмаган намозлар қазо қилиб ўқилмайди, тутилмаган рўзаларнинг қазоси\n" +
                "тутилади.\n" +
                "III. Истиҳоза. Хасталик туфайли аёлларда таносил узви йўли билан бачадондан эмас,\n" +
                "томирдан келадиган қон изтиҳоза қонидир. Ҳайз қонининг ўн кундан ошиғи ва уч кундан оз\n" +
                "давом этгани, кўзи ёригач нифоснинг қирқ кундан ортиқ давом этгани ва ҳомиладорлик\n" +
                "пайтида келадиган суюқликлар истиҳозадир. Бундай ҳолатлар аёллар учун узрли саналади.\n" +
                "НАМОЗ\n" +
                "Намоз Исломнинг асосий шартларидан бири ҳисобланади. Аллоҳ таоло бандаларига фарз\n" +
                "қилиб қўйган. Намоз Аллоҳ берган ҳадсиз-ҳисобсиз неъматларга бандасининг шукронаси\n" +
                "ҳамдир. Намоз ибодати туфайли кишининг Аллоҳ наздидаги даражаси юксалади. Намозхон\n" +
                "охират ҳаётига тайёргарлик кўриб боради. Турли баҳоналар билан намоз ўқимай юрган киши\n" +
                "Аллоҳнинг буйруғига қарши чиққан бўлади. Бу эса, катта мусибатдир.\n" +
                "Қуръони каримда намоз ўқиш амр этилган кўплаб оятлар бор (мазмунлари):\n" +
                "«Намозни мукаммал адо этингиз, закот берингиз ва руку қилувчилар билан бирга руку\n" +
                "қилингиз» (Бақара, 43).\n" +
                "«Намозни мукаммал адо этингиз ва закот берингиз!» (Бақара, 110).\n" +
                "Мен ҳам намоз ўқийман\n" +
                "www.ziyouz.com кутубхонаси 5\n" +
                "«Аллоҳ имонларингизни (Байтул-Мақдисга қараб ўқиган намозларингиз ажрини) зое\n" +
                "кеткизмас. Албатта, Аллоҳ одамларга меҳрибон ва раҳмлидир» (Бақара, 143).\n" +
                "«(Эй Муҳаммад), имон келтирган бандаларимга айтинг, намозни мукаммал адо этсинлар\n" +
                "ҳамда савдо-сотиқ ва ошна-оғайнигарчилик бўлмайдиган Кун (қиёмат) келмай туриб, Биз\n" +
                "уларга ризқ қилиб берган нарсалардан хуфёна ва ошкора эҳсон қилсинлар!» (Иброҳим, 31).\n" +
                "\"Қуёш оғишидан то тун қоронғусигача намозни мукаммал адо қилинг ва тонгги ўқишни\n" +
                "(бомдод намозини) ҳам (адо қилинг). Зеро, тонгги ўқиш (фаришталар) ҳозир бўладиган\n" +
                "(намоз)дир. Тунда (бир қисмида) уйғониб ўзингиз учун таҳажжуд (нафл) намозини ўқинг!\n" +
                "Шоядки, Раббингиз Сизни (Қиёмат кунида) мақтовли (шафоат қиладиган мақомда) тирилтирса»\n" +
                "(Ал-Исро, 78-79).\n" +
                "«Аҳлингизни намоз (ўқиш)га буюринг ва (ўзингиз ҳам) унга (намозга) бардошли бўлинг!»\n" +
                "(Тоҳа, 132).\n" +
                "«Дарҳақиқат, мўминлар нажот топдилар. Улар намозларга (қўрқув ва умид билан) бўйин\n" +
                "эгувчи кишилардирлар. Улар (барча) намозларни (вақтида адо этиб қазо бўлишдан) сақлагувчи\n" +
                "кишилардир» (Мўминлар, 1-2, 9).\n" +
                "«Албатта, намоз фаҳш ва ёмонликдан қайтарур! Албатта, Аллоҳнинг зикри (барча нарсадан)\n" +
                "улуғдир!» (Анкабут, 45).\n" +
                "«Бас (эй, Муҳаммад), улар (кофирлар) айтаётган сўзларга сабр қилинг ва Қуёш чиқишидан\n" +
                "ва ботишидан аввал Раббингизга ҳамд билан тасбеҳ айтинг (намоз ўқинг)! Яна кечанинг (бир\n" +
                "қисмида) ва саждалар (намозлар) ортидан тасбеҳ айтинг!» (Қоф, 39-40).\n" +
                "«(Эй Муҳаммад,) Сиз Раббингизнинг ҳукмига сабр қилинг! Зотан, Сиз Бизнинг кўз ўнгимизда\n" +
                "(ҳимоямизда)дирсиз! (Тонгдан уйқудан) турган пайтингизда, Раббингизга ҳамд билан тасбеҳ\n" +
                "айтинг! Шунингдек, кечадан (вақт ажратиб) ва юлдузлар юз ўгиргач (ботгач саҳарда) ҳам Унга\n" +
                "тасбеҳ айтинг» (Тур, 48-49).\n" +
                "«Дарҳақиқат, инсон бетоқат қилиб яратилгандир. Қачонки унга ёмонлик (камбағаллик ёки\n" +
                "мусибат) етса, у ўта бесабрлик қилувчидир. Қачонки унга яхшилик (бойлик, саломатлик) етса,\n" +
                "у ўта ман этувчи (бахил)дир. Фақат намозхонлар бундан мустаснодирлар» (Маориж, 19-23).\n" +
                "ҲАДИСЛАРДАН НАМУНАЛАР\n" +
                "* Пайғамбаримиз (с.а.в.) асҳобларидан сўрадилар: «Бирортангиз уйингизнинг олдидан оқиб\n" +
                "ўтадиган дарёда (ёки сойда) ҳар куни беш маҳал ювинсангиз, баданимда кир қолибди, деб\n" +
                "айтасизми?» Саҳобалар: «Сира ҳам кир қолмайди», дейишди. Расули Акрам: «Беш вақт намоз\n" +
                "ҳам шунга ўхшаш бўлиб, Аллоҳ таоло бу ўқилган намозлар туфайли гуноҳларни кечиради».\n" +
                "* «Аср намозини қазо қилиб қўйган одам бола-чақасию мол-дунёсидан ажраган киши\n" +
                "янглиғдир».\n" +
                "* «Қоронғу кечаларда масжидга борган кишиларга, Қиёмат куни бир нурга мазҳар\n" +
                "бўлишлари хушхабарини етказинг».\n" +
                "* «Сизлардан бирларингиз намоз ўқиган жойда таҳоратини бузмасдан ўтирган муддатгача,\n" +
                "фаришталар: «Илоҳо, бу кишининг гуноҳларини кечир ва унга раҳм айла», деб дуо этишади»\n" +
                "* «Аллоҳга қасамки, шундай нарса хаёлимдан ўтяпти: ўтин тўплашни буюрсам ва ўтинлар\n" +
                "тўпланса. Кейин намозга буюрсам, намоз учун азон айтилса, кейин бир кишини мўминларга\n" +
                "имомликка ўтишни буюрсам-да, намозга келмаганларнинг бориб уйларини ёқсам...»\n" +
                "* «Мўминлар хуфтон ва бомдод намозларидаги савобни билганларида эди, бу намозларни\n" +
                "жамоат билан ўқиш учун, эмаклаб бўлса ҳам, масжидга келишар эди».\n" +
                "* «Намоз инсон билан ширк ва куфр ўртасидаги бир пардадир. Намозни тарк этиш бу\n" +
                "пардани кўтариш бўлади».\n" +
                "* «Улар (кофирлар) билан бизнинг ўртамизни фарқлайдиган аломат намоздир. Бинобарин, \n" +
                "Мен ҳам намоз ўқийман\n" +
                "www.ziyouz.com кутубхонаси 6\n" +
                "намозни тарк қилган кимса кофирларга ўхшабди».\n" +
                "* «Банда Қиёмат кунида энг аввало намоздан ҳисоб-китоб қилинади. Агар намози дуруст\n" +
                "чиқса, қутулибди ва ютибди. Агар намози дуруст чиқмаса, ютқазибди. Фарз намозлари кам\n" +
                "чиқса, Аллоҳ азза ва жалла: «Қаранг-чи, қулимнинг нафл намозлари борми?» дейди.\n" +
                "Намозларининг ками нафл намозлар билан тўлдирилади. Қолган амаллари ҳам шу тарзда\n" +
                "ҳисоб-китоб қилинади».\n" +
                "* «Бир куни Пайғамбар, алайҳиссалом, ҳузурларида намоз ўқимай тонг отгунча ухлаган бир\n" +
                "кишининг номи тилга олинди. Расули Акрам: «Ундай бўлса, у одамнинг қулоқларига ё қулоғига\n" +
                "шайтон бавл этибди», дея марҳамат қилдилар».\n" +
                "* «Сизлардан биров ухлаб қолса, шайтон унинг орқа миясига уч тугун тугиб қўяди ва ҳар\n" +
                "тугунга: «Ҳали тунлар узун, (бемалол) ухла», дея афсун ўқийди. Агар у одам уй-ғониб Аллоҳни\n" +
                "зикр этса, тугунлардан биттаси, таҳорат олганида яна бири, намоз ўқиганида эса, қолгани ҳам\n" +
                "ечилади ва қалби қувонч ва хушнудликка тўлиб тонг оттиради. Акс ҳолда, шайтон тугиб қўйган\n" +
                "тугунларнинг таъсирида дангасалик билан тонг отгунча ухлаб қолади».\n" +
                "* Кечаси туриб ибодат қилган ва хотинини уйғотган, хотини туришни хоҳламаса, юзига сув\n" +
                "сепган одамга Аллоҳ раҳматини ёғдирсин. Кечаси туриб намоз ўқиган ва эрини уйғотган, эри\n" +
                "туришни хоҳламаса, юзига сув сепган хотинга Аллоҳ раҳматини ёғдирсин».\n" +
                "* «Намоз жаннатнинг калитидир».\n" +
                "* «Намоз диннинг устунидир».\n" +
                "* «Намоз мўминнинг меърожидир».\n" +
                "* «Эй Муҳаммад, бир кеча-кундузда умматларингга беш вақт намозни фарз қилдим. Ўзимча\n" +
                "аҳд қилдимки, ким шу беш вақт намозни ўз вақтида адо этиб юрса, у кишини жаннатга\n" +
                "киритаман. Ким ўз вақтида адо этиб юрмаса, у банда хусусида аҳдим йўқдир» (Ҳадиси қудсий).\n" +
                "АЗОН\n" +
                "Алл`оҳу акбар!\n" +
                "Алл`оҳу акбар!\n" +
                "Алл`оҳу акбар!\n" +
                "Алл`оҳу акбар!\n" +
                "Ашҳаду алл`а ил`аҳа иллалл`оҳ!\n" +
                "Ашҳаду алл`а ил`аҳа иллалл`оҳ!\n" +
                "Ашҳаду анна Муҳаммадар расул`улл`оҳ!\n" +
                "Ашҳаду анна Муҳаммадар расул`улл`оҳ!\n" +
                "Ҳаййа ъалас-сол`аҳ!\n" +
                "Ҳаййа ъалас-сол`аҳ!\n" +
                "Ҳаййа ъалал фал`аҳ!\n" +
                "Ҳаййа ъалал фал`аҳ!**\n" +
                "Алл`оҳу акбар!\n" +
                "Алл`оҳу акбар!\n" +
                "Ла ил`аҳа иллалл`оҳ.\n" +
                "\n" +
                "*\n" +
                " *Бомдод азонида бу сўзлардан кейин икки марта «Ас-сол`ату хойрум минан-на`вм! – «Намоз уйқудан афзалдир!»\n" +
                "деб қўшиб қўйилади. \n" +
                "Мен ҳам намоз ўқийман\n" +
                "www.ziyouz.com кутубхонаси 7\n" +
                "Таржимаси:\n" +
                "Аллоҳ буюкдир!\n" +
                "Аллоҳ буюкдир!\n" +
                "Аллоҳ буюкдир!\n" +
                "Аллоҳ буюкдир!\n" +
                "Аллоҳдан ўзга сиғиниладиган (илоҳ) йўқлигига иқрорман!\n" +
                "Аллоҳдан ўзга сиғиниладиган (илоҳ) йўқлигига иқрорман!\n" +
                "Муҳаммад Аллоҳнинг элчиси эканига иқрорман!\n" +
                "Муҳаммад Аллоҳнинг элчиси эканига иқрорман!\n" +
                "Намозга келинг, намозга келинг!\n" +
                "Нажотга келинг, нажотга келинг!\n" +
                "Аллоҳ буюкдир1\n" +
                "Аллоҳ буюкдир!\n" +
                "Аллоҳдан ўзга илоҳ йўқ!\n" +
                "АЗОН ДУОСИ\n" +
                "Алл`оҳумма робба ҳ`азиҳид-д`аъватит-т`аммаҳ. Вас-сол`атил қ`оимаҳ, `ати\n" +
                "Муҳаммаданил вас`ийлата вал фаз`ийлаҳ. Вабъасҳу мақ`омам маҳм`уданиллаз`ий\n" +
                "ваъадтаҳ. Варзуқна шаф`а-ъатаҳ`у йавмал қий`амаҳ. Иннака л`а тухлифул\n" +
                "м`иъ`ад!\n" +
                "Маъноси: Ушбу комил даъватнинг, ҳозир қоим бўлган намознинг Парвардигори, эй Аллоҳ!\n" +
                "Муҳаммадга (с.а.в.) васила, фазилат ва баланд олий даража ато этгин. Уни Ўзинг ваъда қилган\n" +
                "мақтовли мақомда тирилтиргин. Бизга Қиёмат кунида унинг шафоатини насиб эт. Албатта, Сен\n" +
                "ваъдага хилоф қилмассан.\n" +
                "НАМОЗ ЎҚИШ ТАРТИБИ\n" +
                "Бир кунда беш вақт (бомдод, пешин, аср, шом ва хуфтон) намоз ўқиш ҳар бир мусулмонга\n" +
                "фарздир.\n" +
                "БОМДОД НАМОЗИ\n" +
                "Бомдод намози икки ракат суннат, икки ракат фарз – жами тўрт ракатдан иборат.\n" +
                "Бомдод намозининг икки ракат суннати қуйидагича ўқилади:\n" +
                "1. «Аллоҳ ризолиги учун қибла томонга юзланиб, бугунги бомдод намозининг икки ракат\n" +
                "суннатини ўқишни ният қилдим», деб кўнгилдан ўтказилади (1–2-расмлар).\n" +
                "2. «Аллоҳу акбар», деб ифтитоҳ такбири айтилади. Бу такбирда эркаклар қўллар кафтини\n" +
                "қиблага қаратиб, бош бармоқларининг учини қулоқларининг юмшоқ жойига теккизишади (3-\n" +
                "расм). Аёллар қўлларини елка баробарида кўтарадилар (4-расм).\n" +
                "3. Қўллар боғланади. Эркаклар ўнг қўл кафтини чап қўл устига қўйишади. Ўнг қўлнинг бош\n" +
                "ва кичик бармоқлари билан чап қўл билагини ушлашади (5-расм). \n" +
                "Мен ҳам намоз ўқийман\n" +
                "www.ziyouz.com кутубхонаси 8\n" +
                "Аёллар ўнг қўлни чап қўл ус-тида тутиб, қўлларини кўкракка қўядилар (6-расм). Бу ҳол\n" +
                "«қиём» дейилади. Қиёмда (тик турган ҳолда) сажда қилинадиган жойга қараб, навбати билан,\n" +
                "қуйидагилар ўқилади.\n" +
                "САНО ДУОСИ\n" +
                "Субҳ`анакалл`оуҳумма ва биҳамдика ва таб`арокасмука ва та`аъла жаддука ва\n" +
                "л`а ил`аҳа ғойрук.\n" +
                "Маъноси: «Аллоҳим! Сенинг номинг муборакдир. Шон-шарафинг улуғдир. Сендан ўзга илоҳ\n" +
                "йўқдир».\n" +
                "ФОТИҲА СУРАСИ\n" +
                "Аъ`узу билл`аҳи минаш шайт`онир рож`ийм. Бисмилл`аҳир роҳм`анир роҳ`ийм.\n" +
                "Ал ҳамдулилл`аҳи роббил ъ`алам`ийн. Ар-роҳм`анир роҳ`ийм. М`алики\n" +
                "явмидд`ийн. Ийй`ака наъбуду ва ийй`ака настаъ`ийн. Иҳдинас сир`отол\n" +
                "мустақ`ийм. Сир`отоллаз`ийна анъамта ъалайҳим ғойрил мағз`уби ъалайҳим\n" +
                "валазз``олл`ийн.\n" +
                "Мазмуни: Аллоҳнинг даргоҳидан қувилган шайтон ёмонлигидан Аллоҳнинг паноҳига\n" +
                "қочаман. Меҳрибон ва раҳмли Аллоҳ номи билан (бошлайман). Ҳамд оламлар рабби\n" +
                "Аллоҳгаким, (У) меҳрибон, раҳмли ва ҳисоб-китоб куни (Қиёмат)нинг эгасидир. Сенгагина\n" +
                "ибодат қиламиз ва Сендангина ёрдам сўраймиз! Бизни шундай тўғри йўлга бошлагинки, (У) Сен\n" +
                "инъом (ҳидоят) этганларнинг (пайғамбарлар, сиддиқ ва шаҳидларнинг) йўлидир, ғазабга\n" +
                "учраган (Мусо қавмидан итоатсизларининг) ва адашган (Исо қавмининг «Аллоҳнинг фарзанди\n" +
                "бор» дейдиган)ларнинг эмас!\n" +
                "Фотиҳа сурасидан сўнг бир зам (қўшимча) сура ўқилади.\n" +
                "Янги ўрганувчилар қуйидаги кичик суралардан бирини зам қилишса бўлади:\n" +
                "КАВСАР СУРАСИ\n" +
                "Инн`а аътойн`акал-кавсар. Фа солли лироббика ванҳар. Инна ш`аниа’ка ҳувал\n" +
                "абтар.\n" +
                "Мазмуни: «(Эй Муҳаммад,) дарҳақиқат, Биз Сизга Кавсарни* бердик. Бас, Раббингиз учун\n" +
                "намоз ўқинг ва (туя) сўйиб қурбонлик қилинг! Албатта, ғанимингизнинг ўзи (барча\n" +
                "яхшиликлардан) маҳрумдир».\n" +
                "(Кавсар — жаннатдаги бир ажиб дарё ёки ҳовузнинг номи. Унинг суви асалдан тотли, қор\n" +
                "ва сувдан оқ. Ундан ичган киши абадий чанқоқлик кўрмайди.)\n" +
                "ИХЛОС СУРАСИ\n" +
                "Қул ҳувалл`оҳу аҳад. Алл`оҳус-сомад. Лам ял`ид. Ва лам `ювлад ва лам\n" +
                "якуллаҳ`у куфуван аҳад.\n" +
                "Мазмуни: (Эй Муҳаммад,) айтинг: «У — Аллоҳ ягонадир. Аллоҳ беҳожат, (лекин)\n" +
                "ҳожатбарордир. У туғмаган ва туғилмаган ҳам. Шунингдек, Унга тенг бирор зот йўқдир».\n" +
                "ФАЛАҚ СУРАСИ\n" +
                "Қул аъ`узу бироббил фалақ. Мин шарри м`а холақ. Ва мин шарри ғ`осиқин из`а\n" +
                "вақоб. Ва мин шаррин-нафф`ас`ати фил ъуқод. Ва мин шарри ҳ`асидин из`а ҳасад.\n" +
                "Мен ҳам намоз ўқийман\n" +
                "www.ziyouz.com кутубхонаси 9\n" +
                "Маъноси: «(Эй Муҳаммад,) айтинг: “Паноҳ тилаб илтижо қилурман тонг Парвардигорига\n" +
                "яратган нарсаси ёвузлигидан, тугунчага дам урувчи аёллар ёвузлигидан ҳамда ҳасадчининг\n" +
                "ҳасади ёвузлигидан”».\n" +
                "АН-НОС СУРАСИ\n" +
                "Қул аъ`узу бирробин-н`аси маликин-н`аси ил`аҳин-н`аси мин шаррил васв`асил\n" +
                "хонн`ас. Аллаз`ий йувасвису ф`ий суд`урин-н`аси минал жиннати ван-н`ас.\n" +
                "Маъноси: «(Эй Муҳаммад,) айтинг: “Паноҳ тилаб илтижо қилурман одамлар Парвардигорига,\n" +
                "одамлар Подшоҳига, одамлар Илоҳига яширин васвасачи (шайтон) ёвузлигиданки, (у)\n" +
                "одамларнинг дилларига васваса солур. (Ўзи) жинлар ва одамлардандир”».\n" +
                "4. Зам сура тугагач, «Аллоҳу акбар», деб руку қилинади. Эркаклар тирсаклари ва\n" +
                "тиззаларини букмасдан, бармоқларини очган ҳолда, тиззаларини маҳкам чангаллаб эгиладилар\n" +
                "(7-расм).\n" +
                "Аёллар эркакларга нисбатан озроқ эгиладилар. Тиззаларини бир оз букадилар.\n" +
                "Бармоқларини жамлаб тиззаларини тутадилар. (8-расм).\n" +
                "Рукуда уч марта «Субҳана роббийал азийм» (Эй буюк Роббим, Сен барча нуқсонлардан\n" +
                "поксан), дейилади.\n" +
                "5. Рукудан «Самиъаллоҳу лиман ҳамидаҳ» (Аллоҳ Уни ҳамд этганларни эшитгувчидир), деб\n" +
                "қад кўтарилади, бу ҳолат «қавма» дейилади.\n" +
                "Қавма ҳолида: «Роббана лакал ҳамд» (Эй Роббимиз, ҳар турли ҳамд-санолар ёлғиз\n" +
                "Сенгадир), дейилади (9–10-расмлар).\n" +
                "6. «Аллоҳу акбар» деб аввало тиззалар, кейин қўллар, сўнг пешона ва бурун ерга\n" +
                "теккизилиб, сажда қилинади. Сажда қилинаётганда оёқ панжалари қиблага қаратилади,\n" +
                "эркакларнинг тирсаклари ерга тегмайди (11-расм). Аёллар тирсакларини ерга қўядилар (12-\n" +
                "расм). Саждада уч марта: «Субҳана роббийал аъла» (Эй улуғ Роббим, Сен бутун нуқсонлардан\n" +
                "поксан), дейилади.\n" +
                "7. «Аллоҳу акбар» деб саждадан бош кўтарилади ва тиз чўккан ҳолда бир оз ўтирилади, бу\n" +
                "ҳолат «жалса» дейилади. Жалсада қўллар, бармоқлар ўз ҳолича тутилиб, сонга қўйилади.\n" +
                "Бармоқ учлари тизза билан тенг бўлиши лозим (13–14-расмлар).\n" +
                "8. Эркаклар чап оёқлари устига ўтирадилар. Ўнг оёқ панжалари қиблага қаратилади (15-\n" +
                "расм). Аёллар оёқларини ўнг тарафдан чиқариб ўтирадилар (16-расм). 8. «Аллоҳу акбар», деб\n" +
                "иккинчи марта сажда қилинади. Саждада уч марта: «Субҳана роббийал аъла», дейилади (17–\n" +
                "18-расмлар) Шу билан биринчи ракат тугайди.\n" +
                "9. «Аллоҳу акбар», деб қиёмга (тикка) турилади (19–20-расмлар).\n" +
                "10. Қиёмда «Бисмиллаҳир роҳманир роҳийм»дан бошлаб, Фотиҳа сураси, орқа-сидан бир зам\n" +
                "сура ўқилади.\n" +
                "11. «Аллоҳу акбар», деб руку қилинади. Рукуда уч марта «Субҳана роббийал азийм»,\n" +
                "дейилади (21–22-расмлар).\n" +
                "12. «Самиъаллоҳу лиман ҳамидаҳ», деб тик турилади, кетидан «Роббана лакал ҳамд»,\n" +
                "дейилади (23–24-расмлар).\n" +
                "13.«Аллоҳу акбар», деб саждага борилади. Саждада уч марта «Субҳана роббийал аъла»,\n" +
                "дейилади (25—26-расмлар).\n" +
                "14. «Аллоҳу акбар», деб саждадан бош кўтарилади ва бир оз ўтирилади (27–28-расмлар).\n" +
                "15. «Аллоҳу акбар», деб иккинчи бор сажда қилинади. Саждада уч марта: «Субҳана\n" +
                "роббийал аъла», де-йилади (29–30-расм-лар).\n" +
                "16. «Аллоҳу акбар», деб саждадан бош кўтарилиб (31–32-расмлар) қаъдада ўтирилади ва\n" +
                "қуйидагилар ўқилади: \n" +
                "Мен ҳам намоз ўқийман\n" +
                "www.ziyouz.com кутубхонаси 10\n" +
                "«АТТАҲИЙЙАТ» ДУОСИ\n" +
                "Аттаҳийй`ату лилл`аҳи вас-солав`ату ваттоййиб`ат. Ассал`аму ъалайка аййуҳаннабиййу\n" +
                "ва роҳматулл`оҳи ва барок`атуҳ. Ассал`аму ъалайн`а ва ъал`а\n" +
                "иб`адиллаҳис-с`олиҳ`ийн. Ашҳаду алл`а ил`аҳа иллалл`оҳу ва ашҳаду анна\n" +
                "Муҳаммадан ъабдуҳ`у ва рос`улуҳ.\n" +
                "Мазмуни: Мол, бадан, тил билан адо этиладиган бутун ибодатлар Аллоҳ учундир. Эй Набий!\n" +
                "Аллоҳнинг раҳмати ва баракоти Сизга бўлсин. Сизга ва солиҳ қулларга Аллоҳнинг саломи\n" +
                "бўлсин. Иқрорманки, Аллоҳдан ўзга илоҳ йўқ. Ва яна иқрорманки, Муҳаммад, алайҳиссалом,\n" +
                "Аллоҳнинг қули ва элчисидирлар.\n" +
                "САЛОВОТ\n" +
                "Алл`оҳумма солли ъал`а Муҳаммадив-ва ъал`а `али Муҳаммад. Кам`а соллайта\n" +
                "ъал`а Иброҳ`има ва ъал`а `али Иброҳ`им. Иннака ҳам`идум-маж`ид.\n" +
                "Алл`оҳумма б`арик ъал`а Муҳаммадив-ва ъал`а `али Муҳаммад. Кам`а б`арокта\n" +
                "ъал`а Иброҳ`има ва ъал`а `али Иброҳ`им. Иннака ҳам`идум-маж`ид.\n" +
                "Мазмуни: Аллоҳим, Иброҳим ва унинг оиласига раҳмат этганинг каби, Муҳаммад ва ул\n" +
                "зотнинг оиласига раҳмат айла, Сен ҳамду мақтовга лойиқ ва буюк Зотсан.\n" +
                "Аллоҳим, Иброҳим ва унинг оиласига баракотингни эҳсон этганинг каби Муҳаммад ва ул\n" +
                "зотнинг оиласи устига ҳам баракотингни эҳсон айла. Сен ҳамду мақтовга лойиқ ва буюк\n" +
                "Зотсан.\n" +
                "ДУО\n" +
                "Роббан`а `атин`а фид-дунй`а ҳасанатав-ва фил `ахироти ҳасанатав-ва қин`а\n" +
                "аз`абан-н`ар.\n" +
                "Мазмуни: «Эй Роббимиз, бизга бу дунёда ҳам, охиратда ҳам яхшиликни бергин ва бизни\n" +
                "дўзах олови азобидан сақлагин».\n" +
                "17. Аввал ўнг, кейин чап елкага қараб: «Ассаламу алайкум ва роҳматуллоҳ» деб салом\n" +
                "берилиб намоздан чиқилади (33—38-расмлар).\n" +
                "Шу билан бомдод намозининг икки ракат суннати тугайди.\n" +
                "Бомдод намозининг икки ракат фарзи ҳам худди шу тартибда ўқилади. Фарқи — аввало,\n" +
                "эркаклар ниятдан олдин (бошқа фарз намозлари олдидан ҳам) қуйидаги иқомат такбирини\n" +
                "айтишади:\n" +
                "Аллоҳу акбар, Аллоҳу акбар,\n" +
                "Аллоҳу акбар, Аллоҳу акбар.\n" +
                "Ашҳаду алла илаҳа иллаллоҳ,\n" +
                "Ашҳаду алла илаҳа иллаллоҳ.\n" +
                "Ашҳаду анна Муҳаммадар росулуллоҳ,\n" +
                "Ашҳаду анна Муҳаммадар росулуллоҳ.\n" +
                "Ҳаййа ъалас-солаҳ, ҳаййаъалас-солаҳ,\n" +
                "Ҳаййа ъалал-фалаҳ, ҳаййаъалал-фалаҳ.\n" +
                "Қод қоматис-солаҳ, қод қоматис-солаҳ\n" +
                "Аллоҳу акбар, Аллоҳу акбар,\n" +
                "Ла илаҳа иллаллоҳ.\n" +
                "Иқомат такбирининг лафзлари азонникига ўхшайди, фарқи — буниси тез айтилади. \n" +
                "Мен ҳам намоз ўқийман\n" +
                "www.ziyouz.com кутубхонаси 11\n" +
                "Бомдод намозининг фарзига қуйидагича ният қилинади: «Аллоҳ ризолиги учун бомдод\n" +
                "намозининг икки ракат фарзини ўз вақтида ўқишни ният қилдим».\n" +
                "Қолган қисми суннат билан бир хил давом этаверади.\n" +
                "ПЕШИН НАМОЗИ\n" +
                "Пешин намози тўрт ракат суннат, тўрт ракат фарз ва икки ракат суннатдан иборат.\n" +
                "Тўрт ракат суннат қуйидагича ўқилади:\n" +
                "1. Ният қилинади.\n" +
                "2. Ифтитоҳ такбири айтилади.\n" +
                "3. Сано дуоси ўқилади.\n" +
                "4. Фотиҳа сураси. Кейин бирорта зам сура.\n" +
                "5. Руку.\n" +
                "6. Сажда.\n" +
                "7. «Аллоҳу акбар» деб туриб, яна Фотиҳа сураси, зам сура.\n" +
                "8. Руку.\n" +
                "9. Сажда.\n" +
                "10. Ўтириб «Аттаҳиййат» ўқилади.\n" +
                "11. «Аллоҳу акбар» деб яна туриб, Фотиҳа сураси ва зам сура.\n" +
                "12. Руку.\n" +
                "13. Сажда.\n" +
                "14. «Аллоҳу акбар» деб тўртинчи ракатга турилади. Яна Фотиҳа сураси ва зам сура.\n" +
                "15. Руку.\n" +
                "16. Сажда.\n" +
                "17. Ўтириб, «Аттаҳиййат», «Саловот», «Роббана» дуолари ўқилади.\n" +
                "18. Салом бериб намоздан чиқилади.\n" +
                "Пешин намозининг фарзи ҳам айни шу тартибда ўқилади. Фақатгина ният қилинаётганда\n" +
                "«Аллоҳ розилиги учун пешин намозининг тўрт ракат фарзини ўқишга ният қилдим», дейилади.\n" +
                "Бундан ташқари, фарзда учинчи ва тўртинчи ракатларда «Фотиҳа»дан кейин зам сура\n" +
                "қўшилмайди.\n" +
                "Пешин намозининг икки ракат суннати бомдод намозининг суннати каби ўқилади.\n" +
                "АСР НАМОЗИ\n" +
                "Аср намози тўрт ракат фарздан иборат. Бу намоз билан пешин намози фарзининг ўқилиши\n" +
                "бир хил. Ниятда «Аср намозининг тўрт ракат фарзини...» дейилса бўлди.\n" +
                "ШОМ НАМОЗИ\n" +
                "Шом намози уч ракат фарз ва икки ракат суннатдан иборат. Уч ракатли фарзнинг ўқилиши:\n" +
                "1. Ният.\n" +
                "2. Ифтитоҳ такбири.\n" +
                "3. Сано.\n" +
                "4. Фотиҳа, зам сура.\n" +
                "5. Руку.\n" +
                "6. Сажда.\n" +
                "7. Туриб, Фотиҳа, зам сура.\n" +
                "8. Руку.\n" +
                "9. Сажда. \n" +
                "Мен ҳам намоз ўқийман\n" +
                "www.ziyouz.com кутубхонаси 12\n" +
                "10. Ўтириб, «Аттаҳиййат».\n" +
                "11. Туриб, фақат Фотиҳа.\n" +
                "12. Руку.\n" +
                "13. Сажда.\n" +
                "14. Ўтириб, «Аттаҳиййат», «Саловот», «Роббана» дуолари.\n" +
                "15. Салом.\n" +
                "Шом намозининг икки ракат суннати бомдод намозининг икки ракат суннати каби ўқилади.\n" +
                "ХУФТОН НАМОЗИ\n" +
                "Хуфтон намози тўрт ракат фарз, икки ракат суннатдан иборат.\n" +
                "Хуфтон намозининг тўрт ракат фарзи пешин намозининг фарзи каби ўқилиб, фақат ниятда\n" +
                "фарқ бўлади. Хуфтоннинг икки ракат суннати ҳам юқорида ўрганганимиз бомдод ва шом\n" +
                "намозларининг икки ракат суннатлари каби бир хил тартибда ўқилади.\n" +
                "ВИТР НАМОЗИ\n" +
                "Витр намози уч ракатли бўлиб, вожиб ибодат саналади. Фарздан қуйироқ, суннатдан улуғ\n" +
                "туради. Ўқилиши шарт. Бирор сабаб ила вақтида ўқилмай қолса, қазоси ўқилади. Витр намози\n" +
                "хуфтон намозидан кейин ўқилади.\n" +
                "Қуйидаги тартибда адо этилади:\n" +
                "1. Ният.\n" +
                "2. Ифтитоҳ такбири.\n" +
                "3. Сано.\n" +
                "4. Фотиҳа, зам сура.\n" +
                "5. Руку.\n" +
                "6. Сажда.\n" +
                "7. Иккинчи ракатга туриб, «Фотиҳа», зам сура.\n" +
                "8. Руку.\n" +
                "9. Сажда.\n" +
                "10. Ўтириб, «Аттаҳиййат» дуоси.\n" +
                "11. Учинчи ракатга туриб «Фотиҳа», зам сура.\n" +
                "12. Зам сурадан кейин ўша тик турган ҳолда «Аллоҳу акбар», деб қулоқ қоқилади.\n" +
                "13. Қўл қовуштирилиб, Қунут дуоси ўқилади.\n" +
                "ҚУНУТ ДУОСИ\n" +
                "Алл`оҳумма инн`а настаъ`инука ва настағфирук. Вануъмину бика ва натавакалу\n" +
                "ъалайка ва нусн`ий ъалайкал хойр. Куллаҳ`у нашкурука ва л`а накфурук. Ва\n" +
                "нахлаъу ва натруку май-йафжурук.\n" +
                "Алл`оҳумма ийй`ака наъбуду ва лака нусолл`ий ва насжуду ва илайка насъ`а ва\n" +
                "наҳфиду нарж`у роҳматак(а). Ва нахш`а ъаз`абака инна ъаз`абака бил куфф`ари\n" +
                "мулҳиқ.\n" +
                "Маъноси: Аллоҳим! Биз Сендан ёрдам истаймиз, гуноҳларимизни афу этишингни сўраймиз.\n" +
                "Аллоҳим! Сенга имон келтирамиз, ишларимизда Сенга суянамиз ва Сенга таваккал қиламиз. Ва\n" +
                "Сенга ҳамд айтамиз. Бутун яхшиликлар Сендандир. Бизларга берганинг шунча неъматлар\n" +
                "туфайли Сенга шукрона айтамиз ва нонкўрлик қилмаймиз. Сенга қарши нонкўрлик қилган\n" +
                "гуноҳкорлардан айриламиз, улар билан алоқани узамиз.\n" +
                "Аллоҳим! Биз ёлғиз Сенгагина қуллик қиламиз, намозни Сен учунгина ўқиймиз. Сенгагина\n" +
                "Мен ҳам намоз ўқийман\n" +
                "www.ziyouz.com кутубхонаси 13\n" +
                "сажда қиламиз. Сенгагина интиламиз. Ибодатни хушуъ-камтарлик билан адо этамиз. Раҳматинг\n" +
                "кўп бўлишини сўраймиз, азобинг-дан қўрқамиз. Ҳеч шубҳа йўқки, Сенинг азобинг\n" +
                "кофирларгадир.\n" +
                "14. Руку.\n" +
                "15 Сажда.\n" +
                "16. Ўтириб «Аттаҳиййат», «Саловот», «Роббана» дуолари.\n" +
                "18. Салом.\n" +
                "НАМОЗДАН КЕЙИНГИ ЗИКРЛАР\n" +
                "Намоз салом билан тугайди. Саломдан кейинги амаллар (тасбеҳоту дуолар) мажбурий эмас,\n" +
                "аммо ниҳоятда савоблидир.\n" +
                "Фарз намозларидан кейин қуйидаги дуони ўқиш суннатдир:\n" +
                "Алл`оҳумма антас-сал`ам ва минкас-сал`ам. Таб`арокта й`а залжал`али вал\n" +
                "икр`ом.\n" +
                "Мазмуни:\n" +
                "Эй Аллоҳим, Сен барча айб-нуқсонлардан поксан. Барча саломатлик ва раҳмат Сендандир.\n" +
                "Эй азамат ва қудрат эгаси бўлган Аллоҳим, Сенинг шонинг улуғдир.\n" +
                "Умуман, ҳар вақт намозни тугатгандан сўнг Оятал курси ўқилса, тасбеҳот қилинса, савоби\n" +
                "улуғ бўлади.\n" +
                "ОЯТАЛ КУРСИ\n" +
                "Аъ`узу билл`аҳи минаш-шайт`онир рож`ийм. Бисмилл`аҳир роҳм`анир роҳ`ийм.\n" +
                "Алл`оҳу л`а ил`аҳа илл`а ҳувал ҳаййул қойй`ум. Л`а та’хузуҳ`у синатув-ва л`а\n" +
                "на`вм. Лаҳу м`а фис-сам`ав`ати ва м`а фил арз. Манзаллаз`ий яшфаъу ъиндаҳ`у\n" +
                "илл`а би’изниҳ. Яъламу м`а байна айд`иҳим ва м`а холфаҳум ва л`а йух`ит`уна би\n" +
                "шай’им-мин ъилмиҳ`и илл`а бима ш`аъа. Васиъа курсиййуҳус-сам`ав`ати вал арз.\n" +
                "Ва л`а йаъ`удуҳ`у ҳифзуҳум`а ва ҳувал ъаллиййул ъаз`ийм.\n" +
                "Мазмуни:\n" +
                "Аллоҳ — Ундан ўзга илоҳ йўқдир. (У ҳамиша) тирик ва абадий турувчидир. Уни на\n" +
                "мудроқ тутар ва на уйқу. Осмонлар ва Ердаги (барча) нарсалар Уникидир. Унинг\n" +
                "ҳузурида ҳеч ким (ҳеч кимни) Унинг рухсатисиз шафоат қилмас. (У) улар\n" +
                "(одамлар)дан олдинги (бўлган) ва кейинги (бўладиган) нарсани билур. (Одамлар)\n" +
                "Унинг илмидан фақат (У) истаганча ўзлаштирурлар. Унинг Курсийси осмонлар ва\n" +
                "Ердан (ҳам) кенгдир. У иккисининг ҳифзи (тутиб туриши) Уни толиқтирмас. У олий\n" +
                "ва буюкдир.\n" +
                "ТАСБЕҲ\n" +
                "Субҳаналлоҳ\n" +
                "(33 марта)\n" +
                "Алҳамдулиллаҳ\n" +
                "(33 марта)\n" +
                "Аллоҳу акбар\n" +
                "(33 марта) \n" +
                "Мен ҳам намоз ўқийман\n" +
                "www.ziyouz.com кутубхонаси 14\n" +
                "КАЛИМАИ ТАВҲИД\n" +
                "Л`а ил`аҳа иллалл`оҳу ваҳдаҳ`у л`а шар`ика лаҳ, лаҳул мулку ва лаҳул ҳамд. Ва\n" +
                "ҳува ъал`а кулли шай’ин қод`ир.\n" +
                "Мазмуни:\n" +
                "Аллоҳдан ўзга илоҳ йўқ. У ягонадир, шериги йўқ, бутун мулк Уникидир. Ҳамд-мақтов Унга\n" +
                "хосдир. Ва У ҳар нарсага қодир зотдир.\n" +
                "ЖАНОЗА НАМОЗИ\n" +
                "Ният: «Аллоҳ ризолиги учун жаноза намозини ўқишни ният қилдим. Ушбу имомга иқтидо\n" +
                "қилдим».\n" +
                "Имом билан бирга такбир туширилгач, Сано дуоси ўқилади: «Субҳ`анакалл`оҳумма ва\n" +
                "биҳамдик. Ва таб`арокасмук ва та`аъла жаддук ва жалла сан`аук ва л`а ил`аҳа\n" +
                "ғойрук».\n" +
                "Сўнг имом овоз чиқариб, «Аллоҳу акбар» деб такбир айтади. Бу такбирда қўллар\n" +
                "кўтарилмайди. Қовуштирилган ҳолида «Саловот» дуоси ўқилади. Яна қўлни кўтармасдан\n" +
                "«Аллоҳу акбар» деб такбир айтилади ва жаноза дуоси ўқилади.\n" +
                "Дуодан сўнг яна қўллар қовуштирилган ҳолда «Аллоҳу акбар», дейилиб, ўнг ва чап\n" +
                "томонларга салом берилади.\n" +
                "ЖАНОЗА ДУОЛАРИ\n" +
                "Ҳар бир жанозада дастлаб қуйидаги дуо ўқилади:\n" +
                "Алл`оҳуммағфир лиҳаййин`а ва маййитин`а ва ш`аҳидин`а ва ғ`о’ибин`а ва\n" +
                "соғ`ийрин`а ва каб`ийрин`а ва закарин`а ва унс`ан`а. Алл`оҳумма ман аҳйайтаҳ`у\n" +
                "минн`а фааҳйиҳ`и ъалал Исл`ам. Ва ман таваффайту минн`а фатаваффаҳ`у ъалал\n" +
                "ийм`ан.\n" +
                "Маъноси:\n" +
                "«Эй Раббим! Тиригимизни ва ўлигимизни, бу ерда бўлганларни ва бўлмаганларни,\n" +
                "кичикларимизни ва катталаримизни, эркак ва аёлларимизни кечиргин. Аллоҳим, Биздан\n" +
                "туғилажак янги наслларни Ислом динида дунёга келтир. Ажали етиб ҳаётдан кўз\n" +
                "юмадиганларнинг жонларини имонли ҳолларида олгин».\n" +
                "Жанозаси ўқилаётган маййит балоғатга етмаган ўғил бола бўлса, мана бу дуо ўқилади:\n" +
                "Алл`оҳуммажъалҳ`у лан`а фаротав-важъал ҳ`у лан`а ажров-ва зухровважъалҳ`у\n" +
                "лан`а ш`афиъам-мушаффаъан.\n" +
                "Мазмуни:\n" +
                "«Аллоҳим! Бу болани жаннатда бизни қаршилаб олувчи ва охират армуғони қил... Аллоҳим!\n" +
                "Бу болани биз учун шафоатчи қил ва шафоатини мақбул айла».\n" +
                "Жаноза балоғатга етмаган қиз бола учун ўқилаётган бўлса, қуйидаги дуо ўқилади:\n" +
                "Алл`оҳуммажъалҳ`а лан`а фаротав-важ-ъалҳ`а лан`а ажров-ва зухровважъалҳ`а\n" +
                "лан`а ш`афиъатам-мушаффаъаҳ.\n" +
                "Маъноси: Аллоҳим! Шу қиз болани жаннатда бизни қаршилаб олувчи ва охират армуғони\n" +
                "қил... Аллоҳим! Бу қизни биз учун шафоатчи қил ва шафоатини мақбул айла.\n" +
                "Бу дуоларни билмаганлар «Алл`оҳуммағфир лий ва лаҳ`у ва лил-муъмин`ийна вал\n" +
                "муъмин`ат».\n" +
                "Яъни, Аллоҳим, мени ва уни, эркак ва аёл барча имон келтирганларни мағфират айла», дея\n" +
                "дуо қилсалар ёки «Роббана...» дуосини ўқисалар ҳам бўлади.\n" +
                "Жаноза намозининг бошланишига улгурмаган киши жамоатга тезда қўшилиб ифтитоҳ\n" +
                "Мен ҳам намоз ўқийман\n" +
                "www.ziyouz.com кутубхонаси 15\n" +
                "такбирини айтади ва имомга иқтидо қилади. Имом салом берганидан кейин, лекин ҳали тобут\n" +
                "кўтарилмасдан аввал қолган такбирларни ўзи айтади.\n" +
                "Тушган, ўлик туғилган болага жаноза ўқилмайди. Бир исм қўйилиб ювилади ва матога ўраб,\n" +
                "кўмилади. Тирик туғилиб ўлган бола ювилиб, жанозаси ўқилади.\n" +
                "ҲАЙИТ НАМОЗИ\n" +
                "1. «Аллоҳ ризолиги учун Рамазон (ёки Қурбон) ҳайити намозини ўқишни ният қилдим.\n" +
                "Юзимни қибла тарафга қаратдим. Ушбу имомга иқтидо қилдим», деб ният қилинади.\n" +
                "2. Имом «Аллоҳу акбар», дея такбир айтгач жамоат ҳам қўлларини кўтариб, ичида ифтитоҳ\n" +
                "такбирини айтади.\n" +
                "3. Ҳар ким ичида Сано дуосини ўқийди. Сўнгра имом кетма-кет қўлларини қулоқларига\n" +
                "кўтариб, уч марта такбир айтади. Жамоат ҳам унга эргашади. Биринчи ва иккинчи такбирда\n" +
                "қўллар ён томонга туширилади. Учинчи такбирдан сўнг қўллар боғланиб, қиём ҳолида\n" +
                "турилади.\n" +
                "4. Шундан кейин имом ичида «Аъузу»ни ва «Бисмиллаҳ»ни айтиб, овоз чиқариб Фотиҳа\n" +
                "сурасини ва зам сурани ўқийди.\n" +
                " 5. Руку ва саждадан сўнг иккинчи ракатга турилади. Имом Фотиҳа сураси билан бир кичик\n" +
                "сура ўқигач, рукуга бормай туриб, худди биринчи ракатдаги каби уч марта такбир айтади.\n" +
                "Тўртинчи такбирдан кейин қўллар боғланмасдан рукуга кетилади ва саждалар адо этилади.\n" +
                "Саждадан сўнгра «Аттаҳиййат» ва «Саловот» ўқиб, салом берилиб, намоз тугатилади.\n" +
                "ЖУМА НАМОЗИ\n" +
                "Жума намози икки ракат фарз бўлиб, ундан олдин ва кейин тўрт ракат суннат ўқилади. Илк\n" +
                "ва охирги суннатлар пешин намозининг суннатлари каби ўқилади. Имомга иқтидо қилиб\n" +
                "ўқиладиган икки ракат фарз эса, бомдод намозининг фарзи каби ўқилади.\n" +
                "Жума намозида икки ракат фарз ўқилмасдан олдин имом минбарда хутба қилади.\n" +
                "Жума намози ҳур, озод, муқим, саломатлиги жойида, оёқлари соғ кишига фарздир.\n" +
                "Жума намозининг шартлари:\n" +
                "1) пешин намози ўқиладиган вақтда ўқиш;\n" +
                "2) намоздан олдин хутба ўқиш;\n" +
                "3) жума ўқиладиган жой ҳаммага очиқ бўлиши;\n" +
                "4) имомдан ташқари камида уч кишидан иборат жамоат бўлиши;\n" +
                "5) имом жума намозини ўқиши учун расман рухсатли бўлиши;\n" +
                "6) жума ўқиладиган жой шаҳар ёхуд шаҳар ҳукмида бўлиши керак.\n" +
                "НАМОЗНИ БУЗАДИГАН ҲОЛЛАР\n" +
                "– намоз пайтида гаплашиш;\n" +
                "– бирор нарса ейиш ёки ичиш;\n" +
                "– ўзи эшитадиган даражада кулиш (ёнидаги эшитадиган қилиб кулса, таҳорат ҳам\n" +
                "бузилади);\n" +
                "– бировга салом бериш ёки саломга алик олиш;\n" +
                "– қибладан бошқа томонга бурилиш;\n" +
                "– дунёвий бирор ташвиш туфайли «уф» тортиш, «оҳ-воҳ» дейиш ва йиғлаш (гуноҳларига\n" +
                "тавба қилиб, Аллоҳдан кечиришликни сўраб йиғласа бўлади);\n" +
                "– атайлаб йўталиш;\n" +
                "— бир рукнда уч мартадан ортиқ бегона ҳаракат қилиш (масалан: кийимни тўғрилаш, \n" +
                "Мен ҳам намоз ўқийман\n" +
                "www.ziyouz.com кутубхонаси 16\n" +
                "қашиниш ва ҳоказо);\n" +
                "– намозда ўқиладиган оятларни маъноси бузиладиган даражада янглиш ўқиш;\n" +
                "– намоз ўқилаётган пайтда таҳоратнинг синиши.\n" +
                "— сажда ҳолида иккала оёқни ердан кўтариш.\n" +
                "НАМОЗНИНГ САВОБИНИ\n" +
                "КАМАЙТИРАДИГАН ҲАРАКАТЛАР\n" +
                "– Бармоқларни қисирлатиш, уст-бошни ўйнаш;\n" +
                "– кўзни юмиш, у ёқ-бу ёққа аланглаш;\n" +
                "– рукуда «Субҳана роббийал ъазийм»ни уч мартадан кам айтиш ёки умуман айтмаслик;\n" +
                "– саждада «Субҳана роббийал аъла»ни уч мартадан кам айтиш ёки ҳеч айтмаслик;\n" +
                "– қибла, ўнг томон ва саждагоҳда жонли нарсалар суратининг бўлиши;\n" +
                "– йўл устида эгаси рози бўлмаган бир жойда намоз ўқиш;\n" +
                "— сажда ҳолида бир оёғини ердан кўтариш.\n" +
                "НАМОЗНИНГ ВОЖИБЛАРИ\n" +
                "1. Қиёмда Фотиҳа сурасини ўқиш.\n" +
                "2. Фарз намозларининг аввалги икки ракати, витр ва нафл намозларининг ҳар ракатида\n" +
                "Фотиҳадан кейин зам сура ўқиш.\n" +
                "3. Уч ва тўрт ракатли намозларда иккинчи ракатдан ке-йин ўтириш.\n" +
                "4. Имомнинг бомдод, ҳайит, жума намозларида, шом, хуфтон намозларининг аввалги икки\n" +
                "ракатида Фотиҳа ва зам сурани овоз чиқариб ўқиши. Пешин ва аср намозларида эса, имомнинг\n" +
                "ҳам, якка ўзи ўқиётган намозхоннинг ҳам овоз чиқармай ўқиши.\n" +
                "5. Витр намозида Қунут дуосини ўқиш.\n" +
                "НАМОЗНИНГ СУННАТЛАРИ\n" +
                "1. «Аллоҳу акбар» деб намоз бошлагандан кейин Санони ўқиш.\n" +
                "2. Санодан кейин ичида «Аъузубиллаҳ» ва «Бисмиллаҳ»ни айтиш.\n" +
                "3. Фотиҳани ўқигандан кейин махфий тарзда «омин» дейиш.\n" +
                "4. Имом рукудан кейин «Самиъаллоҳу лиман ҳамидаҳ» деб турганида «Роббана лакал ҳамд»\n" +
                "дейиш. Намозни ёлғиз ўқиганлар учун эса, иккаласини ҳам айтиш.\n" +
                "5. Фарзларнинг биридан иккинчисига ўтаётганда «Аллоҳу акбар» дейиш.\n" +
                "6. Намозда бошни жуда эгиб ҳам, жуда тикка ҳам тутмаслик, ўртамиёна ушлаш.\n" +
                "7. Рукуда қўл бармоқлари орасини очиб икки тиззани маҳкам чангаллаш, камида уч марта\n" +
                "«Субҳана роббийал ъазийм» дейиш. Аёллар бармоқларини тизза устида, жипс ҳолда тутишади,\n" +
                "тиззаларини бир оз букишади.\n" +
                "8. Саждада пешонани қўллар орасига олиш, қўл бармоқларини жипс тутиш. Бунда бош\n" +
                "бармоқ қош тўғрисига қўйилади.\n" +
                "9. Саждада эркаклар оёқлари, қўллари, бурни ва пешонаси ерга тегиб туриши, боши икки\n" +
                "қўли орасида бўлиши, билакларини ерга ҳам, қобирғасига ҳам теккизмасдан тутиши ҳамда\n" +
                "оёқларининг бармоқларини қиблага қаратиб туриши. Аёллар эса, қўлларини ёнларига жипс\n" +
                "этган ҳолда ерга теккизиб, сажда қиладилар.\n" +
                "10. Эркаклар ўтирганда чап оёғи устига ўтириб, ўнг оёғи қадамини тик тутиб, бармоқларини\n" +
                "қиблага қаратиб ўтириши, аёлларнинг эса икки оёқларини ўнг томонга қаратиб, чап қуймичига\n" +
                "ўтириши. \n" +
                "Мен ҳам намоз ўқийман\n" +
                "www.ziyouz.com кутубхонаси 17\n" +
                "11. Тик турганда икки оёқ орасини тўрт бармоқ кенглигида очиқ ушлаш. Аёллар оёқларини\n" +
                "жипс тутишади.\n" +
                "12. «Ташаҳҳуд» (Аттаҳиёт), «Саловот», «Роббана» дуоларини ўқиш.\n" +
                "13. Аввал ўнг, кейин чап томонга салом бериш.\n" +
                "НАМОЗНИНГ МУСТАҲАБЛАРИ\n" +
                "1. Кўча-кўйда ёки далаларда, умуман очиқ жойларда намоз ўқимоқчи бўлса, олдидан бирор\n" +
                "ҳайвон ёки инсон ўтмаслиги учун бир тўсиқ — сутра қўйиш.\n" +
                "2. Намоз бошлаётганда «Аллоҳу акбар» деб бош бармоқларини қулоқ юмшоғига, кафтини\n" +
                "эса қиблага қаратиш. Аёллар эса, қўлларини кўкрак баробарида кўтариб, сийналари устига\n" +
                "қўядилар.\n" +
                "3. Муаззин такбирда «Ҳаййа ъалас-солаҳ» дейиши билан ўрнидан туриш, «Қод-қоматиссолаҳ»\n" +
                "деганида, «Аллоҳу акбар» деб намозни бошлаш.\n" +
                "4. Қиёмда сажда қиладиган ерга, рукуда оёқ устларига, саждада бурнининг юмшоғига,\n" +
                "қаъдада кўкраклари ўртасига, саломда эса елкасига қараш.\n" +
                "5. Саждага боришда аввал тиззаларини, кейин қўлларини ерга қўйиш.\n" +
                "6. Намозда эсноқ келса, оғизни очмаслик. Агар бунга кучи етмаса, чап қўлининг орқаси ёки\n" +
                "ўнг қўл кафти билан оғизни ёпиш.\n" +
                "МУСОФИР НАМОЗИ\n" +
                "Бизнинг динимиз қулайлик, инсонларга марҳамат динидир. Чунончи, у мусофирларга ҳам\n" +
                "анча енгилликларни муҳайё қилиб қўйган. Яшаб турган жойидан ўртача юришда камида 18\n" +
                "соатлик (90 чақирим) масофага ўн беш кундан оз муддатни ният қилиб йўлга чиққан киши\n" +
                "қишлоғи ёки шаҳрининг охирги уйлари кўринмай қолган дақиқадан бошлаб мусофир\n" +
                "ҳисобланади. Ўн беш кунга ё бундан кўпга ният қилиб чиқилса, йўлдагина мусофир саналади,\n" +
                "бораётган манзилининг дастлабки уйлари кўрингандан бошлаб эса, муқим ҳукмига ўтади ва\n" +
                "намозларини тўлиқ ўқийди.\n" +
                "Мусофир одам тўрт ракатлик фарз намозларини икки ракатга қисқартириб (бомдод\n" +
                "намозининг фарзи каби) ўқийди. Бироқ шом намозининг уч ракат фарзи ва уч ракатлик витр\n" +
                "намозларини тўлиқ адо этади. Агар мусофир киши муқим кишига эргашиб намоз ўқиса, тўрт\n" +
                "ракатлик фарзларни ҳам тўлиқ ўқийди. Муқим киши мусофир кишига иқтидо қилиб намоз\n" +
                "ўқиётган бўлса, унда имом икки ракатдан сўнг салом бергач, эргашувчи салом бермайди, ичида\n" +
                "«Аллоҳу акбар» деб қиёмга туради-да, қолган икки ракатни мустақил ўзи ўқиб тугатади.\n" +
                "ИМОМГА ЭРГАШИШ\n" +
                "Суюкли пайғамбаримиз Муҳаммад алайҳиссалом бир ҳадиси шарифларида жамоат билан\n" +
                "ўқилган намознинг савоби ёлғиз ўқилган намознинг савобидан йигирма етти марта ортиқ\n" +
                "эканини марҳамат қилганлар.\n" +
                "Беш вақт намознинг фақат фарзлари, жума намозининг икки ракат фарзи, ҳайит намозлари,\n" +
                "Рамазон ойида таровеҳ ва витр намозлари имомга иқтидо қилиб ўқилади. Имомга эргашиб\n" +
                "жамоат билан намоз ўқийдиган киши «муқтадий» дейилади.\n" +
                "Муқтадий қуйидагиларга амал қилиши керак:\n" +
                "1. Аввало, ҳам ўқилаётган намозга, ҳам имомга эргашишга ният қилмоғи лозим. Масалан,\n" +
                "«Аллоҳ розилиги учун бугунги бомдод намозининг икки ракат фарзини ушбу имомга эргашиб,\n" +
                "ўқишни ният қилдим.\n" +
                "2. Имом ифтитоҳ такбирини айтгач, муқтадий ҳам ундан кейин дарҳол такбир айтиб, \n" +
                "Мен ҳам намоз ўқийман\n" +
                "www.ziyouz.com кутубхонаси 18\n" +
                "қўлларини боғлайди ва ичида фақат Сано (Субҳанака) дуосини ўқийди. Имомга эргашиб намоз\n" +
                "ўқиётган киши тикка турганида (қиёмда) Фотиҳа ва зам сураларни ўқимайди. Овоз чиқариб\n" +
                "ўқиладиган бомдод, шом, хуфтон намозларининг фарзида, жума намозининг фарзида, ҳайит\n" +
                "намозларида, рамазон ойида таровеҳ ва витр намозларида имом Фотиҳа сурасини тугатгач,\n" +
                "муқтадий ичида «Амийн» дейди.\n" +
                "3. Рукуда уч марта «Субҳана роббийал ъазийм», дейди. Имом «Самиъаллоҳу лиман\n" +
                "ҳамидаҳ», деб тик тургач, «Роббана лакал ҳамд», дейди. Саждаларда ҳам муқтадий уч\n" +
                "мартадан «Субҳана роббийал аъла»ни айтади.\n" +
                "4. Ўтиришларда муқтадий ичида «Аттаҳиййат», «Саловот», «Роббана» дуоларини ўқийди ва\n" +
                "имом билан бирга салом беради.\n" +
                "Имомга иқтидо қилиб жамоат билан бирга намоз ўқиётган киши барча амалларда имомдан\n" +
                "кейин ҳаракат қилади, ундан олдинга ўтиб кетмайди.\n" +
                "Жамоатга кечикиб келиб қўшилган киши такбир айтиб, имомга эргашади. Охирги ўтиришда\n" +
                "«Аттаҳиййат»ни ўқиб, имомнинг салом беришини кутади. Имом икки томонга салом берарбермас,\n" +
                "салом бермай «Аллоҳу акбар» деб тикка туради ва кечиккан ракатларни ўзи ўқиб\n" +
                "намозни тугатади.\n" +
                "Бирор ракатнинг рукусига улгурган, яъни имом ҳануз рукудан бош кўтармасидан илгарироқ\n" +
                "ният қилиб, жамоатга қўшилган киши ўша ракатни ўқиган ҳисобланади.\n" +
                "ҚАЗО НАМОЗЛАРИ\n" +
                "Мўмин-мусулмонлар намозларини доимо вақтида ўқишга ҳаракат қилишлари лозим. Лекин\n" +
                "бирор сабаб билан ўқилмай қолса, у намознинг қазоси ўқилиши керак. Фарз намозлар ва витр\n" +
                "намози қолдирилса, қазо қилиб ўқилади.\n" +
                "Қазо намози ва умуман ҳар қандай намоз ўқиш макруҳ ҳисобланган уч вақт борки, булар кун\n" +
                "чиқиш, кун ботиш ва кун тиккага келган (қиём) пайтларидир.\n" +
                "Намозни ўтказиб юбориш катта гуноҳдир. Бинобарин, қазо намози ўқилгач, Аллоҳ таолодан\n" +
                "мағфират тилаш ва ҳар намозни ўз вақтида, қазо қилмай ўқишни насиб этишини сўраб дуо\n" +
                "қилиш керак.\n" +
                "САЖДАИ САҲВ\n" +
                "Намознинг фарз ё вожибларидан бири вақтидан кечиктириб бажарилса ёки вожиб амали\n" +
                "унутилиб, бажарилмаса, қаъдаи охирада (охирги ўтиришда) фақат «Аттаҳий- йат» ўқилиб, ўнг\n" +
                "томонга салом беради ва «Аллоҳу акбар», деб икки марта сажда қилади ва яна ўтирган ҳолда\n" +
                "«Аттаҳиййат», «Саловот», «Роббана» дуоларини ўқиб, ўнг ва чап томонга салом бериб\n" +
                "намозни тугаллайди. Бу икки сажда «саждаи саҳв» (хатони ўнглайдиган сажда) дейилади.\n" +
                "ДУО\n" +
                "Аллоҳ таоло Бақара сурасининг 186-оятида шундай марҳамат қилади: «Бандаларим\n" +
                "Сиздан (эй Муҳаммад) Мен ҳақимда сўрасалар, Мен уларга яқинман. Менга дуо\n" +
                "қилган пайтларида дуогўйларнинг дуосини ижобат қиламан. Бас, ҳақ йўлига\n" +
                "юришлари учун (улар ҳам) менинг (даъватимга) жавоб қилсинлар ва менга имон\n" +
                "келтирсинлар».\n" +
                "Пайғамбаримиз Муҳаммад алайҳиссалом дуо ҳам ибодат эканини марҳамат қиладилар.\n" +
                "Бинобарин, намоз сўнгида Пайғамбаримиз томонларидан тавсия қилинган ушбу дуоларни ўқиш\n" +
                "мақсадга мувофиқдир:\n" +
                "* Эй Роббимиз, бизга бу дунёда ҳам, охиратда ҳам яхшиликни бергин ва бизни дўзах олови\n" +
                "Мен ҳам намоз ўқийман\n" +
                "www.ziyouz.com кутубхонаси 19\n" +
                "азобидан сақлагин.\n" +
                "* Илоҳо, мен Сендан ҳидоят, тақво, иффат ва ғино (бировга муҳтож бўлмаслик ҳолатини)\n" +
                "сўрайман.\n" +
                "* Аллоҳим, мени афу эт, ёрлақа, тўғри йўлдан бошла, менга офият бер, ҳалолдан\n" +
                "ризқлантир.\n" +
                "* Қалбларимизни ризолигингга уйғун бўлган амал ва ибодатга томон йўналтир.\n" +
                "* Парвардигоро, дош бериб бўлмайдиган балодан, инсонни ўлимга қадар судраб борувчи\n" +
                "(мол, жон, оилага тааллуқли) мушкулотга дуч келишдан, (мол, жон, оилага тааллуқли) балоқазодан\n" +
                "ва душманларни қувонтирадиган бир мусибатга рўбарў бўлишдан Сенинг паноҳингга\n" +
                "сиғинаман.\n" +
                "* Илоҳо, ожиз қолишдан, дангасаликдан, қўрқоқликдан, алжиратиб қўйувчи қариликдан,\n" +
                "хасталикдан, қабр азобидан, ҳаёт ва мамот фитнасидан Сенинг паноҳингга сиғинаман.\n" +
                "* Ё Роббим! Мен ўз нафсимга кўп зулм қилдим. Сендан ўзга гуноҳларни кечиргувчи йўқ.\n" +
                "Мени ёрлақа ва афу эт. Ғофур, Роҳийм ёлғиз Сенсан.\n" +
                "* Илоҳо, фойдаси тегмайдиган илмдан, қўрқмайдиган қалбдан, тўймайдиган нафсдан, қабул\n" +
                "бўлмайдиган дуолардан паноҳ бер.\n" +
                "* Аллоҳим! Дўзах ўтида ёнишимга сабаб бўладиган фитнадан, дўзах оловидан, бойлик ва\n" +
                "фақирликнинг ёмонлигидан мени асрагин.\n" +
                "* Аллоҳим! Ёмон феъл-атвор ва амаллардан, нафсоний орзулардан асрагин.\n" +
                "* Аллоҳим! Қулоғимнинг, кўзимнинг, тилимнинг, қалбимнинг, фаржимнинг ёмонлигидан\n" +
                "асрагин.\n" +
                "ҚУРЪОНИ КАРИМДАН\n" +
                "БАЪЗИ ДУОЛАР\n" +
                "Одам алайҳиссалом ва момо Ҳавво жаннатдан чиқарилганларида ушбу дуони\n" +
                "ўқиганлар:\n" +
                "«Эй Раббимиз! Биз ўзимизга (ўзимиз) зулм қилдик. Агар бизни кечирмасанг, биз, албатта,\n" +
                "зиён кўрувчилардан бўлиб қолурмиз» (Аъроф, 23).\n" +
                "Нуҳ алайҳиссаломнинг дуолари:\n" +
                "«Раббим! Мен Сендан ўзим (яхши) билмаган нарсани сўрашимдан паноҳ тилайман. Агар\n" +
                "мени кечирмасанг ва раҳм қилмасанг, албатта, зиён кўрувчилардан бўлурман» (Ҳуд, 47).\n" +
                "Лут алайҳиссаломнинг дуолари:\n" +
                "«Эй Раббим, бу бузғунчилар қавми устидан Ўзинг мени ғолиб қил!» (Анкабут, 30).\n" +
                "Иброҳим алайҳиссаломнинг дуолари:\n" +
                "«Парвардигорим, мени ва зурриётларимни намозни тўкис адо этгувчи қилгил. Парвардигоро,\n" +
                "дуоимни қабул айла. Парвардигоро, ҳисоб-китоб (қиёмат) куни мени, ота-онамни ва барча\n" +
                "мўминларни мағфират қилгил» (Иброҳим, 40-41).\n" +
                "Юсуф алайҳиссаломнинг дуолари:\n" +
                "«Эй осмонлар ва ерни ижод этган Зот! Дунё-ю охиратда Ўзинг эгамдирсан. (Ажалим\n" +
                "етганида) мусулмон ҳолимда жонимни олгин ва мени солиҳлар (қатори)га қўшгин» (Юсуф,\n" +
                "101).\n" +
                "Шуайб алайҳиссаломнинг дуолари:\n" +
                "«Аллоҳгагина таваккул қилдик. Эй Раббимиз! Биз билан қавмимиз ўртасида ҳақиқий\n" +
                "Мен ҳам намоз ўқийман\n" +
                "www.ziyouz.com кутубхонаси 20\n" +
                "ажримлик ато эт! Сен ажрим қилувчиларнинг яхшисидирсан» (Аъроф, 89).\n" +
                "Мусо алайҳиссаломнинг дуолари:\n" +
                "«Эй Раббим, бағримни кенг қилгин, ишимни осон қилгин, тилим (дан дудуқлик)ни ечиб\n" +
                "юборгин, (токи) улар (қавмим) гапимни англасинлар» (Тоҳа, 25).\n" +
                "«Парвардигорим, Ўзинг мен учун нима яхшилик, (яъни, ризқ) туширсанг, ўшанга\n" +
                "муҳтождирман» (Қасос, 21).\n" +
                "Юнус алайҳиссаломнинг дуолари:\n" +
                "«Сендан ўзга илоҳ йўқдир. Сен (барча) нуқсонлардан покдирсан. Дарҳақиқат, мен (ўзимга)\n" +
                "зулм қилувчилардан бўлдим» (Анбиё, 87).\n" +
                "Закариё алайҳиссаломнинг дуолари:\n" +
                "«Эй Раббим, мени ёлғиз ташлаб қўйма (меросхўр фарзанд ато эт), Сен (Ўзинг) ворисларнинг\n" +
                "яхшироғидирсан» (Анбиё, 89).\n" +
                "«Раббим, менга ҳам ўз ҳузурингдан пок зурриёт ато эт! Дарҳақиқат, Сен дуони\n" +
                "эшитувчидирсан» (Ол-и Имрон, 38).\n" +
                "Аҳли илмнинг дуоси:\n" +
                "«Парвардигоро, бизни ҳидоят қилганингдан кейин, энди дилларимизни ҳақ йўлдан оғдирма\n" +
                "ва бизга Ўз ҳузурингдан раҳмат ато эт!» Омийн.\n" +
                "Қуръони каримда Муҳаммад алайҳиссаломга\n" +
                "ўргатилган баъзи дуолар:\n" +
                "«Эй Раббим, мени (қабрга) содиқлик билан (гуноҳларим кечирилган ҳолимда) киритгин ва\n" +
                "(тирилтирганингда ҳам) содиқлик (розилигинг) билан чиқаргин ҳамда мен учун ўз\n" +
                "даргоҳингдан бир мадад берувчи ҳужжат ато қилгин» (Ал-Исро, 80).\n" +
                "«Эй Раббим, менга (кофирларга) ваъда қилинаётган нарса (азоб)ни кўрсатсанг-чи?! Эй\n" +
                "Раббим! (Ўшанда) мени у золимлар қавми ичида қилмагин! Эй Раббим! Мен Сендан\n" +
                "шайтонларнинг васвасаларидан паноҳ беришингни сўрайман. Яна мен Сендан, эй Раббим, улар\n" +
                "менинг ҳузуримга келишларидан паноҳ сўрайман. Эй Раббим! (Гуноҳларимизни) мағфират эт ва\n" +
                "(ҳолимизга) раҳм айла! Сен (ўзинг) раҳм қилувчиларнинг яхшисидирсан!» (Мўминун, 93, 94,\n" +
                "97, 98, 118).\n" +
                "«Парвардигорим, илмимни янада зиёда қилгин» (Тоҳа, 114).\n" +
                "«Парвардигоро, бизлар Сенга имон келтирганмиз, бас, гуноҳларимизни мағфират айла ва\n" +
                "бизни жаҳаннам азобидан асра!» (Ол-и Имрон,16).\n" +
                "НАСИҲАТ\n" +
                "Ҳаққа даъват – қутлуғ даъват,\n" +
                "Ҳой-ҳавасни унут, болам.\n" +
                "Ўлим ҳақдир, дунё фоний,\n" +
                "Азонга қулоқ тут, болам.\n" +
                "Кунда беш бор чақиради,\n" +
                "Кирларингни аритади.\n" +
                "Расул Акрамга элтади,\n" +
                "Намозингни ўқи, болам. \n" +
                "Мен ҳам намоз ўқийман\n" +
                "www.ziyouz.com кутубхонаси 21\n" +
                "Бошқа чора бўлмас асло,\n" +
                "Келмаганлар тортгай алам.\n" +
                "Шайтон сени енгмай туриб\n" +
                "Сен шайтонни енггин, болам.\n" +
                "Дилим оғрир, оёғингни,\n" +
                "Тикан тилса бу дунёда.\n" +
                "Истамайман ёнмоғингни\n" +
                "Қиёматда, жоним, болам.\n" +
                "ОЛТИ ДИНИЙ КАЛИМА\n" +
                "1. Калимаи тоййиба\n" +
                "Л`а ил`аҳа иллалл`оҳу Муҳаммадур рос`улулл`оҳ.\n" +
                "Тўғри сўз: Аллоҳдан ўзга сиғиниладиган (илоҳ) йўқдир! Муҳаммад Аллоҳнинг расулидир!\n" +
                "2. Калимаи шаҳодат\n" +
                "Ашҳаду алл`а ил`аҳа иллалл`оҳу ва ашҳаду анна Муҳаммадан ъабдуҳ`у ва рос`улуҳ.\n" +
                "Иқрорлик сўзи: Аллоҳдан ўзга сиғиниладиган (илоҳ)нинг йўқлигига ва Муҳаммад\n" +
                "Аллоҳнинг бандаси ва расули эканига иқрорман.\n" +
                "3. Калимаи тавҳид\n" +
                "Ашҳаду алл`а ил`аҳа иллалл`оҳу ваҳдаҳ`у л`а шар`ика лаҳ, лаҳул мулку ва лаҳул ҳамд(у)\n" +
                "йуҳй`и ва йум`ит(у) ва ҳува ҳаййул л`а йам`ут(у), бийадиҳил хойр(у) ва ҳува ъал`а кулли\n" +
                "шай’ин қод`ир.\n" +
                "Танҳолигига иқрорлик сўзи: Танҳо Аллоҳдан ўзга сиғиниладиган (илоҳ) йўқлигига\n" +
                "иқрорман! Аллоҳнинг шериги йўқдир. Мулк Аллоҳникидир. Мақтов Аллоҳгадир. (Аллоҳ)\n" +
                "тирилтиради ва ўлдиради. Аммо Ўзи тирикдир, ўлмайди. Яхшилик Унинг ихтиёридадир ва У\n" +
                "ҳамма нарсага қодирдир!\n" +
                "4. Калимаи радди куфр\n" +
                "Алл`оҳумма инн`и аъ`узу бика мин ан ушрика бика шай’ан ва ан`а аълам. Ва астағфирука\n" +
                "лима л`а аълам. Иннака анта ъалл`амул ғуй`уб.\n" +
                "Куфрни қайтариш сўзи: Аллоҳим, Сендан ўзим билганим ҳолда Сенга бирор нарсани\n" +
                "шерик қилишимдан асрашингни сўрайман. Сендан ўзим билмаганим ҳолда ширк қилиб қўйган\n" +
                "бўлсам, кечишингни тилайман. Албатта, Сен ғайбларни билгувчи Зотсан.\n" +
                "5. Калимаи истиғфор\n" +
                "Астағфирулл`оҳ, астағфирулл`оҳ, астағфирулл`оҳа таъ`ал`а мин кулли замбин азнабтуҳ`у\n" +
                "ъамдан ав хотоан сиррон ва ъал`анийаҳ. Ва ат`убу илайҳи миназ замбиллаз`и аъламу ва\n" +
                "миназ-замбиллаз`и л`а аълам. Иннака анта ъалл`амул ғуй`уб.\n" +
                "Гуноҳларни кечишини сўраш сўзи: Аллоҳдан гуноҳларимни кечишини сўрайман.\n" +
                "Аллоҳдан гуноҳларимни кечишини сўрайман. Аллоҳ таолодан атайлаб ё адашиб, яширин ё\n" +
                "ошкора қилган ҳамма гуноҳларимни кечишини сўрайман. Ўзим билган ва билмаган гуноҳлардан\n" +
                "Аллоҳга қайтаман. Албатта, Сен ғайбларни билгучи Зотсан.\n" +
                "6. Калимаи тамжид\n" +
                "Мен ҳам намоз ўқийман\n" +
                "www.ziyouz.com кутубхонаси 22\n" +
                "Субҳ`аналл`оҳ вал ҳамду лилл`аҳ ва л`а ил`аҳа иллалл`оҳу валлоҳу акбар. Л`а ҳавла ва\n" +
                "л`а қуввата илл`а билл`аҳил ъалиййил ъаз`им. М`а ш``аалл`оҳу к`ана ва м`а лам йаша’лам\n" +
                "йакун.\n" +
                "Улуғлаш сўзи: Аллоҳнинг айбу нуқсони йўқдир. Ва мақтов Аллоҳгадир. Аллоҳдан ўзга\n" +
                "сиғиниладиган (илоҳ) йўқдир! Аллоҳ улуғдир. Мутлоқ куч ва қувват қудратли ва буюк Аллоҳдан\n" +
                "ўзгада йўқдир. Аллоҳ ниманики хоҳласа, бўлади, ниманики хоҳламаса, бўлмайди.\n" +
                "ИЙМОНИ МУЖМАЛ\n" +
                "`Аманту билл`аҳи кам`а ҳува би асм`аъиҳ`и ва сифатиҳ`и ва қобилту жамийъа аҳк`амиҳи\n" +
                "ва арк`аниҳи.\n" +
                "Аллоҳни исми ва сифатлари билан танидим ва барча буюрган ҳукмларини қабул қилдим.\n" +
                "ИЙМОНИ МУФАССАЛ\n" +
                "`Аманту билл`аҳи ва мал`аикатиҳ`и ва кутубиҳ`и ва русулиҳ`и вал йавмил `ахири вал\n" +
                "қодари хойриҳ`и ва шарриҳ`и миналл`оҳи таъ`ал`а вал баъси баъдал мавт.\n" +
                "Мўминликнинг батафсил ифодаси: Аллоҳга, Унинг фаришталарига, китобларига,\n" +
                "расулларига, охират кунига, яхшилик ва ёмонлик Аллоҳнинг хоҳиши билан бўлишига ва\n" +
                "ўлимдан кейин қайта тирилишга ишондим.\n" +
                "ҚИРҚ ФАРЗ\n" +
                "Ислом беш фарзни ўз ичига олади:\n" +
                "1. Имон.\n" +
                "2. Намоз.\n" +
                "3. Рўза.\n" +
                "4. Закот.\n" +
                "5. Ҳаж.\n" +
                "Имон еттита фарздан иборат:\n" +
                "1) Аллоҳга;\n" +
                "2) Аллоҳнинг фаришталарига;\n" +
                "3) Аллоҳнинг китобларига;\n" +
                "4) Аллоҳнинг пайғамбарларига;\n" +
                "5) Охират кунига;\n" +
                "6) Тақдирга, яъни яхшилик ҳам, ёмонлик ҳам Аллоҳдан эканига;\n" +
                "7) Ўлимдан кейин қайта тирилмоққа ишониш.\n" +
                "Таҳоратнинг фарзлари тўртта:\n" +
                "1. Юзни сочлардан холи жойларини ияк остигача ва икки қулоқ орасидаги қисмини ювиш.\n" +
                "2. Қўлларни тирсаклари билан бирга қўшиб ювиш.\n" +
                "3. Бошнинг тўртдан бирига масҳ тортиш.\n" +
                "4. Оёқларни тўпиқлари билан бирга ювиш.\n" +
                "Ғуслнинг фарзлари\n" +
                "1. Оғизни яхшилаб чайиш.\n" +
                "2. Бурунни ачишгунча яхшилаб чайиш.\n" +
                "3. Баданнинг ҳамма жойини қолдирмасдан ювиш.\n" +
                "Таяммумнинг фарзлари\n" +
                "1. Ният. \n" +
                "Мен ҳам намоз ўқийман\n" +
                "www.ziyouz.com кутубхонаси 23\n" +
                "2. Пок тупроқни қасд қилиш.\n" +
                "3. Икки қўлни пок тупроққа уриб юзга суриш.\n" +
                "4. Қўлларни яна тупроққа уриб, тирсак билан қўшиб қўлларга суриш.\n" +
                "Намознинг фарзлари ўн иккитадир.\n" +
                "Олтитаси намоз ташқарисида, олтитаси намоз ичида.\n" +
                "Намоз ташқарисидагилар «шарт», ичидагилар «рукн» дейилади.\n" +
                "Намознинг олти шарти\n" +
                "1. Таҳорати йўқнинг таҳорат олиши, жунуб бўлганнинг ғусл қилиши.\n" +
                "2. Бадан, кийим ва намоз ўқиладиган жой тоза бўлиши.\n" +
                "3. Аврат ёпиқ бўлиши.\n" +
                "4. Қиблага қараб туриш.\n" +
                "5. Ўз вақтида ўқиш.\n" +
                "6. Ўқийдиган намозига ният қилиш.\n" +
                "Намознинг олти рукни\n" +
                "1. Ифтитоҳ такбири.\n" +
                "2. Қиём.\n" +
                "3. Қироат.\n" +
                "4. Руку.\n" +
                "5. Сажда.\n" +
                "6. Қаъда (сўнгги ўтириш).\n" +
                "Қуйидагилар ҳам фарздир:\n" +
                "1. Илм олиш.\n" +
                "2. Амри маъруф, наҳйи мункар.\n" +
                "3. Ҳалол меҳнат қилиш.\n" +
                "4. Ризқни ҳалол йўл билан топиш.\n" +
                "5. Шариат ҳалол деб белгилаган нарсаларни ейиш.\n" +
                "АЛЛОҲ ТАОЛОНИНГ ЎН ТЎРТ СИФАТИ БОР\n" +
                "Олтитаси сифати зотийа.\n" +
                "Саккизтаси сифати субутийадир.\n" +
                "Сифати зотийалари\n" +
                "1. Вужуд (Борлиги).\n" +
                "2. Қадим (Бошланғичи йўқдир).\n" +
                "3. Бақо (Охири йўқ).\n" +
                "4. Ваҳдоният (Бирдир).\n" +
                "5. Мухолафатун лил-ҳаводис (махлуқотнинг ҳеч бирига ўхшамайди).\n" +
                "6. Қиём бинафсиҳи (макондан муназзаҳдир).\n" +
                "Сифати субутийалари\n" +
                "1. Ҳаёт (Тирик).\n" +
                "2. Илм (Билувчи).\n" +
                "3. Самеъ (Эшитувчи).\n" +
                "4. Басар (Кўрувчи).\n" +
                "5. Ирода (Хоҳлаганини қилади).\n" +
                "6. Қудрат (Кучи ҳамма нарсага етади).\n" +
                "7. Калом (Сўзлайди).\n" +
                "8. Таквин (Бутун махлуқотни яратувчидир).\n" +
                "Муҳим вазифалар\n" +
                "1. Аллоҳ таолони бир деб билиб, зикр этиш. \n" +
                "Мен ҳам намоз ўқийман\n" +
                "www.ziyouz.com кутубхонаси 24\n" +
                "2. Ҳалолдан еб-ичиш.\n" +
                "3. Таҳорат олиш, ғусл қилиш.\n" +
                "4. Беш вақт намоз ўқиш.\n" +
                "5. Ризқни Аллоҳдан деб билиш.\n" +
                "6. Ҳалолдан, тоза кийим кийиш.\n" +
                "7. Аллоҳга таваккул қилиш.\n" +
                "8. Қаноаткор бўлиш.\n" +
                "9. Неъматлари учун Аллоҳга шукр қилиш.\n" +
                "10. Аллоҳнинг қазо ва қадарига рози бўлиш.\n" +
                "11. Балоларга, мусибатларга сабр этиш.\n" +
                "12. Гуноҳларга тавба қилиш.\n" +
                "13. Ихлос билан ибодат этиш.\n" +
                "14. Шайтонни душман билиш.\n" +
                "15. Ҳар бир ишда Қуръони каримни ҳужжат, дастур деб билиш.\n" +
                "16. Ўлимни ҳақ билиб, унга ҳозир бўлиш.\n" +
                "17. Яхшиликка буюриш, ёмонликдан қайтариш.\n" +
                "18. Аллоҳ севганини севиш, севмаганидан қочиш. Ҳар бир ишни Аллоҳ учун қилиш.\n" +
                "19. Ота-онага яхши муносабатда бўлиш ва уларга итоат этиш.\n" +
                "20. Қариндошларни зиёрат қилиш.\n" +
                "21. Омонатга хиёнат этмаслик.\n" +
                "22. Аллоҳдан қўрқиш.\n" +
                "23. Аллоҳга, пайғамбарга итоат қилиш.\n" +
                "24. Гуноҳлардан қочиб, ибодат билан машғул бўлиш.\n" +
                "25. Ўйлаб, тадбир билан иш кўриш.\n" +
                "26. Коинотга ибрат назари билан боқиш.\n" +
                "27. Тилни ёмон сўзлардан сақлаш.\n" +
                "28. Қалбни поклаш, беҳуда сўзларни ва ишларни тарк этиш.\n" +
                "29. Ҳеч кимга ёмонлик қилмаслик, бекорчи, фойдасиз иш қилмаслик.\n" +
                "30. Ҳеч кимни масхара этмаслик, миннат қилмаслик.\n" +
                "31. Ҳаромга қарамаслик.\n" +
                "32. Сўзига содиқ бўлиш, тўғриликдан айрилмаслик.\n" +
                "33. Сеҳр-жоду қилмаслик.\n" +
                "34. Ёмон сўзларни эшитмаслик.\n" +
                "35. Илм таҳсил этиш.\n" +
                "36. Тўғри ўлчаш ва тўғри тортиш.\n" +
                "37. Аллоҳнинг азобидан қўрқиш.\n" +
                "38. Фақирга садақа бериш, муҳтожга ёрдам бериш.\n" +
                "39. Аллоҳнинг раҳматидан умид узмаслик.\n" +
                "40. Нафсга (ёмон орзуларга) тобе бўлмаслик.\n" +
                "41. Аллоҳ учун ейиш, едириш.\n" +
                "42. Кифоя қиладиган даражада ризқ талаб этиш.\n" +
                "43. Молининг закотини бериш.\n" +
                "44. Ҳайз ва нифос ҳолатида хотинига яқинлашмаслик.\n" +
                "45. Қалбини маъсият ва ёмонликлардан тозалаш.\n" +
                "46. Кибр қилмаслик.\n" +
                "47. Етимнинг молини сақлаш.\n" +
                "48. Беш вақт намозни вақтида ўқиш.\n" +
                "49. Зулм ва ҳақсизлик билан халқнинг молини емаслик.\n" +
                "50. Алллоҳга ширк келтирмаслик. \n" +
                "Мен ҳам намоз ўқийман\n" +
                "www.ziyouz.com кутубхонаси 25\n" +
                "51. Шароб ичмаслик, қимор ўйнамаслик, пора олмаслик, пора бермаслик.\n" +
                "52. Зинодан қочиш.\n" +
                "53. Бекорчи ишлар учун қасам ичмаслик. \n" +
                "Мен ҳам намоз ўқийман\n" +
                "www.ziyouz.com кутубхонаси 26\n" +
                "Ҳар хил дуолар\n" +
                "Роббиғфир варҳам ваҳдин`и илат-тор`иқил-ақвам ва та-ж`аваз ъамм`а таълам,\n" +
                "иннака антал-аз`изул акрам.\n" +
                "Алл`оҳумма инн`и ас’алукал-ъафва вал-ъ`афийата фид-дунй`а вал-`ахиро.\n" +
                "Парвардигорим, мени раҳмат ва мағфират эт. Тўғри йўлга бошла. Ўзинг билган\n" +
                "гуноҳларимни кечир. Ўзинг карамлисан. Илоҳо, Сендан афв ва офият тилайман икки дунёда.\n" +
                "Алл`оҳумма инн`и ас’алукал-ҳуд`а ват-туқ`о вал-ъаф`афа вал ғин`а.\n" +
                "Алл`оҳуммағфирл`и варҳамн`и ваҳдин`и ваъ`афин`и варзуқн`и.\n" +
                "Алл`оҳумма й`а мусоррифал-қул`уби сорриф қул`убана ъал`а т`оъатик.\n" +
                "Алл`оҳумма инн`и аъ`узу бика минал ъажзи вал-касали вал-жубни вал-ҳарами\n" +
                "вал-бухли ва аъ`узу бика мин фитнатил-маҳй`а вал-мам`ати ва долиъ ад-дайни ва\n" +
                "ғолабатир-риж`ал.\n" +
                "Илоҳо, мен Сендан ҳидоят, тақво, ўртача бойлик тилайман. Илоҳо, мени мағфират эт ва\n" +
                "раҳматингга сазовор қил. Илоҳо, қалбимизни ўз тоатингга мойил қил. Илоҳо, Сендан ожизлик,\n" +
                "дангасалик, қўрқоқлик, бахиллик каби иллатдан паноҳ беришингни сўрайман. Яна Сендан ҳаёт\n" +
                "ва мамот фитналаридан, ортиқча қарздор бўлишдан ва ғанимларга мағлуб бўлишдан паноҳ\n" +
                "тилайман.\n" +
                "Алл`оҳумма инн`и аъ`узу бика минал-ъажзи вал касали вал жубни вал бухли\n" +
                "вал ҳамми ва ъ`азабил-қобри.\n" +
                "Алл`оҳумма `ати нафси тақв`аҳ`а ва заккиҳ`а анта хойру ман закк`аҳ`а, анта\n" +
                "вал`ийуҳа ва мавл`аҳ`а.\n" +
                "Илоҳо, Сендан ожизлик, дангасалик, қўрқоқлик, бахиллик, ғам-ташвиш, қабр азоби каби\n" +
                "нарсалардан паноҳ сўрайман. Илоҳо, менга тақво насиб эт, нафсимни пок эт. Сен барча\n" +
                "инсонларнинг соҳиби – эгасисан.\n" +
                "Алл`оҳумма инн`и аъ`узу бика мин шарри самъи ва мин шарри басари ва мин\n" +
                "шарри лис`ани ва мин шарри қолби ва мин шарри ниййати.\n" +
                "Илоҳо, мен Сендан эшитиш, кўриш ва гапириш ва дилдан ўтказиш жараёнида учрайдиган\n" +
                "ёмонликлардан паноҳ беришингни сўрайман.\n" +
                "Алл`оҳумма инн`и аъ`узу бика минал бароси вал-жун`уни вал-жуз`ами ва\n" +
                "саййи’ил-асқом.\n" +
                "Алл`оҳумма инн`и аъ`узу бика миннат-тараддий ва аъ`узу бика минал-ғароқи\n" +
                "вал ҳарфи вал-ҳарами ва аъ`узу бика ан йатахаббатониш-шайт`ону ъиндал-мавт ва\n" +
                "аъ`узу бика ан ам`ута ф`и саб`илика мудбирон ва аъ`узу бика ан ам`ута лад`иғон.\n" +
                "Илоҳо, мен Сендан ёмон касалликлардан ва қаттиқ беморликлардан паноҳ сўрайман.\n" +
                "Илоҳо, турли офатлардан ва балолардан, оғир дамда шайтоннинг васвасасидан ва ёмон\n" +
                "фожиали ўлимлардан асрашингни сўрайман.\n" +
                "Алл`оҳумма инн`и ас’алука мин хойри м`а са’алака минҳу набиййука\n" +
                "Муҳаммадун соллалл`оҳу ъалайҳи ва саллам ва наъ`узу бика мин шарри м`а\n" +
                "истаъазака минҳу набиййука Муҳаммадун соллалл`оҳу алайҳи ва саллам ва анталмустаъану\n" +
                "ва ъалайкал-бал`ағу ва л`а ҳавла ва л`а қуввата илл`а билл`аҳ.\n" +
                "Илоҳо, пайғамбаринг Муҳаммад алайҳиссалом сўраган нарсалардан мен ҳам сўрайман,\n" +
                "пайғамбаринг паноҳ тилаган нарсалардан мен ҳам паноҳ тилайман. Ўзинг ёрдам берувчисан.\n" +
                "Сендан ўзгада куч-қувват йўқ.\n" +
                "Алл`оҳумма солли ва саллим ъал`а Муҳаммадин ва ъал`а `али Муҳаммад.\n" +
                "Илоҳо, пайғамбаринг Муҳаммад алайҳиссаломга саловот ва саломлар нозил эт.\n" +
                "Алл`оҳумма иннака қулта удъ`уни астажибу лакум ва иннака л`а тухлифулм`иъ`ад,\n" +
                "ва инн`и ас’алука кам`а ҳадайтан`и лил’исл`ами ан л`а танзаъаҳ`у\n" +
                "минн`и, ҳатта татаваффан`и ва ан`а муслим`ун.\n" +
                "Мен ҳам намоз ўқийман\n" +
                "www.ziyouz.com кутубхонаси 27\n" +
                "Эй бор Худоё, дуо қилинглар менга, ижобат қиламан, деб Ўзинг айтдинг, албатта Сен\n" +
                "ваъдангга хилоф қилмагайсан. Эй бор Худоё, ҳидоят неъматини бериб мени Исломга мушарраф\n" +
                "қилдинг, энди уни мендан жудо қилмагин ва то ўлгунимча Исломда бўлишимни насиб эт.\n" +
                "Илоҳо, Ўзинг бизларни бу динда собитқадам эт.\n" +
                "Алл`оҳумма инн`и ас’алука ийм`анан д`а’иман ва яқ`инан с`одиқон ва ъилман\n" +
                "н`афиъан ва қолбан х`ошиъан ва лис`анан з`акиран ва ас’алука ъафва валъ`афийата\n" +
                "вал-маъ`аф`атан д`а’имата фид-дунй`а вал-`ахиро.\n" +
                "Илоҳо, Сендан доимий имон, мустаҳкам эътиқод, фойдали илм, қўрқувчи қалб, зикр этувчи\n" +
                "тил, афву офият ва дунёю охиратда доимо хотиржамликни сўрайман.\n" +
                "Алл`оҳумма й`а муқоллибал-қул`уби саббит қолби ъал`а д`иник.\n" +
                "Алл`оҳумма аъинн`и ъал`а зикрика ва шукрика ва ҳусни ъиб`адатик.\n" +
                "Илоҳо, Сен дилларни ўзгартириб турувчисан, менинг дилимни Ўз динингга собит эт.\n" +
                "Илоҳо, Ўзинг Сени зикр этишимга, Сенга шукр этишимга ва чиройли ибодат қилишимга\n" +
                "ёрдам қил.\n" +
                "Субҳ`аналл`оҳи ъадада холқиҳ`и, субҳ`аналл`оҳи риз`оа нафсиҳ`и,\n" +
                "субҳ`аналл`оҳи з`ината ъаршиҳ`и, субҳ`аналл`оҳи мид`ада калим`атиҳ`и.\n" +
                "Аллоҳга барча махлуқларининг ададича тасбиҳ айтамиз ва Унга ўзининг ризолиги\n" +
                "баробарида ва аршининг оғирлиги баробарида ва сўзларининг сиёҳлари баробарида тасбиҳ\n" +
                "айтамиз.\n" +
                "Роббан`а л`а ту`ахизн`а ин нас`ин`а ав ахто’н`а.\n" +
                "Роббан`а ва л`а таҳмил ъалайн`а исрон кам`а ҳамалтаҳ`у ъалал-лаз`ина мин\n" +
                "қоблин`а.\n" +
                "Роббан`а ва л`а туҳаммилн`а м`а л`а т`оқоталан`а биҳ, ваъфу ъанн`а вағфир\n" +
                "лан`а варҳамн`а, анта Мавл`ан`а фансурн`а ъалал-қовмил-к`афир`ин.\n" +
                "Парвардигоро, агар эсимиздан чиқарсак, хатога йўл қўйсак, бизларни жавобгар қилма,\n" +
                "бизларнинг зиммамизга олдинги умматларга юклаганингдек оғир юкларни юклама, тоқатимиз,\n" +
                "имкониятимиз йўқ нарсаларни бизларга қарз қилма, бизларни кечир, афву мағфират эт,\n" +
                "раҳматингга ол, Сен бизларнинг ҳожамизсан, кофирлар устидан бизларга ёрдам бер.\n" +
                "Алл`оҳумма инн`и аъ`узу бика минал-қосвати вал ғофлати вал-ъайлати ваззиллати\n" +
                "вал масканати. Ва аъ`узу бика миналкуфри вал фақри вал-фус`уқи вашшиқ`оқи\n" +
                "ван-ниф`ақи, ва су’ил-ахл`ақи, ва зийқил-арз`оқи, вас-сумъати, варрий`аи,\n" +
                "ва аъ`узу бика минас-сомами вал-баками вал-ъам`а вал-жун`уни валжуз`ами\n" +
                "вал-бароси ва саййи’ил-асқом.\n" +
                "Илоҳо, Сендан тошбағирлик, ғафлат, қашшоқлик, хорлик, мискинлик каби иллатлардан\n" +
                "паноҳ сўрайман. Яна Сендан куфрдан, фақирликдан, фисқу фужурдан, низо ва ихтилофдан,\n" +
                "ёмон руҳлардан, ризқи тангликдан, риёкорликдан, кўру кар бўлишликдан, жиннилик ва ёмон\n" +
                "касалликлардан паноҳ сўрайман.\n" +
                "Зам-зам ичилганда ўқиладиган дуо\n" +
                "Алл`оҳумма инн`и ас’алука ъилман н`афиъан ва қолбан х`ошиъан ва н`уран\n" +
                "с`атиъан ва ризқон в`асиъан ва шиф`аан мин кулли д`аин. Алл`оҳумма инн`и\n" +
                "ашробуҳ`у литағфирол`и. Алл`оҳумма фағфирл`и. Алл`оҳумма инн`и ашробуҳ`у\n" +
                "мусташфийан биҳ`и. Алл`оҳумма фашфин`и.\n" +
                "Илоҳо, Сендан фойдали илм, тақволи қалб ва ёруғ нур ва кенг ризқ ва барча иллатлардан\n" +
                "шифо тилайман. Илоҳо, бу Зам-зам сувини Сендан мағфират сўраб ва дардларимга шифо\n" +
                "талабида ичмоқдаман, Ўзинг шифо бер. \n" +
                "Мен ҳам намоз ўқийман\n" +
                "www.ziyouz.com кутубхонаси 28\n" +
                "Равзаи муборакда ўқиладиган дуо\n" +
                "Ассал`аму ъалайка й`а рас`улалл`оҳи! Ассал`аму ъалайка й`а хийраталл`оҳи мин\n" +
                "холқиҳ`и! Ассал`аму ъалайка й`а ҳаб`ибалл`оҳи! Ассал`аму ъалайка й`а саййидалмурсал`ина\n" +
                "ва х`отаман-набийй`ина! Ассал`аму ъалайка ва ъал`а `алика ва\n" +
                "асҳ`абика ва аҳли байтика ва ъалан-набийй`ина ва с`аъирис-с`олиҳ`ина! Ашҳаду\n" +
                "аннака баллағтар-рис`алата ва аддайтал-ам`аната ва насоҳтал-уммата, фа\n" +
                "жаз`акалл`оҳу ъанна афзола м`а жаз`а рас`улан ъан умматиҳи.\n" +
                "Алл`оҳумма солли ъал`а Муҳаммадив-ва ъал`а `али Муҳаммад. Кам`а соллайта\n" +
                "ъал`а Иброҳ`има ва ъал`а `али Иброҳ`им. Иннака ҳам`идум-маж`ид.\n" +
                "Ва б`арик ъал`а Муҳаммадив-ва ъал`а `али Муҳаммад. Кам`а б`арокта ъал`а\n" +
                "Иброҳ`има ва ъал`а `али Иброҳ`им. Иннака ҳам`идум-маж`ид.\n" +
                "Алл`оҳумма иннака қулта: «Ва лав аннаҳум из золам`у анфусаҳум жа’ука фастағфарулл`оҳа\n" +
                "ва-стағфара лаҳумур-рос`улу л`а важадулл`оҳа тавв`абан\n" +
                "роҳ`има». Ва қод атайтука й`а рас`улалл`оҳи мустағфирон мин зун`уби,\n" +
                "мусташфиъан бика ил`а робб`и, фа ас’алука й`а робб`и ан туж`иба лийалмағфирота\n" +
                "кам`а авжабтаҳ`а лиман ат`аҳу фи ҳай`атиҳи. Алл`оҳумма-жъалҳу авва\n" +
                "лаш-ш`афиъ`ина й`а арҳамар-р`оҳим`ин.\n" +
                "Маъноси: Ў Расулуллоҳ сизга салом, эй халқларнинг энг афзали, сизга салом, эй Ҳабибуллоҳ,\n" +
                "сизга салом, эй пайғамбарларнинг саййиди, сизга салом, эй пайғамбарларнинг хотами, сизга\n" +
                "салом! Сизга ва аҳли аёлингизга ва саҳобаларингизга ва барча пайғамбарлар ва солиҳ\n" +
                "бандаларга саломлар бўлсин. Гувоҳлик бераманки, сиз пайғамбарлик вазифангизни тўғри адо\n" +
                "этдингиз. Аллоҳнинг омонатини топширдингиз, умматларингизга насиҳат қилдингиз, Сизга\n" +
                "Аллоҳ ажру азимлар ато қилсин. Илоҳо, Муҳаммад алайҳиссаломга, оли асҳобларига Ўзинг\n" +
                "салавотлар юборгин ва У кишига ва оли асҳобларига баракотлар нозил қилгин, чунончи\n" +
                "Иброҳим алайҳиссаломга нозил қилганинг каби. Илоҳо, Ўзинг Қуръони каримда марҳамат\n" +
                "қилдингким, «Агар улар ўзларига ўзлари зулм қилганларидан ке-йин пайғамбарим ҳузурига\n" +
                "келиб истиғфор этсалар ва пайғамбарим ҳам истиғфор этса, Аллоҳ таоло уларнинг\n" +
                "тавбаларини қабул этувчи, меҳрибон зотдир», дегансан. Мана, Расулуллоҳ ҳузурига истиғфор\n" +
                "айтиб, Аллоҳдан гуноҳимизни сўраб келдик, Уни шафоатчи қилдик, Парвардигор ҳузурига\n" +
                "тавба қилдик, Аллоҳ ўзи Расулуллоҳнинг шафоатлари билан бизларни мағфират қилишини\n" +
                "сўраймиз.\n" +
                "Саҳобалар ўқиган дуолар\n" +
                "Абдуллоҳ ибн Масъуднинг (р.а.) дуолари\n" +
                "Аллоҳим! Сендан ортга қайтмайдиган (бақувват) бир имон, туганмас неъмат ва ҳулд\n" +
                "жаннатининг энг юқори даражасида Пайғамбаринг ила бирга бўлишликни сўрайман.\n" +
                "Роббан`а аслиҳ байнан`а, ваҳдин`и суб`улал-Исл`ами, ва нажжина миназ-зулум`ати иланн`ур,\n" +
                "васриф аннал-фав`аҳиша м`а зоҳаро, вам`а батана, ва б`арик лан`а фий асм`аъин`а ва\n" +
                "абс`орин`а ва қул`убин`а ва азв`ажин`а ва зуррийй`атин`а ва туб ъалайн`а иннака антаттавв`абур-роҳ`ийму,\n" +
                "важъална ш`акирийна, ли неъматика, мусн`ийна биҳа, қо`илийна биҳ`а\n" +
                "ва атмимҳ`а ъалайн`а.\n" +
                "Эй Раббимиз! Ораларимизни ислоҳ эт, бизни исломият йўлига ҳидоят айла, бизни\n" +
                "зулматдан ёруғликка чиқар. Юзимизни ошкор ва яширин барча ёмонликлардан ўгир.\n" +
                "Кўзларимизни, қулоқларимизни, қалбларимизни, ишларимизни ва фарзандларимизни бизга\n" +
                "муборак қил, гуноҳларимизни кечир. Шубҳасиз, Сен ўта марҳаматли ва гуноҳларни\n" +
                "кечиргувчисан. Бизни неъматингга шукр этувчи, ҳамд айтувчи қил ва неъматингни биздан\n" +
                "аяма! \n" +
                "Мен ҳам намоз ўқийман\n" +
                "www.ziyouz.com кутубхонаси 29\n" +
                "(«Ал-Канз», «Ал-Мунтаҳаб»дан)\n" +
                "Абдураҳмон ибн Авфнинг (р.а.) дуоси\n" +
                "Абу Ҳаййож ал-Асадийдан (р.а.): «Бир куни Байтуллоҳни тавоф қиларкан, бир одамнинг\n" +
                "фақатгина тинимсиз: «Аллоҳим! Мени нафсимнинг очкўзлиги (таъмагирлиги) дан асра!» дея\n" +
                "дуо қилаётганини кўрдим. Унга яқинлашиб дедим:\n" +
                "– Аллоҳдан шундан бошқа сўрайдиган нарсанг йўқми? Фақат биргина дуони қайтаряпсан?\n" +
                "– Агар нафсимнинг очкўзлигидан (таъмагирлигидан) сақлансам, на ўғрилик, на зино ва на\n" +
                "бирор гуноҳ қиламан, – деди.\n" +
                "Қарасам, бу одам Абдураҳмон ибн Авф розийаллоҳу анҳу экан.\n" +
                "(Тафсири Ибни Касирдан)\n" +
                "Ҳазрати Алининг (р.а.) дуолари\n" +
                "Аъ`узу бика мин жаҳдил бал`аи ва даркиш-шиқ`а’и ва шаматат’ил аъд`а’и ва аъ`узу бика\n" +
                "минас-сижни вал-қойди вас-савти.\n" +
                "Аллоҳим! Бало ва мусибатлардан, омадсизликдан, душманлар билан тортишишдан, ҳибс\n" +
                "этилишдан, кишанланишдан ва калтакланишдан паноҳ тилайман.\n" +
                "Алл`оҳумма инн`а зун`убий л`а тазуррука ва инн`а раҳматака ийй`айа л`а танқусука.\n" +
                "Аллоҳим! Менинг гуноҳларим Сенга зарар бермайди, Сенинг менга марҳамат қилишинг\n" +
                "Сендан ҳеч нарсани камайтириб қўймайди.\n" +
                "Ҳазрати Абу Бакрнинг (р.а.) дуолари\n" +
                "Алл`оҳумма ҳаблий ийм`анан ва яқ`ийнан ва муъ`аф`атан ва ниййатан.\n" +
                "Аллоҳим! Менга имон, сидқидиллик, соғлиқ, офият ва соғлом бир ният бер.\n" +
                "Алл`оҳуммажъал хойро ъум`урий `ахироҳу ва хойро амали ва хав`атимаҳу ва хойро\n" +
                "айй`амий явма алқ`ока.\n" +
                "Аллоҳим! Умримнинг энг хайрлиси, умримнинг сўнги, амалимнинг энг хайрлиси, амалимнинг\n" +
                "сўнги ва кунларимнинг энг хайрлиси Сенинг ҳузурингга чиқадиган куним бўлсин».\n" +
                "Ҳазрати Умарнинг (р.а.) дуолари\n" +
                "Алл`оҳумма инн`ий аъ`узу бика ан таъхузан`ий ъал`а ғирратин ав тазаран`ий фий\n" +
                "ғафлатин, ав тажъалн`ий-ғ`офил`ийна.\n" +
                "Аллоҳим! Мени ногаҳон ўлимдан ёхуд ғафлатда қолдиришинг ёки ғофиллардан\n" +
                "қилишингдан паноҳ тилайман.\n" +
                "Алл`оҳумма таваффан`ий маъал абр`ори, ва л`а тажъалн`ий фил ашр`ари ва қ`иний\n" +
                "аз`абанн`ари ва алҳиқний бил-аҳй`ар.\n" +
                "Аллоҳим! Мени яхшилар орасида ўлдир, ёмонлардан қилма, оташ азобидан асра ва\n" +
                "яхшилар қаторига қўшгин.\n" +
                "Ҳазрати Билолнинг (р.а.) дуоси\n" +
                "Аллоҳим! Менинг ёмонликларим ва нуқсонларимни кечиргин.\n" +
                "Абу Дардонинг (р.а.) дуоси\n" +
                "Билол ибн Саъддан (р.а.):\n" +
                "Абу Дардо (р.а.) дер эди.:\n" +
                "– Аллоҳим! Хаёл тарқоқлигидан паноҳ сўрайман.\n" +
                "– Хаёл тарқоқлиги нима? – дея сўрашди.\n" +
                "– Кишининг ҳар бир дарада бир нарсасининг бўлишидир, – дея жавоб берди у.\n" +
                "– Аллоҳим! Олимларнинг қалбларининг менга лаънат ўқишидан паноҳ сўрайман, – дея дуо\n" +
                "Мен ҳам намоз ўқийман\n" +
                "www.ziyouz.com кутубхонаси 30\n" +
                "қилган Абу Дардодан сўрашди:\n" +
                "– Олимларнинг қалбларининг лаънат ўқишлари қандай бўлади?\n" +
                "– Ичларидан менга нисбатан нафрат этишларидир, – деди Абу Дардо.\n" +
                "Зайд ибн Собитнинг (р.а.) дуоси\n" +
                "Аллоҳим! Сендан бола-чақам ва қўл остимда менга қараб қолган қулларимни боқишга\n" +
                "етгулик бойлик сўрайман. Ва бирор қариндошимнинг қариндошлик ҳақини адо этолмаганим\n" +
                "учун мени баддуо қилишидан паноҳ тилайман.\n" +
                "Саъд ибн Убоданинг (р.а.) дуоси\n" +
                "Аллоҳим! Сенга ҳамд айтишни менга насиб эт ва шараф эҳсон айла.\n" +
                "Ибни Аббоснинг (р.а.) дуоси\n" +
                "Аллоҳим! Мени берган ризқингга қаноат этгувчилардан айла, менга берган ризқни\n" +
                "баракотли қил ва орқада қолдирган ҳар нарсамни Ўзинг асра.\n" +
                "Анаснинг (р.а.) дуоси\n" +
                "Аллоҳим, уни (мусулмон биродаримни), кечалари ибодат қилувчи ва кундузлари рўзадор\n" +
                "яхшилар дуосининг баракотидан маҳрум этма.\n" +
                "Ҳажда ва Умрада ўқиладиган дуолар\n" +
                "Аллоҳдан ўзга илоҳ йўқ, Унинг шериги ҳам йўқ. Аллоҳ улуғдир, Унга кўп ҳамдлар айтамиз.\n" +
                "Бутун оламнинг Парвардигори бўлмиш Аллоҳга тасбиҳ айтамиз, ҳеч қандай куч-қувват\n" +
                "Аллоҳдан ўзгада йўқдир. У Азизу Ҳакимдир. Илоҳо, мени мағфират эт ва раҳмат қил ва ҳидоят\n" +
                "йўлига бошла ва ризқимни зиёда қил. Илоҳо, Сендан розилигингни сўрайман ва хотиржам\n" +
                "тирикчилик қилиш ва вафотимдан кейин ҳам тинч бўлишни сўрайман ва Сенинг дийдорингга\n" +
                "назар қилишлик лаззатидан насиб этишингни сўрайман ва Сенга ҳеч қандай зарар кўрмаган\n" +
                "ҳолимда йўлиқишни сўрайман. Бировга зулм қилишдан ва бировлар ҳам менга зулм қилишидан\n" +
                "Ўзинг асра. Ҳалол касбларни насиб эт. Гуноҳларимни кечир. Илоҳо, мен Сендан мустаҳкам\n" +
                "иймон ва туганмас неъмат, доимий шодлик ва пайғамбаринг Муҳаммад алайҳиссаломга\n" +
                "рафиқликни сўрайман. Эй Худоё, барча пок нарсаларни ва хайрли ишларни ва гуноҳлардан\n" +
                "узоқлашишни, камбағал бечораларни дўст тутишни бизга насиб эт. Сендан муҳаббат ва Сени\n" +
                "суймоқни ва Сен севган бандаларни ҳам севмоқни сўрайман, муҳаббатингга сабаб бўладиган\n" +
                "амалларни билдиришингни сўрайман ва тавбаларимизни қабул этиб, мағфират этишингни\n" +
                "сўрайман ва фитналардан тинч қилишингни илтижо қиламан.\n" +
                "Илоҳо, Ўзингга тақво қиладиган, гуноҳларига ўкинадиган ва Сенга таваккул қиладиган\n" +
                "қалбларни бизга насиб эт. Илоҳо, Сендан улуғ ишларни адо этишни, мағфиратингни ва\n" +
                "раҳматингга сабаб бўладиган амалларни қилишни насиб этишингни сўраймиз. Гуноҳлардан\n" +
                "саломатлик ва яхши ишларни ғанимат билишликни бизларга ато эт, жаннатингга эришишлик ва\n" +
                "дўзахингдан омонда бўлишликни насиб айла.\n" +
                "Якка Аллоҳдан ўзга илоҳ йўқ. Барча мулку ашё Унга хосдир. Унга ҳамду сано айтамиз. У\n" +
                "барча нарсаларга қодир. Илоҳо, намозимиз ҳам ибодатларимиз, ҳаёту мамотларимиз барчаси\n" +
                "Сенинг учундир. Сенинг ҳузурингга борурмиз ва мулкларимиз Сенга мерос қолур. Илоҳо, мен\n" +
                "ўз нафсимга ўзим зулм қилдим, фақат ўзинг гуноҳларни кечиргувчисан. Ўзинг кечир ва раҳмат\n" +
                "эт, Сен кечиргувчи меҳрибон Зотсан. Бизларга ҳақиқий тавбани, қайтиб гуноҳ қилмайдиган\n" +
                "тавбаларни ато эт. Бизларни тўғри йўлга бошла, гуноҳ ишлардан узоқлаштир. Ҳалол ризқингни\n" +
                "бер. Ўзингдан бошқага муҳтож этма. Қалбимизни ва қабримизни мунаввар қил, барча\n" +
                "ёмонликлардан паноҳ бер, барча яхшиликларни ато эт. Илоҳо, ўзимга-ўзимни топшириб қўйма. \n" +
                "Мен ҳам намоз ўқийман\n" +
                "www.ziyouz.com кутубхонаси 31\n" +
                "Қийинчиликлардан сақла. Илоҳо, ҳақиқий, асосий ишим бўлмиш динимни ислоҳ эт, яшаб турар\n" +
                "жойим саналмиш дунёйимни ислоҳ эт, борадиган жойим бўлмиш охиратимни ислоҳ эт.\n" +
                "Ҳаётимни фақат яхшиликларни зиёда қилишликка сарф қилишимни ва ўлимни эса барча\n" +
                "ёмонликлардан роҳат бўлишини насиб қил. Илоҳо, бизни, ота-оналаримизни,\n" +
                "зурриётларимизни, биродар ва аҳлимизни ва ғойиб мусулмон-мўминларни Ўзинг мағфират эт.\n" +
                "Илоҳо, офият ва тинчлигимизни биздан жудо қилма, ғазабингдан Ўзинг асра. Илоҳо, бу дунё ва\n" +
                "охиратда ҳидоят қил ва мағфират эт. Тирикчилигимизни яхшила ва байтингни зиёрат қилиб,\n" +
                "ҳаж ибодатларини адо этадиган ҳожилардан қил. Илоҳо, Сен менинг сўзларимни эшитасан,\n" +
                "турган жойимни биласан, махфий ва ошкора ишларимдан хабардорсан, Сенга бирор нарса\n" +
                "махфий эмас. Мен эса бир бечора фақирман, Ўзингдан нажот сўрайман. Гуноҳимга иқрорман,\n" +
                "Сендан бир мискин каби сўрайман ва илтижо қиламан, дуоларимни ижобат эт. Илоҳо,\n" +
                "ижобатдан маҳрум этма. Илоҳо, Сен меҳмон-дўстликни яхши кўрасан, биз Сенинг\n" +
                "меҳмонларингмиз, бизни жаннатинг билан зиёфат қил. Меҳмонларга мукофот ва совға\n" +
                "берилади, Сен бизга ўз раҳматинг ва мағфиратинг ва жаннатингни совға эт. Биз Сенинг\n" +
                "байтингга ҳар томондан келдик, умид билан келган бандаларингнинг дуоларини ижобат қил.\n" +
                "Исми Аъзам дуоси\n" +
                "Анас ибн Моликдан, розийаллоҳу анҳу: «Ҳазрати Пай-ғамбаримиз ҳузурларида бир одам\n" +
                "намоз ўқир эди. Одам намоздан сўнг дуо қилиб, шундай деди: «Алл`оҳумма инн`ий\n" +
                "аc’алука би анна лакал-ҳамду л`а ил`аҳа илл`а Антал Манн`ану б`адиъуссам`ав`ати\n" +
                "вал-арзи, й`а зал-жал`али вал-икр`ом, й`а Ҳаййу й`а Қўйй`ум».\n" +
                "«Аллоҳим, Сендан ушбулар ҳурматига сўрайманки, ҳамд Сенга хосдир. Сендан Ўзга ҳеч бир\n" +
                "илоҳ йўқдир. Сен Маннонсан: мўл-кўл берувчисан, осмонлару ерни бемисл яратган Сенсан. Эй\n" +
                "жалол ва икром эгаси! Эй мавжудотга ҳаёт бергувчи, уларнинг ҳаётини давом эттиргувчи\n" +
                "Аллоҳим! Дуойимни қабул айла!»\n" +
                "Расули акрам, соллаллоҳу алайҳи ва саллам, бу дуони эшитиб, шундай марҳамат қилдилар:\n" +
                "«Аллоҳ таолога исми аъзами билан дуо қилди. Аллоҳ, у исмининг ҳаққи-ҳурмати, истаса,\n" +
                "дуони қабул қилади».\n" +
                "* * *\n" +
                "Саъд ибн Аби Ваққосдан (р.а) ривоят қилинишича, Пайғамбаримиз, соллаллоҳу алайҳи ва\n" +
                "саллам, шундай деганлар: «Зуннун (Юнус) алайҳиссалом балиқ қорнида бундай дуо қилган:\n" +
                "«Л`а ил`аҳа илл`а анта субҳ`анака инн`ий кунту миназ-з`олим`ийн».\n" +
                "«Сендан ўзга илоҳ йўқдир. Сен барча нуқсонлардан покдирсан. Дарҳақиқат, мен (ўзимга)\n" +
                "зулм қилувчилардан бўлдим» (Анбиё, 87).\n" +
                "Шуниси аниқки, бир мусулмон бирор нарса истаб, бу билан дуо қилса, Аллоҳ қисқа пайтда\n" +
                "унинг дуосини қабул қилади» (Термизий. «Даъват», 3505-ҳадис).\n" +
                "Ҳазрати Ойиша (р.а.): «Бир куни Аллоҳ Расулининг, соллаллоҳу алайҳи ва саллам, бундай\n" +
                "дуо қилаётганларини эшитдим: «Алл`оҳумма инн`ий ас’алука бисмикат-т`оҳирит-тоййибилмуб`арокил-аҳабби\n" +
                "илайкал-лаз`ий из`а дуъийта биҳ`и ажабта ва из`а су’илта биҳ`и аътойта\n" +
                "ва изас-турҳимта биҳ`и роҳимта ва изас-туфрижта биҳ`и фаррожта».\n" +
                "«Аллоҳим, Сенинг пок, чиройли, муборак ва Сен учун энг севимли ва гўзал бўлган исминг\n" +
                "ҳаққи-ҳурматига Сендан сўрайман. У исминг-ла дуо қилинса, қабул этасан. Унинг ҳурматидан\n" +
                "Сендан бир нарса сўралса, берасан. Унинг ҳурматидан марҳамат исталса, марҳамат этасан.\n" +
                "Унинг ҳурматидан Сендан қийинчиликлардан холос бўлиш сўралса, қутқарасан. Ғамандуҳларни\n" +
                "кетказасан» (Ибн Можа. «Дуо», 3859-ҳадис).\n" +
                "Мен ҳам намоз ўқийман\n" +
                "www.ziyouz.com кутубхонаси 32\n" +
                "Асмо бинти Язиддан (р.а.): «Жаноб Пайғамбаримиз шундай марҳамат қилганлар: Исми Аъзам\n" +
                "ушбу икки оятдадир: «Ва ил`аҳукум ил`аҳун в`аҳид, л`а ил`аҳа илл`а ҳувар-роҳм`анирроҳ`ийм».\n" +
                "\n" +
                "«Сизнинг илоҳингиз яккаю ягона Тангридир. У меҳрибон ва раҳмли бўлиб, Ундан бошқа илоҳ\n" +
                "йўқдир». (Абу Довуд. «Солат», 1496-ҳадис).\n" +
                "Иккинчиси «Ол-и Имрон» сурасининг илк оятларидир: «Ал`иф, л`ам, м`им. Алл`оҳу л`а\n" +
                "ил`аҳа илл`а ҳувал-ҳаййул-қой-й`ум».\n" +
                "«Алиф, лом, мим. Аллоҳ — Ундан ўзга илоҳ йўқдир. У тирик ва абадий турувчидир» (Абу\n" +
                "Довуд. «Солат», 1496-ҳадис).\n" +
                "Касалликдан шифо истаб ўқиладиган дуо\n" +
                "Бирор касалликка йўлиққан киши, бу касалликдан халос бўлиши учун ҳеч вақт ўтказмай,\n" +
                "мутахассис шифокорларга мурожаат қилиши, унинг тавсияларига амал қилиб, айни пайтда\n" +
                "дуодан ҳам фойдаланмоғи лозим. Бу дуоларни беморнинг ўзи ўқиши ёки биров унга ўқиши\n" +
                "мумкин.\n" +
                "Таҳоратли ҳолда аввало Фотиҳа сураси, сўнгра Қуръони каримдан шифо оятлари ўқилади.\n" +
                "Бисмилл`аҳир роҳм`анир роҳ`ийм. Ва йашфи суд`уро қовмин муъмин`ийна ва йузҳиб ғойзо\n" +
                "қул`убиҳим.\n" +
                "«Аллоҳ мўминлар қавми сийналарига шифо беради ва дилларидаги аламни кетказади»\n" +
                "(Тавба, 14-15).\n" +
                "Й`а аййуҳан-н`асу қод жааткум мавъизотун мин Роббикум ва шиф`аун лим`а фис-суд`ури\n" +
                "ва ҳудан ва роҳматан лил-муъмин`ийн.\n" +
                "«Эй одамлар! Сизларга Роббингиздан ваъз (насиҳат), диллардаги нарса (ширк иллати)га\n" +
                "шифо ва мўминларга ҳидоят ва раҳмат келди» (Юнус, 57).\n" +
                "Ва нуназзилу минал Қуръ`ани м`а ҳува шиф`а’ун ва роҳматун лил-му’мин`ийн.\n" +
                "«(Биз) Қуръонда(н) мўъминлар учун шифо ва раҳмат бўлган (оят)ларни нозил қилурмиз»\n" +
                "(Ал-Исро, 82).\n" +
                "Қул ҳува лил-лаз`ийна `аману ҳудан ва шиф`аун\n" +
                "«Айтинг: «(Ушбу Қуръон) имон келтирган зотлар учун ҳидоят ва шифодир».\n" +
                "Бу оятлар ўқилгач, бундай дуо этилади: «Алл`оҳумма Роббан-н`аси азҳибил-ба’са, ишфи\n" +
                "Анташ-ш`аф`ий л`а шиф`а’а илл`а шиф`а’ука, шиф`а’ан л`а йуғ`одиру сақ`оман».\n" +
                "«Аллоҳим, эй инсонларнинг Рабби, касалликни маҳв этувчи! Ортда касалликни\n" +
                "қолдирмайдиган шифо бер. Шифо бергувчи фақат Ўзингсан. Сендан ўзга шифо бергувчи\n" +
                "йўқдир» (Абу Довуд. «Жаноиз», 3107-ҳадис).\n" +
                "Алл`оҳумма ишфи ъабдака йанка’лака ъадувван ав йамши лака ил`а сол`атин.\n" +
                "«Аллоҳим, шу бандангга шифо бергинки, Сенинг бир душманингга зиён етказсин ёхуд\n" +
                "Сенинг ризолигингга эришмоқ учун намоз ўқишга юриб борсин».\n" +
                "Бисмилл`аҳи арқ`ика мин кулли шай’ин йу’зика мин шарри кулли нафсин ав ъайну\n" +
                "ҳ`асид`ийн. Алл`оҳумма йашф`ийка, бисмилл`аҳи арқ`ика.\n" +
                "«Сенга изтироб берувчи ҳамма нарсадан, ҳар ҳасадгўй нафсдан ёхуд кўздан Аллоҳнинг номи\n" +
                "ила сенга шифо сўрайман. Аллоҳ номи ила сенга шифо сўрайман» (Термизий. «Жаноиз», 972-\n" +
                "ҳадис).\n" +
                "Никоҳ кечасида ўқиладиган дуо\n" +
                "Икки ракат намоз ўқиб, Аллоҳдан масъуд бўлишларини сўраб, дуо қилгач, «Бисмиллаҳ...»\n" +
                "айтиб «Рoббaн`а ҳаблан`а мин азв`ажин`а ва зуррийй`атин`а қуррота аъй`унин ва’жъалн`а\n" +
                "лил-муттақ`ийна им`aма». \n" +
                "Мен ҳам намоз ўқийман\n" +
                "www.ziyouz.com кутубхонаси 33\n" +
                "«Парвардигоро, хотинларимиздан ва зурриётларимиздан бизларга кўз қувончини бахш эт ва\n" +
                "бизларни тақводорларга пешво қилгин» (Фурқон сураси, 74-оят) оятини ўқиб, завжаси билан\n" +
                "бирга бўлишдан олдин «Бисмилл`аҳир роҳ-м`анир роҳ`ийм. Алл`оҳумма жаннибнаш-шайт`она\n" +
                "ва жаннибиш-шайт`она м`а розақтан`а».\n" +
                "«Аллоҳим, шайтонни биздан ва бизга ато этганинг фарзанддан узоқлаштир» (Бухорий.\n" +
                "«Никоҳ», 66) дуосини ўқийди.\n" +
                "Ҳомиладор аёл ўқийдиган дуо\n" +
                "Ҳомиладор аёл тиббий муолажалардан ўтиш билан бирга диний вазифаларни адо этиши ва\n" +
                "фурсат топиши билан «Оятал курси» ва «Шарҳ» сурасини, сўнг ушбу дуони ўқиши мақбулдир:\n" +
                "«Алл`оҳумма аътин`а сиҳҳатан ва ъ`афийатан ва авл`адан с`олиҳан ва ризқон в`асиъан ва\n" +
                "дуъ`а’ан мақб`улан».\n" +
                "«Аллоҳим, бизга соғлиқ ва офият бер. Хайрли фарзандлар эҳсон эт. Мўл ризқ бер, дуоимни\n" +
                "қабул айла».\n" +
                "Кўз ёрарда ўқиладиган дуо\n" +
                "Бундай пайтда аёлнинг яқинлари унинг ёнида ёхуд қўшни хонада «Оятал курси»ни, сўнгра\n" +
                "Аъроф сурасининг 54-оятини ўқишади:\n" +
                "«Инн`а роббакумуллаз`ий холақос-сам`ав`ати вал-арзо ф`ий ситтати айй`амин суммастав`а\n" +
                "ъалал-ъарши, йуғшил-лайлан-наҳаро йатлубуҳ`у ҳас`исан ваш-шамса вал-қомаро ваннуж`ума\n" +
                "мусаххоротин би амриҳ, ал`а лаҳул-холқу вал-амру таб`арокалл`оҳу Роббулъ`алам`ийн».\n" +
                "\n" +
                "«Дарҳақиқат, Раббингиз осмонлару Ерни олти кунда яратган, сўнгра Аршга истиво қилган,\n" +
                "кундузга тунни қоплатадиган-уни (яъни, тун-кунни) шитоб қувийди – қуёш ой, юлдузларни Ўз\n" +
                "амрига мусаххар (муте) қилиб қўйган Аллоҳдир. Огоҳ бўлингизки, яратиш ва буюриш Унга\n" +
                "хосдир. Оламларнинг рабби Аллоҳ баракотлидир».\n" +
                "Бу оятдан кейин Ихлос, Фалақ, Нас суралари ва Фотиҳа ўқилади. Хайрли бир фарзанд\n" +
                "берилиши учун дуо қилинади.\n" +
                "Солиҳ фарзанднинг дуоси\n" +
                "Исломий тарбия кўрган инсон ота-онаси кексайганда, уларни хорламайди, дилларини\n" +
                "ранжитмайди. Уларнинг ҳақларига бундай дуо қилади:\n" +
                "Роббир-хамҳум`а кам`а роббай`аний соғ`ийро.\n" +
                "«Парвардигоро, ота-онамга марҳамат эт, улар мени марҳамат-ла вояга етказганлари каби»\n" +
                "(Таҳрим, 8).\n" +
                "Масжидга кираётганда...\n" +
                "Алл`оҳумма-афтаҳ л`и абв`аба роҳматик.\n" +
                "«Аллоҳим, менга раҳмат эшикларингни оч».\n" +
                "Масжиддан чиқаётганда...\n" +
                "Алл`оҳумма инн`и ас’алука мин-фазлик.\n" +
                "“Аллоҳим, Сенинг фазлинг ва карамингни сўрайман”. \n" +
                "Мен ҳам намоз ўқийман\n" +
                "www.ziyouz.com кутубхонаси 34\n" +
                "Қабр зиёратида ўқиладиган дуо\n" +
                "Ассал`аму ъалайкум й`а аҳлал-қуб`ур. Яғфирулл`оҳу лан`а ва лакум, антум салафун`а ва\n" +
                "наҳну бил-исри.\n" +
                "«Ассалому алайкум, эй қабр аҳли. Аллоҳ бизни ва сизларни мағфират этсин. Сизлар биздан\n" +
                "олдин келганлардансиз, биз ҳам сизларнинг орқаларингиздан келамиз».\n" +
                "Ҳожатхонага киришдан олдин...\n" +
                "Алл`оҳумма инн`ий аъ`узу бика минар-рижсил-хоб`исил-мухбиси минаш-шайт`ониррож`ийм.\n" +
                "\n" +
                "«Аллоҳим, ифлос ва ёмон нарсалар билан қувилган шайтоннинг ёмонлигидан Сенинг\n" +
                "паноҳингга қочаман».\n" +
                "Ҳожатхонадан чиққанда...\n" +
                "Алҳамдулилл`аҳиллаз`ий азҳаба анний м`а-йуъз`ин`и ва амса-ка ъалаййа м`а йанфаун`ий\n" +
                "субҳ`анака ғуфр`онака роббан`а ва илайкал-мас`ийр.\n" +
                "«Мендан азият берувчи нарсани кетказиб, фойдалисини қолдирган Аллоҳга ҳамд бўлсин.\n" +
                "Аллоҳим, Сени номингни поклаб ёд этаман ва мағфиратингни сўрайман. Эй Роббимиз,\n" +
                "қайтишимиз Сенгадир».\n" +
                "Уйдан чиқаётганда...\n" +
                "Бисмилл`аҳи тавакалту ъалалл`оҳи, ва л`а ҳавла ва л`а қуввата илл`а билл`аҳ.\n" +
                "«Аллоҳ номи ила, Аллоҳга таваккал қилган ҳолда... Куч ва қувват фақат Аллоҳдандир» (Абу\n" +
                "Довуд. «Адаб», 5094-ҳадис).\n" +
                "Уйга кираётганда...\n" +
                "Алл`оҳумма инн`ий ас’алука хойрол-мавлажи ва хойрол-махрожи бисмилл`аҳи ва лижн`а ва\n" +
                "бисмилл`аҳи хорожн`а ва ъалалл`оҳи Роббан`а таваккалн`а.\n" +
                "«Аллоҳим, Сендан кираётганим ва чиқаётганим жойларнинг яхшисини сўрайман. Аллоҳнинг\n" +
                "номи ила кирдик. Аллоҳнинг номи ила чиқдик. Роббимиз Аллоҳга таваккул этдик».\n" +
                "Уйқуда қўрққан кишининг дуоси\n" +
                "Аъ`узу би-калиматилл`аҳит-та`аммати мин-ғозабиҳ`и ва шарри ъиб`адиҳ`и ва мин\n" +
                "ҳамаз`атиш-шай`ат`ийни ва ан йахзур`ун.\n" +
                "«Аллоҳнинг ғазабидан, қулларининг ёмонлигидан, шайтонларнинг ҳар турли ёмонлигидан\n" +
                "Аллоҳнинг барча калималарига юкинаман» (Абу Довуд. «Тиб», 3893-ҳадис).\n" +
                "Дастурхон дуоси\n" +
                "Алҳамдулилл`аҳиллаз`ий атъаман`а ва сақ`она важаъалан`а минал-муслим`ийн.\n" +
                "«Бизни едириб-ичирган ва мусулмонлардан қилган Аллоҳга ҳамд бўлсин».\n" +
                "Фарзанд тилаш дуоси\n" +
                "Мен ҳам намоз ўқийман\n" +
                "www.ziyouz.com кутубхонаси 35\n" +
                "Робб`и л`а тазарни фардав ва анта хойрул в`арис`ийн.\n" +
                "«Парвардигорим! Мени (вориссиз) ёлғиз қолдирма. (Агар ворис бермасанг ҳам) Сенинг Ўзинг\n" +
                "ворисларнинг энг яхшисисан» (Анбиё, 89).\n" +
                "Ғазабланганда ўқиладиган дуо\n" +
                "Алл`оҳуммағфир л`ий занб`ий ва азҳаб ғойзо қолб`ий ва ажирн`ий минаш-шайт`ониррож`ийм.\n" +
                "\n" +
                "Аллоҳим, гуноҳларимни кечир, қалбимнинг ҳиддатини (ғазабини, алангасини) кетказ ва мени\n" +
                "шайтоннинг ёмонлигидан асра.\n" +
                "Шунда ҳам ғазаб кетмаса, имкон топилса, таҳорат олиб икки ракат намоз ўқиш, «Алам\n" +
                "нашроҳ лака...» сурасини тиловат қилиш ва юқоридаги дуони такрорлаш лозим.\n" +
                "Уй сотиб олиб, жойлашгач ўқиладиган дуо\n" +
                "Таҳорат олиб икки ракат намоз ўқилади ва: «Алҳамдулилл`аҳи роббил ъ`алам`ийн. Вассол`ату\n" +
                "вас-сал`аму ъал`а ра-с`улина Муҳаммадин ва ъал`а `алиҳ`и ва саҳбиҳ`и ажмаъ`ийн.\n" +
                "Аъ`узу билл`аҳи минаш-шайт`онир-рож`ийм. Бисмилл`аҳир роҳманир роҳ`ийм. Ла ин\n" +
                "шакартум ла аз`ийданнакум ва лаин кафартум инна аз`аб`ий лашад`ийд», дегач, қуйидагича\n" +
                "дуо қилинади:\n" +
                "Аллоҳим, менга оилам билан бирга яшаладиган бир маскан насиб этдинг, Сенга шукрлар\n" +
                "бўлсин. Мени ва оиламни бу уйда масъуд ва бахтиёр айла. Бизни ҳар турли бало-қазолардан,\n" +
                "фалокатлардан сақла. Аллоҳим, биз ожиз бандалармиз. Бу уй гуноҳлар эмас, балки фақат\n" +
                "хайрли ва гўзал ишлар ҳақида гапириладиган ва эзгу амаллар бажариладиган жой бўлсин.\n" +
                "Раббим, қўшниларимга азият етказишдан мени асра. Яхши қўшнилар насиб эт. Аллоҳим, Сенга\n" +
                "ҳамду сано, суюкли Пайғамбарингга салоту саломлар бўлсин.\n" +
                "Кўз тегишга қарши ўқиладиган дуо\n" +
                "Кўз тегишига қарши Фотиҳа сураси ва «Оятал курси»дан сўнг ушбу оятлар ўқилади:\n" +
                "Бисмилл`аҳир роҳм`анир роҳ`ийм. Ва ин йак`адуллаз`ийна кафар`у лайузлиқ`унака би\n" +
                "абс`ориҳим ламм`а самиъуззикро ва йақ`ул`уна иннаҳ`у ламажн`ун. Ва м`а ҳува илл`а\n" +
                "зикрул-лил-ъ`алам`ийн.\n" +
                "«Албатта, кофир кимсалар Зикрни (Қуръонни) эшитган вақтларида, Сизни кўзлари билан\n" +
                "йиқитаёзурлар ва «албатта, у мажнун», дерлар. Ҳолбуки, у (Қуръон барча) оламлар учун\n" +
                "эслатмадир» (Қалам,51–52).\n" +
                "Садақа бераётганда...\n" +
                "Роббан`а тақоббал минн`а иннака антас-сам`иъул ъал`ийм.\n" +
                "«Эй Роббимиз, биздан уни қабул айла, чунки Сен эшитгувчи ва билгувчисан».\n" +
                "Аксирган кишига айтиладиган дуо\n" +
                "Аксирган киши, ёнида бирор одам бўлса ҳам, бўлмаса ҳам, «Алҳамдулилл`аҳ» дейди.\n" +
                "Жаноби Пайғамбаримиз (с.а.в.) аксирган кишига ёнидагиларнинг «Ярҳамукалл`оҳ» (Аллоҳ\n" +
                "сенга раҳмат этсин) дейишини тавсия қилганлар. Акса урган киши эса «Ярҳамукалл`оҳу ва\n" +
                "ийй`акум ва йағфиру лан`а ва лакум» (Аллоҳ бизга ҳам, сизга ҳам раҳмат айласин, бизни ҳам, \n" +
                "Мен ҳам намоз ўқийман\n" +
                "www.ziyouz.com кутубхонаси 36\n" +
                "сизни ҳам афу этсин) ёхуд «Яҳд`ина ва йаҳд`ийкумулл`оҳ» (Аллоҳ бизни ҳам, сизни ҳам\n" +
                "ҳидоятга бошласин) дейди.\n" +
                "Ҳилол (янги ой) кўринганида...\n" +
                "Талҳа ибн Убайдуллоҳдан (р.а.) ривоят қилинишича, Жаноби Пайғамбаримиз (с.а.в.) янги\n" +
                "ойни кўрганларида бундай дуони ўқиганлар: Алл`оҳумма аҳиллаҳу ъалайн`а бил-йумни валийм`ани\n" +
                "вас-сал`амати вал-исл`ам, робб`ий ва роббукалл`оҳ.\n" +
                "Аллоҳим, бу ойни бизга қутлуғ ва баракотли бир ой айла. Имон, саломат ва Ислом-ла лиқ\n" +
                "тўлиб безанган кечаларда чиқсин. Эй ҳилол! Сенинг ҳам, менинг ҳам Раббимиз Аллоҳдир\n" +
                "(Термизий. «Даъват», 3677-ҳадис).\n" +
                "Уловга минилаётганда ўқиладиган дуо\n" +
                "«Оятал курси» ўқилгач, «Субҳ`аналлаз`ий саххоро лан`а ҳ`аз`а ва м`а кунн`а лаҳ`у\n" +
                "муқрин`ийн. Ва инн`а ил`а роббин`а ламун-қолиб`ун. Бисмилл`аҳи мажр`оҳа ва мурс`оҳа.\n" +
                "Инна роббий ла Ғоф`урур-Роҳ`ийм» дейилади.\n" +
                "Давомида қуйидагича дуо айтилса ҳам бўлади: Аллоҳим, Сенинг номинг билан йўлга\n" +
                "чиқмоқдаман. Менга соғлиқ ва ҳалол касб насиб этганинг учун Сенга шукрлар айтаман. Йўл\n" +
                "давомида мени ва уловимга минган йўловчиларни бало-қазолардан, ҳар турлик хавфу\n" +
                "хатарлардан Ўзинг асра, ёрдамингни дариғ тутма биздан, ё Раббий. Биз қанчалар гуноҳкор\n" +
                "бўлмайлик, Сен бизни мағфират эт. Манзилимизга эсон-омон етиб боришни насиб айла.\n" +
                "Фарзандларимизни етим қолдирма, Парвардигоро. Қайтишимизда оиламизни ғам-андуҳсиз\n" +
                "кўрмоқни лутф айла. Сен ҳамма нарсага қодир Зотсан, Аллоҳим.\n" +
                "Фаришталарнинг мўминларга дуоси\n" +
                "Аршни кўтариб турган ва унинг атрофидаги фаришталар мўминлар ҳақига бундай дуо\n" +
                "қилишади: Роббан`а васиъта кулла шайъин роҳматан ва ъилман фағфир лиллаз`ийна т`аб`у\n" +
                "ваттабаъ`у саб`ийлака вақ`иҳим аз`абал-жаҳ`ийм. Роббан`а ва адхил-ҳум жанн`ати\n" +
                "ъадниниллат`ий ва адтаҳум ва ман солаҳа мин `аб`аиҳим ва азв`ажиҳим ва зуррий`атиҳим\n" +
                "иннака антал аз`изул ҳак`ийм. Вақ`иҳимус-саййи`ати, ва ман тақис-саййи`ати, йавмаизин\n" +
                "фақод роҳимтаҳ ва з`алика ҳувал фавзул ъаз`ийм.\n" +
                "«Парвардигоро, Ўзинг раҳмат ва илм жиҳатдан барча нарсада кенгдирсан. Бас, тавба қилган\n" +
                "ва йўлингга эргашган кишиларни мағфират эт ва уларни дўзах азобидан сақла. Парвардигоро,\n" +
                "уларни ҳам, уларнинг ота-боболари, жуфти ҳалоллари ва зурриётлари орасидаги солиҳ бўлган\n" +
                "кишиларни ҳам Ўзинг уларга ваъда қилган мангу жаннатларга дохил қилгин. Албатта, Сен\n" +
                "қудрат ва ҳикмат соҳибидирсан» (Мўмин сураси,7-9).\n" +
                "Дўкон ёхуд ишхонани очаётганда...\n" +
                "Алл`оҳумма й`а муфаттиҳал-абв`аб, ифтаҳ лан`а хойрил-б`аб. Алл`оҳуммарзуқн`а ризқан\n" +
                "ҳал`алан тоййибан, ва ризқон в`асиан бироҳматика й`а Арҳамар –Р`оҳим`ийн, ва Анта\n" +
                "хойрур-Р`озиқ`ийн.\n" +
                "Эй эшикларни очувчи Аллоҳим! Бизга хайрли эшикларни оч. Аллоҳим! Бизга ҳалол ва тоза\n" +
                "ризқлар эҳсон айла, ризқимизни кенгайтир, эй марҳаматлиларнинг марҳаматлиси! Ризқ\n" +
                "бергувчиларнинг энг хайрлиси Сенсан! \n" +
                "Мен ҳам намоз ўқийман\n" +
                "www.ziyouz.com кутубхонаси 37\n" +
                "Камбағалликдан қутулиш дуоси\n" +
                "Бисмилл`аҳи ъал`а нафс`и ва м`ал`и ва д`ин`и. Алл`оҳумма роззини би қоз`оика ва\n" +
                "б`арик л`и ф`им`а қуддиро л`и ҳатт`а л`а уҳибба таъж`ил`а м`а аххарта ва л`а таъх`ира\n" +
                "м`а ажжалта.\n" +
                "Ўзим, молим ва диним хусусида Аллоҳ номи билан (сўрайман). Аллоҳим, қазо ва ҳукмингга\n" +
                "мени рози қил, менга тақдир этганинг нарсаларни баракатли эт. Шундай бўлсинки, кейинга\n" +
                "қолдирганингни ҳозир, ҳозир берадиганингни кейин сўраб юрмайин («Ал-азкор», 116-бет).\n" +
                "Дарс тайёрлашда ёки имтиҳонга киришда ўқиладиган дуо\n" +
                "(Таҳоратли ҳолда дарс тайёрлаган яхши. Дуолар «`Бисмиллоҳ...»дан сўнг ўқилади.)\n" +
                "Робби зидн`и ъилман ва фаҳман вал-ҳиқн`и бис-с`олиҳ`ин. Роббишроҳ л`и содри ва йассир\n" +
                "л`и амр`и ваҳлул ъуқдатан мин лис`ани йафқоҳ`у қовли й`а Ҳ`афиз, й`а Роқ`иб, й`а Н`асир,\n" +
                "й`а Алл`оҳ. Робби йассир ва л`а туъассир. Робби таммим бил-хойри.\n" +
                "Раббим! Илмимни ва зеҳнимни орттир ва мени солиҳ бандаларинг қаторига қўш.\n" +
                "Раббим! Кўксимни оч, ишимни осон айла ва тилимнинг тугунини ечгин, сўзимни\n" +
                "тушунсинлар. Ў Ҳофиз, ё Роқиб, ё Носир, ё Аллоҳ.\n" +
                "Раббим! Осон қилгин, қийин қилма. Раббим, (ишимни) яхшилик билан тугатгин.\n" +
                "(Имтиҳонга киришдан олдин уч, беш ёки етти марта `Оятал курси” ўқилади.)\n" +
                "Сафар дуоси\n" +
                "Алл`оҳумма илайка таважжаҳту ва бика иътасомту. Алл`оҳумма акфин`и м`а аҳамман`и ва\n" +
                "м`а л`а аҳтамту лаҳ`у.\n" +
                "Алл`оҳумма заввиднит-тақв`а, вағфирл`и занб`и ва важжиҳн`и лил-хойри айна м`а\n" +
                "таважжаҳту.\n" +
                "Аллоҳим, Сен томон интилдим. Сенга юкиндим. Аллоҳим, мени андишалантирган ёхуд\n" +
                "андишалантирмаган хусусларда Сен менга кифоя қил. Тақвони менга озуқа қил, Аллоҳим!\n" +
                "Гуноҳимни кечир ва қаерга бормайин, мени доимо яхшиликка бошла, ё Раббий.\n" +
                "(Пайғамбаримиз, соллаллоҳу алайҳи ва саллам, ҳар гал йўлга чиққанда ушбу дуони ўқир\n" +
                "эдилар.) («Ал-азкор», 195-бет).\n" +
                "Бисмилл`аҳир роҳм`анир роҳ`ийм. Субҳ`аналлаз`ий саххора лан`а ҳ`аз`а ва м`а кунна\n" +
                "лаҳ`у муқрин`ийн. Ва инн`а ил`а Роббин`а ла мунқолиб`ун.\n" +
                "«Бу уловларни бизнинг хизматимизга берган Аллоҳ буюкдир. У барча айбу нуқсонлардан\n" +
                "муназзаҳдир. Йўқса, бизнинг буларга кучимиз етмас эди» ояти ўқилади ва уч марта\n" +
                "«Алҳамдулиллаҳ» ва уч марта «Аллоҳу акбар» дегач:\n" +
                "Субҳ`анака инн`и золамту нафс`и фағфирл`и, иннаҳ`у л`а йағфируз-зун`уба илл`а Анта.\n" +
                "Аллоҳни айбу нуқсонлардан поклаб ёд этаман, мен ўз нафсимга зулм қилдим. Аллоҳим!\n" +
                "Мени кечир. Чунки Сендан бошқа кечиргувчи йўқ («Аз-азкор», 145-бет).\n" +
                "Ўлим хабарини эшитганда ўқиладиган дуо\n" +
                "Инн`а лилл`аҳи ва инн`а илайҳи р`ожиъ`ун. Алл`оҳуммактубҳ`у фил-муҳсин`ийна важъал\n" +
                "кит`абаҳ`у ф`ий иллийй`ин. Вахлуфҳу ъал`а ъақобиҳ`и фил-ғ`обир`ин. Алл`оҳумма л`а\n" +
                "туҳарримн`а ажроҳ`у вал`а тафтинн`а баъдаҳ`у вағфир лан`а ва лаҳ.\n" +
                "Бизни Аллоҳ келтирди, яна Унга қайтамиз ва албатта Раббимизга қовушамиз. Аллоҳим!\n" +
                "Уни(маййитни) даргоҳингдаги яхши кишилар қаторига ёз, китобини фазилатлиларникидан\n" +
                "айла. Ортда қолганларига кафил бўл. \n" +
                "Мен ҳам намоз ўқийман\n" +
                "www.ziyouz.com кутубхонаси 38\n" +
                "Аллоҳим! Бизни унинг ажридан маҳрум этма. Ундан ке-йин бизни фитнага йўлиқтирма, бизни\n" +
                "ва уни афв эт.\n" +
                "САЛОВОТЛАР\n" +
                "Салоти мунжийа\n" +
                "Алл`оҳумма солли ъал`а саййидин`а Муҳаммадин ва ъал`а `али саййидин`а Муҳаммад,\n" +
                "сал`атан тунж`ин`а биҳ`а мин-жамиъил аҳв`али вал `аф`ат. Ва тақз`и лан`а биҳ`а жамиъал\n" +
                "ҳ`аж`ат ва тутоҳҳирун`а биҳ`а мин-жамиъис-саййи`ат. Ва тарфа-ъун`а биҳ`а ъалад-дарож`ат\n" +
                "ва тубаллиғун`а биҳ`а ақсол-ғ`ой`оти, мин-жамиъил хойр`оти фил-ҳай`ати ва баъдал мам`ат.\n" +
                "Аллоҳим! Жаноби Пайғамбаримиз Муҳаммад Мустафога беадад салот ва салом бўлсин. Бу\n" +
                "салотлар, саломлар ва дуолар бизни ҳар турли бало ва мусибатлардан халос этсин, барча\n" +
                "эҳтиёжларимизни кеткизиб, бизни гуноҳлардан покласин. Бизни юксак даража ва мартабаларга\n" +
                "кўтарсин. Аллоҳим! Бу салот ва саломлар туфайли ўлгандан ке-йин хайр (яхшилик)ларга ноил\n" +
                "бўлайлик.\n" +
                "Салоти фатҳиййа\n" +
                "Алл`оҳумма солли ва саллим ва б`арик ъал`а саййидин`а Муҳаммадинил-ф`атиҳи лим`а\n" +
                "уғлиқо вал-х`отими лим`а сабақо, Н`асирил-ҳаққи билҳаққи, вал ҳ`ад`и ил`а сир`отикалмустақ`им\n" +
                "ва ъал`а `алиҳ`и ҳаққо қадриҳ`и ва миқд`ариҳил-ъаз`ийм.\n" +
                "Аллоҳим! Суюкли Пайғамбаримиз Муҳаммад Мустафога салот ва саломлар бўлсин. Бизга\n" +
                "Сенинг яширин хазиналарингни очиб берган Удир. Пайғамбарлар ҳалқасининг охири Удир,\n" +
                "Ҳақнинг энг катта ёрдамчиси Удир, инсонларга тўғри йўлни кўрсатган Удир! Унга ва\n" +
                "яқинларига сўнгсиз салот ва саломлар бўлсин.\n" +
                "Бошқа бир саловот\n" +
                "Алл`оҳумма солли ъал`а саййидин`а Муҳаммадинин-набиййил-уммиййи ва ъал`а `алиҳи ва\n" +
                "саҳбиҳ`и ва саллим.\n" +
                "Саййидул истиғфор\n" +
                "(Ривоят қилинишича, истиғфорларнинг энг афзали ушбудир):\n" +
                "Алл`оҳумма анта Робб`и ва ан`а ъабдука, холақтан`и ва ан`а ъал`а ъаҳдика ва ваъдика\n" +
                "мастатоъту, аъ`узу мин шарри м`а сонаъту аб`уъу лака биниъматика ъаллаййа ва аб`уъу\n" +
                "ъал`а нафс`и би занб`и, фақод золамту нафс`и ваътарофту би занб`и, фағфирл`и зун`уб`и,\n" +
                "м`а қоддамту минҳ`а ва м`а аххорту, фа иннаҳ`у л`а йағфируз-зун`уба илл`а ант.\n" +
                "Аллоҳим! Сен менинг Раббимсан! Мен эса Сенинг қулингман. Мени Сен яратдинг. Мен кучим\n" +
                "етгунча Сенга берган аҳд ва ваъдамда собитман. Биламан, берган неъматларингга муқобил\n" +
                "(шукр қилишда) нуқсонга йўл қўйдим, нафсимга зулм қилдим. Гуноҳларимни тан оламан,\n" +
                "ўтмиш ва келгуси гуноҳларимни кечиришингни Ўзингдан сўрайман. Мени кечиргин, Аллоҳим!\n" +
                "Сендан ўзга кечиргувчи йўқдир (Термизий. «Даъват», 3393-ҳадис).\n" +
                "Яна бир истиғфор дуоси\n" +
                "Астағфирулл`оҳ, астағфирулл`оҳ, астағфирулл`оҳ ал-ъаз`ийм, ал-Кар`ийм, аллаз`ий л`а\n" +
                "ил`аҳа илл`а ҳ`у, ал-Ҳаййул-Қойй`ум ва нат`убу илайҳ ва насъалуҳут-тавбата вал-мағфирота\n" +
                "Мен ҳам намоз ўқийман\n" +
                "www.ziyouz.com кутубхонаси 39\n" +
                "вал-ҳид`айата лан`а иннаҳ`у ҳуват-тавв`абур-роҳ`ийм. Тавбата ъабдин з`олимин линафсиҳ`и\n" +
                "л`а йамлику линафсиҳ`и мавтан вал`а ҳай`атан вал`а нуш`уро.\n" +
                "Улуғ Аллоҳдан мағфират сўрайман!\n" +
                "Азим ва Карим бўлган, Ўзидан бошқа ҳеч бир илоҳ бўлмаган, Ҳайй ва Қаййум бўлган\n" +
                "Аллоҳдан мағфират сўрайман. Унга қайтамиз. Тавбамизни қабул этиб, мағфират ва ҳидоят\n" +
                "насиб қилишини тилаймиз, чунки У тавбаларни қабул қилгувчи, раҳмли, меҳрибондир. Нафсига\n" +
                "зулм (ҳақсизлик) қилган, ўлдириш ёки қайта тирилтиришга ва (Қиёмат куни) тўплашга ожиз\n" +
                "бўлган банданинг тавбаси каби тавба қиламиз.\n" +
                "Намоздан сўнг ўқиладиган бошқа дуолар\n" +
                "Л`а ил`аҳа иллалл`оҳу ваҳдаҳ`у л`а шар`ийка лаҳ, лаҳул-мулку ва лаҳул ҳамд ва ҳува\n" +
                "ъал`а кулли шайъ`ин қод`ийр. Алл`оҳумма л`а маниаъ лим`а аътойта ва л`а муътийа лим`а\n" +
                "манаъта ва л`а йанфаъу зал-жадди минкал-жадд.\n" +
                "Аллоҳдан бошқа илоҳ йўқ. Унинг тенги ва шериги йўқ. Мулк Уникидир. Ҳамд Унгадир. У ҳар\n" +
                "нарсага қодирдир. Аллоҳим! Сенинг берганингга монелик қилувчи ҳеч нарса йўқ.\n" +
                "Бермаганингни берадиган ҳеч кимса йўқдир. Мол-дунё эгасининг мол-дунёси Сенинг эҳсонинг\n" +
                "ўрнига ўтиб, унга фойда бермайди (Муслим. «Масажид», 137).\n" +
                "* * *\n" +
                "Алҳамдулилл`аҳи роббил `аълам`ийн. Вал-`ақибату лил-муттақ`ийн, ва л`а удв`ана илл`а\n" +
                "ъалаз-з`олим`ийн. Вассол`ату вас-сал`аму ъал`а рас`улина Муҳаммадин ва ъал`а `алиҳ`и ва\n" +
                "асҳ`абиҳ`и ажма`ийн.\n" +
                "Алл`оҳумма роббан`а, й`а роббан`а тақоббал минн`а сол`атан`а ва қий`аман`а ва\n" +
                "рукуъан`а ва таҳл`илан`а ва тазарруъан`а ва таммим тақс`иран`а ва л`а тазриб биҳ`а\n" +
                "вуж`уҳан`а й`а Мавл`ан`а.\n" +
                "Алл`оҳумма `атин`а сиҳҳатан ва ъ`афийатан ва саъ`адатан ва рифқон ва авл`адан\n" +
                "с`олиҳан ва ъилман н`афи-ъан ва ризқон в`аси-ъан ва ъамалан мақб`улан, й`а арҳамарр`оҳим`ийн.\n" +
                "Роббанағфирл`и валив`алидайй`а валил-муъмин`ийна явма яқ`умул-ҳис`аб.\n" +
                "Ҳамду сано оламларнинг Рабби Аллоҳга хосдир (Унга ҳамд бўлсин). Тақво эгалари учун\n" +
                "гўзал бир оқибат, золимлар учун эса душманлик ва қўрқувдан бошқа нарса йўқ. Жаноби\n" +
                "Пайғамбаримиз Муҳаммад Мустафога, ул зотнинг яқинлари ва саҳобаларига салот ва салом\n" +
                "бўлсин.\n" +
                "Аллоҳим! Эй Раббимиз! Намозимизни, қиёмимизни, рукуларимизни, саждаларимизни,\n" +
                "ўтиришларимизни, тазарру ва ниёзларимизни қабул айла. Нуқсон-камчиликларимизни Сен\n" +
                "мукаммал қилгин. Эй Мавломиз! Камчиликларимизни юзимизга урма.\n" +
                "Аллоҳим! Бизга соғлиқ ва офият, бахт ва ширин ҳаёт ва гўзаллик бер, хайрли фарзандлар\n" +
                "насиб эт. Ў Раббим! Бизга фойдали илм, мўл ризқ ва мақбул амаллар насиб айла. Эй\n" +
                "марҳаматлиларнинг энг марҳаматлиси бўлган Аллоҳим.\n" +
                "Эй Роббим! Мени, ота-онамни ва барча мўминларни кечир, бизни жаҳаннам азобидан асра. \n" +
                "Мен ҳам намоз ўқийман\n" +
                "www.ziyouz.com кутубхонаси 40\n" +
                "ҚУРЪОНИ КАРИМДАН ОЯТЛАР\n" +
                "Бақара сурасидан\n" +
                "Бисмиллаҳир роҳманир роҳийм.\n" +
                "`Аманар-рос`улу бим`а унзила илайҳи мирроббиҳ`и вал-муъмин`ун. Куллун `амана\n" +
                "билл`аҳи ва мал`а’икатиҳ`и ва кутубиҳ`и ва русулиҳ. Л`а нуфарриқу байна аҳадим-миррусулиҳ.\n" +
                "Ва қ`ол`у самеън`а ва атоън`а, ғуфр`онака, роббан`а ва илайкал мас`ийр.\n" +
                "Л`а йукаллифулл`оҳу нафсан илл`а вусъ`аҳа. Лаҳ`а м`а касабат ва ъалайҳ`а мак-тасабат.\n" +
                "Роббан`а л`а ту`ахизн`а ин-нас`ийн`а ав ахтоън`а, Роббан`а вал`а таҳмил ъалайн`а исрон\n" +
                "кам`а ҳамалтаҳ`у ъалал-лаз`ийна мин қоблин`а, Роббан`а вал`а туҳаммилн`а м`а л`а\n" +
                "т`оқота лан`а биҳ. Ваъфу ъанн`а, вағфир лан`а, варҳамн`а. А`нта Мавл`ан`а фансурн`а\n" +
                "ъалал қовмил к`афир`ийн.\n" +
                "Ҳашр сурасидан\n" +
                "Бисмилл`аҳир роҳм`анир роҳ`ийм.\n" +
                "Лав анзалн`а ҳ`азал Қуръ`ана ъал`а жабалин лароайтаҳ`у х`оши-ъан мутасоддиъан мин\n" +
                "хошйатилл`аҳ ва тилкал амс`алу назрибуҳ`а лин-н`аси ла-ъаллаҳум йатафаккар`ун.\n" +
                "Ҳувалл`оҳуллаз`и л`а ил`аҳа илл`а ҳ`у, ъ`алимул-ғойби ваш-шаҳ`адаҳ, ҳувар-роҳм`анурроҳ`ийм.\n" +
                "Ҳувалл`оҳуллаз`ий л`а ил`аҳа илл`а ҳ`у, ал-маликул-қудд`усус-сал`амул-муъминулмуҳайминул-ъаз`изул-жабб`арул-мутакаббир.\n" +
                "Субҳ`аналл`оҳи ъамм`а йушрик`ун.\n" +
                "Ҳувалл`оҳул-х`олиқул б`ари-ъул-мусоввиру лаҳул асм`а-ъул ҳусн`а, йусаббиҳ`у лаҳ`у м`а\n" +
                "фис-сам`ав`ати вал-арз, ва ҳувал ъаз`изул-ҳак`ийм.\n" +
                "«Бақара» ва «Ҳашр» сураларининг бу сўнгги оятларини намоздан сўнг тиловат қилинса,\n" +
                "савоби улуғ бўлиши ҳадиси шарифларда марҳамат қилинган. \n" +
                "Мен ҳам намоз ўқийман\n" +
                "www.ziyouz.com кутубхонаси 41\n" +
                "ҚУРЪОН ОЯТЛАРИГА\n" +
                " ШЕЪРИЙ ТАФСИР\n" +
                "Ҳамд бўлсин Аллоҳга, ҳамд бўлсин ҳар он,\n" +
                "Унинг ҳукмидадир само ва замин.\n" +
                "Мақтовга лойиқ зот Удир ҳар замон:\n" +
                "Алҳамдулилл`аҳи Роббил `аълам`ийн.\n" +
                "Аллоҳ айтганидай ажралар ҳиссанг,\n" +
                "Шубҳасиз, бу қулга буюк мукофот.\n" +
                "Намоз қил, закот бер мусулмон бўлсанг:\n" +
                "Ва ақимус-сол`ата ва `атуз-зак`ат...\n" +
                "Кофир бир азобга бўлади асир,\n" +
                "Эй мусулмон қуллар, буни-да билинг.\n" +
                "Аллоҳнинг лаънати кофирларгадир:\n" +
                "Фалаънатулл`оҳи ъалал к`афир`ийн...\n" +
                "Инсонлар ўйлашда, ҳаракатда ҳур,\n" +
                "Ҳаракатингизда тамкинли бўлинг.\n" +
                "Аллоҳ сиз бажарган ҳар ишни кўрур:\n" +
                "Валл`оҳу бас`ийрун бим`а йаъмал`ун...\n" +
                "Унинг қудратидан тупроқ ва само,\n" +
                "Ирода Ундадир, У бергай амр.\n" +
                "У ҳар ишга қодир, амир доимо:\n" +
                "Валл`оҳу ъал`а кулли шайъин қод`ийр...\n" +
                "Ҳар он тилда ва дилда,\n" +
                "Мусулмон шиори шу:\n" +
                "Илоҳ йўқ Ундан бошқа —\n" +
                "Л`а ил`аҳа илл`а ҳ`у...\n" +
                "Иймон нури сизга йўлни кўрсатур,\n" +
                "Ҳақиқат йўлини танла-да, боргин.\n" +
                "Тўғри йўлдан кетган қулларни билур:\n" +
                "Ва ҳува аъламу бил муҳтад`ийн...\n" +
                "Роббинг неъматини совурма, инсон,\n" +
                "Сени исроф чоҳига тортмасин кайфинг.\n" +
                "У исрофгарларни ёқтирмас мудом:\n" +
                "Иннаҳ`у л`а йуҳиббул мусриф`ийн...\n" +
                "Тилагинг бўлса гар, Аллоҳдан тила,\n" +
                "Йўқса ишинг сўнги албатта ваҳим.\n" +
                "Ҳар ишни бошлагин Аллоҳ номи-ла:\n" +
                "Бисмилл`аҳир роҳм`анир роҳ`ийм...\n" +
                "Ҳақнинг ҳузурида ким у қувватли, \n" +
                "Мен ҳам намоз ўқийман\n" +
                "www.ziyouz.com кутубхонаси 42\n" +
                "Жами инсонларга ҳисоб бор, ҳисоб.\n" +
                "Аллоҳнинг азоби, бил, кўп шиддатли:\n" +
                "Ва инналл\n" +
                "`оҳа шад\n" +
                "`идул аз\n" +
                "`аб...\n" +
                "Мусулмон бекорга урмас ва сўкмас,\n" +
                "Кимсани эзмоққа қидирмас айбин.\n" +
                "Шубҳа йўқки, Аллоҳ золимни суймас:\n" +
                "Валл\n" +
                "`оҳу\n" +
                "л\n" +
                "`\n" +
                "а йуҳиббуз\n" +
                "-\n" +
                "з\n" +
                "`олим\n" +
                "`ийн...\n" +
                "Сабр этган доимо муродга етар,\n" +
                "Эй мўминлар, сиз ҳам муродга етинг.\n" +
                "Аллоҳ ҳам сабрли қулларни севар:\n" +
                "Валл\n" +
                "`оҳу йуҳиббус\n" +
                "-\n" +
                "с\n" +
                "`обир\n" +
                "`ийн...\n" +
                "Тўғри яшамоқлик, ҳа, қийин бир иш,\n" +
                "Лек шундай яшамоқ сенга вазифа.\n" +
                "Инсон шундай ожиз яратилмиш:\n" +
                "Ва хулиқол инс\n" +
                "`ану\n" +
                "з\n" +
                "`оифа...\n" +
                "Жаҳаннам кофир\n" +
                "-ла буткул тўлади,\n" +
                "У муфлис, кофирлар,\n" +
                "ў, қандай ёнар!\n" +
                "Уларнинг ётоғи олов бўлади:\n" +
                "Ул\n" +
                "`\n" +
                "а\n" +
                "’ика маъва ҳумун\n" +
                "-\n" +
                "н\n" +
                "`ар...\n" +
                "У кундир мўминлар ишонган бир кун, У – қиёмат куни, теппангда Курси. У – бутун инсонлар тўпланажак кун:\n" +
                "Йавмун мажм\n" +
                "`уун лаҳун\n" +
                "н\n" +
                "`асу...\n" +
                "Энг тўғри ҳукмни Cен берасан, Cен,\n" +
                "Эй буюк Аллоҳим, эй буюк Роббим.\n" +
                "Ҳар нени эшитиб, ҳам кўрасан Cен:\n" +
                "Иннака антас\n" +
                "-сам\n" +
                "`иъул ъал\n" +
                "`ийм...\n" +
                "Ҳақ ҳудудидан ошма,\n" +
                "Йиқилур сўнгра бино.\n" +
                "Зинога яқинлашма:\n" +
                "Вал\n" +
                "`\n" +
                "а тақрибуз\n" +
                "-зин\n" +
                "`\n" +
                "а...\n" +
                "Бир кун албат битгай бу ҳирс, бу ҳавас,\n" +
                "Ҳаққа, ҳақиқатга айлагил хизмат.\n" +
                "Ўлимни тотгайдир албат ҳар бир нафс:\n" +
                "Куллу нафсин\n" +
                "з\n" +
                "`оиқотул\n" +
                "-мавт...\n" +
                "Унинг ҳукмидадир само ва замин,\n" +
                "Кўнглинг\n" +
                "у Холиққа шукрон\n" +
                "-ла тўлсин.\n" +
                "Оламларнинг Робби, Роббга ҳамд бўлсин:\n" +
                "Вал\n" +
                "-ҳамдулилл\n" +
                "`аҳи роббил\n" +
                "ъ\n" +
                "`алам\n" +
                "`ийн...";

textView.append(s);








    }
}
